RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
/* CFR Bit Fields */
#define AFE_CFR_HW_TRG_MASK                      0x200u
#define AFE_CFR_HW_TRG_SHIFT                     9
#define AFE_CFR_HW_TRG_WIDTH                     1
#define AFE_CFR_HW_TRG(x)                        (((uint32_t)(((uint32_t)(x))<<AFE_CFR_HW_TRG_SHIFT))&AFE_CFR_HW_TRG_MASK)
#define AFE_CFR_DEC_CLK_INP_SEL_MASK             0x400u
#define AFE_CFR_DEC_CLK_INP_SEL_SHIFT            10
#define AFE_CFR_DEC_CLK_INP_SEL_WIDTH            1
#define AFE_CFR_DEC_CLK_INP_SEL(x)               (((uint32_t)(((uint32_t)(x))<<AFE_CFR_DEC_CLK_INP_SEL_SHIFT))&AFE_CFR_DEC_CLK_INP_SEL_MASK)
#define AFE_CFR_DEC_CLK_EDGE_SEL_MASK            0x800u
#define AFE_CFR_DEC_CLK_EDGE_SEL_SHIFT           11
#define AFE_CFR_DEC_CLK_EDGE_SEL_WIDTH           1
#define AFE_CFR_DEC_CLK_EDGE_SEL(x)              (((uint32_t)(((uint32_t)(x))<<AFE_CFR_DEC_CLK_EDGE_SEL_SHIFT))&AFE_CFR_DEC_CLK_EDGE_SEL_MASK)
#define AFE_CFR_CC_MASK                          0x1000u
#define AFE_CFR_CC_SHIFT                         12
#define AFE_CFR_CC_WIDTH                         1
#define AFE_CFR_CC(x)                            (((uint32_t)(((uint32_t)(x))<<AFE_CFR_CC_SHIFT))&AFE_CFR_CC_MASK)
#define AFE_CFR_DEC_EN_MASK                      0x2000u
#define AFE_CFR_DEC_EN_SHIFT                     13
#define AFE_CFR_DEC_EN_WIDTH                     1
#define AFE_CFR_DEC_EN(x)                        (((uint32_t)(((uint32_t)(x))<<AFE_CFR_DEC_EN_SHIFT))&AFE_CFR_DEC_EN_MASK)
#define AFE_CFR_SD_MOD_EN_MASK                   0x4000u
#define AFE_CFR_SD_MOD_EN_SHIFT                  14
#define AFE_CFR_SD_MOD_EN_WIDTH                  1
#define AFE_CFR_SD_MOD_EN(x)                     (((uint32_t)(((uint32_t)(x))<<AFE_CFR_SD_MOD_EN_SHIFT))&AFE_CFR_SD_MOD_EN_MASK)
#define AFE_CFR_BYP_MODE_MASK                    0x20000u
#define AFE_CFR_BYP_MODE_SHIFT                   17
#define AFE_CFR_BYP_MODE_WIDTH                   1
#define AFE_CFR_BYP_MODE(x)                      (((uint32_t)(((uint32_t)(x))<<AFE_CFR_BYP_MODE_SHIFT))&AFE_CFR_BYP_MODE_MASK)
#define AFE_CFR_PGA_GAIN_SEL_MASK                0x380000u
#define AFE_CFR_PGA_GAIN_SEL_SHIFT               19
#define AFE_CFR_PGA_GAIN_SEL_WIDTH               3
#define AFE_CFR_PGA_GAIN_SEL(x)                  (((uint32_t)(((uint32_t)(x))<<AFE_CFR_PGA_GAIN_SEL_SHIFT))&AFE_CFR_PGA_GAIN_SEL_MASK)
#define AFE_CFR_PGA_EN_MASK                      0x1000000u
#define AFE_CFR_PGA_EN_SHIFT                     24
#define AFE_CFR_PGA_EN_WIDTH                     1
#define AFE_CFR_PGA_EN(x)                        (((uint32_t)(((uint32_t)(x))<<AFE_CFR_PGA_EN_SHIFT))&AFE_CFR_PGA_EN_MASK)
#define AFE_CFR_DEC_OSR_MASK                     0xE0000000u
#define AFE_CFR_DEC_OSR_SHIFT                    29
#define AFE_CFR_DEC_OSR_WIDTH                    3
#define AFE_CFR_DEC_OSR(x)                       (((uint32_t)(((uint32_t)(x))<<AFE_CFR_DEC_OSR_SHIFT))&AFE_CFR_DEC_OSR_MASK)
/* CR Bit Fields */
#define AFE_CR_STRTUP_CNT_MASK                   0xFE00u
#define AFE_CR_STRTUP_CNT_SHIFT                  9
#define AFE_CR_STRTUP_CNT_WIDTH                  7
#define AFE_CR_STRTUP_CNT(x)                     (((uint32_t)(((uint32_t)(x))<<AFE_CR_STRTUP_CNT_SHIFT))&AFE_CR_STRTUP_CNT_MASK)
#define AFE_CR_RESULT_FORMAT_MASK                0x40000u
#define AFE_CR_RESULT_FORMAT_SHIFT               18
#define AFE_CR_RESULT_FORMAT_WIDTH               1
#define AFE_CR_RESULT_FORMAT(x)                  (((uint32_t)(((uint32_t)(x))<<AFE_CR_RESULT_FORMAT_SHIFT))&AFE_CR_RESULT_FORMAT_MASK)
#define AFE_CR_DLY_OK_MASK                       0x200000u
#define AFE_CR_DLY_OK_SHIFT                      21
#define AFE_CR_DLY_OK_WIDTH                      1
#define AFE_CR_DLY_OK(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_CR_DLY_OK_SHIFT))&AFE_CR_DLY_OK_MASK)
#define AFE_CR_RST_B_MASK                        0x400000u
#define AFE_CR_RST_B_SHIFT                       22
#define AFE_CR_RST_B_WIDTH                       1
#define AFE_CR_RST_B(x)                          (((uint32_t)(((uint32_t)(x))<<AFE_CR_RST_B_SHIFT))&AFE_CR_RST_B_MASK)
#define AFE_CR_LPM_EN_MASK                       0x2000000u
#define AFE_CR_LPM_EN_SHIFT                      25
#define AFE_CR_LPM_EN_WIDTH                      1
#define AFE_CR_LPM_EN(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_CR_LPM_EN_SHIFT))&AFE_CR_LPM_EN_MASK)
#define AFE_CR_SOFT_TRG3_MASK                    0x8000000u
#define AFE_CR_SOFT_TRG3_SHIFT                   27
#define AFE_CR_SOFT_TRG3_WIDTH                   1
#define AFE_CR_SOFT_TRG3(x)                      (((uint32_t)(((uint32_t)(x))<<AFE_CR_SOFT_TRG3_SHIFT))&AFE_CR_SOFT_TRG3_MASK)
#define AFE_CR_SOFT_TRG2_MASK                    0x10000000u
#define AFE_CR_SOFT_TRG2_SHIFT                   28
#define AFE_CR_SOFT_TRG2_WIDTH                   1
#define AFE_CR_SOFT_TRG2(x)                      (((uint32_t)(((uint32_t)(x))<<AFE_CR_SOFT_TRG2_SHIFT))&AFE_CR_SOFT_TRG2_MASK)
#define AFE_CR_SOFT_TRG1_MASK                    0x20000000u
#define AFE_CR_SOFT_TRG1_SHIFT                   29
#define AFE_CR_SOFT_TRG1_WIDTH                   1
#define AFE_CR_SOFT_TRG1(x)                      (((uint32_t)(((uint32_t)(x))<<AFE_CR_SOFT_TRG1_SHIFT))&AFE_CR_SOFT_TRG1_MASK)
#define AFE_CR_SOFT_TRG0_MASK                    0x40000000u
#define AFE_CR_SOFT_TRG0_SHIFT                   30
#define AFE_CR_SOFT_TRG0_WIDTH                   1
#define AFE_CR_SOFT_TRG0(x)                      (((uint32_t)(((uint32_t)(x))<<AFE_CR_SOFT_TRG0_SHIFT))&AFE_CR_SOFT_TRG0_MASK)
#define AFE_CR_MSTR_EN_MASK                      0x80000000u
#define AFE_CR_MSTR_EN_SHIFT                     31
#define AFE_CR_MSTR_EN_WIDTH                     1
#define AFE_CR_MSTR_EN(x)                        (((uint32_t)(((uint32_t)(x))<<AFE_CR_MSTR_EN_SHIFT))&AFE_CR_MSTR_EN_MASK)
/* CKR Bit Fields */
#define AFE_CKR_CLS_MASK                         0x600000u
#define AFE_CKR_CLS_SHIFT                        21
#define AFE_CKR_CLS_WIDTH                        2
#define AFE_CKR_CLS(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_CKR_CLS_SHIFT))&AFE_CKR_CLS_MASK)
#define AFE_CKR_DIV_MASK                         0xF0000000u
#define AFE_CKR_DIV_SHIFT                        28
#define AFE_CKR_DIV_WIDTH                        4
#define AFE_CKR_DIV(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_CKR_DIV_SHIFT))&AFE_CKR_DIV_MASK)
/* DI Bit Fields */
#define AFE_DI_INTEN3_MASK                       0x800000u
#define AFE_DI_INTEN3_SHIFT                      23
#define AFE_DI_INTEN3_WIDTH                      1
#define AFE_DI_INTEN3(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_DI_INTEN3_SHIFT))&AFE_DI_INTEN3_MASK)
#define AFE_DI_INTEN2_MASK                       0x1000000u
#define AFE_DI_INTEN2_SHIFT                      24
#define AFE_DI_INTEN2_WIDTH                      1
#define AFE_DI_INTEN2(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_DI_INTEN2_SHIFT))&AFE_DI_INTEN2_MASK)
#define AFE_DI_INTEN1_MASK                       0x2000000u
#define AFE_DI_INTEN1_SHIFT                      25
#define AFE_DI_INTEN1_WIDTH                      1
#define AFE_DI_INTEN1(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_DI_INTEN1_SHIFT))&AFE_DI_INTEN1_MASK)
#define AFE_DI_INTEN0_MASK                       0x4000000u
#define AFE_DI_INTEN0_SHIFT                      26
#define AFE_DI_INTEN0_WIDTH                      1
#define AFE_DI_INTEN0(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_DI_INTEN0_SHIFT))&AFE_DI_INTEN0_MASK)
#define AFE_DI_DMAEN3_MASK                       0x10000000u
#define AFE_DI_DMAEN3_SHIFT                      28
#define AFE_DI_DMAEN3_WIDTH                      1
#define AFE_DI_DMAEN3(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_DI_DMAEN3_SHIFT))&AFE_DI_DMAEN3_MASK)
#define AFE_DI_DMAEN2_MASK                       0x20000000u
#define AFE_DI_DMAEN2_SHIFT                      29
#define AFE_DI_DMAEN2_WIDTH                      1
#define AFE_DI_DMAEN2(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_DI_DMAEN2_SHIFT))&AFE_DI_DMAEN2_MASK)
#define AFE_DI_DMAEN1_MASK                       0x40000000u
#define AFE_DI_DMAEN1_SHIFT                      30
#define AFE_DI_DMAEN1_WIDTH                      1
#define AFE_DI_DMAEN1(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_DI_DMAEN1_SHIFT))&AFE_DI_DMAEN1_MASK)
#define AFE_DI_DMAEN0_MASK                       0x80000000u
#define AFE_DI_DMAEN0_SHIFT                      31
#define AFE_DI_DMAEN0_WIDTH                      1
#define AFE_DI_DMAEN0(x)                         (((uint32_t)(((uint32_t)(x))<<AFE_DI_DMAEN0_SHIFT))&AFE_DI_DMAEN0_MASK)
/* DR Bit Fields */
#define AFE_DR_DLY_MASK                          0x7FFu
#define AFE_DR_DLY_SHIFT                         0
#define AFE_DR_DLY_WIDTH                         11
#define AFE_DR_DLY(x)                            (((uint32_t)(((uint32_t)(x))<<AFE_DR_DLY_SHIFT))&AFE_DR_DLY_MASK)
/* RR Bit Fields */
#define AFE_RR_SDR_MASK                          0x7FFFFFu
#define AFE_RR_SDR_SHIFT                         0
#define AFE_RR_SDR_WIDTH                         23
#define AFE_RR_SDR(x)                            (((uint32_t)(((uint32_t)(x))<<AFE_RR_SDR_SHIFT))&AFE_RR_SDR_MASK)
#define AFE_RR_SIGN_BITS_MASK                    0xFF800000u
#define AFE_RR_SIGN_BITS_SHIFT                   23
#define AFE_RR_SIGN_BITS_WIDTH                   9
#define AFE_RR_SIGN_BITS(x)                      (((uint32_t)(((uint32_t)(x))<<AFE_RR_SIGN_BITS_SHIFT))&AFE_RR_SIGN_BITS_MASK)
/* SR Bit Fields */
#define AFE_SR_RDY3_MASK                         0x10000u
#define AFE_SR_RDY3_SHIFT                        16
#define AFE_SR_RDY3_WIDTH                        1
#define AFE_SR_RDY3(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_RDY3_SHIFT))&AFE_SR_RDY3_MASK)
#define AFE_SR_RDY2_MASK                         0x20000u
#define AFE_SR_RDY2_SHIFT                        17
#define AFE_SR_RDY2_WIDTH                        1
#define AFE_SR_RDY2(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_RDY2_SHIFT))&AFE_SR_RDY2_MASK)
#define AFE_SR_RDY1_MASK                         0x40000u
#define AFE_SR_RDY1_SHIFT                        18
#define AFE_SR_RDY1_WIDTH                        1
#define AFE_SR_RDY1(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_RDY1_SHIFT))&AFE_SR_RDY1_MASK)
#define AFE_SR_RDY0_MASK                         0x80000u
#define AFE_SR_RDY0_SHIFT                        19
#define AFE_SR_RDY0_WIDTH                        1
#define AFE_SR_RDY0(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_RDY0_SHIFT))&AFE_SR_RDY0_MASK)
#define AFE_SR_OVR3_MASK                         0x200000u
#define AFE_SR_OVR3_SHIFT                        21
#define AFE_SR_OVR3_WIDTH                        1
#define AFE_SR_OVR3(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_OVR3_SHIFT))&AFE_SR_OVR3_MASK)
#define AFE_SR_OVR2_MASK                         0x400000u
#define AFE_SR_OVR2_SHIFT                        22
#define AFE_SR_OVR2_WIDTH                        1
#define AFE_SR_OVR2(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_OVR2_SHIFT))&AFE_SR_OVR2_MASK)
#define AFE_SR_OVR1_MASK                         0x800000u
#define AFE_SR_OVR1_SHIFT                        23
#define AFE_SR_OVR1_WIDTH                        1
#define AFE_SR_OVR1(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_OVR1_SHIFT))&AFE_SR_OVR1_MASK)
#define AFE_SR_OVR0_MASK                         0x1000000u
#define AFE_SR_OVR0_SHIFT                        24
#define AFE_SR_OVR0_WIDTH                        1
#define AFE_SR_OVR0(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_OVR0_SHIFT))&AFE_SR_OVR0_MASK)
#define AFE_SR_COC3_MASK                         0x10000000u
#define AFE_SR_COC3_SHIFT                        28
#define AFE_SR_COC3_WIDTH                        1
#define AFE_SR_COC3(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_COC3_SHIFT))&AFE_SR_COC3_MASK)
#define AFE_SR_COC2_MASK                         0x20000000u
#define AFE_SR_COC2_SHIFT                        29
#define AFE_SR_COC2_WIDTH                        1
#define AFE_SR_COC2(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_COC2_SHIFT))&AFE_SR_COC2_MASK)
#define AFE_SR_COC1_MASK                         0x40000000u
#define AFE_SR_COC1_SHIFT                        30
#define AFE_SR_COC1_WIDTH                        1
#define AFE_SR_COC1(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_COC1_SHIFT))&AFE_SR_COC1_MASK)
#define AFE_SR_COC0_MASK                         0x80000000u
#define AFE_SR_COC0_SHIFT                        31
#define AFE_SR_COC0_WIDTH                        1
#define AFE_SR_COC0(x)                           (((uint32_t)(((uint32_t)(x))<<AFE_SR_COC0_SHIFT))&AFE_SR_COC0_MASK)

/*!
 * @}
 */ /* end of group AFE_Register_Masks */


/* AFE - Peripheral instance base addresses */
/** Peripheral AFE base address */
#define AFE_BASE                                 (0x40030000u)
/** Peripheral AFE base pointer */
#define AFE                                      ((AFE_Type *)AFE_BASE)
#define AFE_BASE_PTR                             (AFE)
/** Array initializer of AFE peripheral base addresses */
#define AFE_BASE_ADDRS                           { AFE_BASE }
/** Array initializer of AFE peripheral base pointers */
#define AFE_BASE_PTRS                            { AFE }
/** Interrupt vectors for the AFE peripheral type */
#define AFE_IRQS                                 { AFE_CH0_IRQn, AFE_CH1_IRQn, AFE_CH2_IRQn, AFE_CH3_IRQn }

/* ----------------------------------------------------------------------------
   -- AFE - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AFE_Register_Accessor_Macros AFE - Register accessor macros
 * @{
 */


