RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
/* AFE - Register instance definitions */
/* AFE */
#define AFE_CH0_CFR                              AFE_CFR_REG(AFE,0)
#define AFE_CH1_CFR                              AFE_CFR_REG(AFE,1)
#define AFE_CH2_CFR                              AFE_CFR_REG(AFE,2)
#define AFE_CH3_CFR                              AFE_CFR_REG(AFE,3)
#define AFE_CR                                   AFE_CR_REG(AFE)
#define AFE_CKR                                  AFE_CKR_REG(AFE)
#define AFE_DI                                   AFE_DI_REG(AFE)
#define AFE_CH0_DR                               AFE_DR_REG(AFE,0)
#define AFE_CH1_DR                               AFE_DR_REG(AFE,1)
#define AFE_CH2_DR                               AFE_DR_REG(AFE,2)
#define AFE_CH3_DR                               AFE_DR_REG(AFE,3)
#define AFE_CH0_RR                               AFE_RR_REG(AFE,0)
#define AFE_CH1_RR                               AFE_RR_REG(AFE,1)
#define AFE_CH2_RR                               AFE_RR_REG(AFE,2)
#define AFE_CH3_RR                               AFE_RR_REG(AFE,3)
#define AFE_SR                                   AFE_SR_REG(AFE)

/* AFE - Register array accessors */
#define AFE_CFR(index)                           AFE_CFR_REG(AFE,index)
#define AFE_DR(index)                            AFE_DR_REG(AFE,index)
#define AFE_RR(index)                            AFE_RR_REG(AFE,index)

/*!
 * @}
 */ /* end of group AFE_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group AFE_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- AIPS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPS_Peripheral_Access_Layer AIPS Peripheral Access Layer
 * @{
 */

/** AIPS - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[32];
  __IO uint32_t PACRA;                             /**< Peripheral Access Control Register, offset: 0x20 */
  __IO uint32_t PACRB;                             /**< Peripheral Access Control Register, offset: 0x24 */
       uint8_t RESERVED_1[24];
  __IO uint32_t PACRE;                             /**< Peripheral Access Control Register, offset: 0x40 */
  __IO uint32_t PACRF;                             /**< Peripheral Access Control Register, offset: 0x44 */
  __IO uint32_t PACRG;                             /**< Peripheral Access Control Register, offset: 0x48 */
  __IO uint32_t PACRH;                             /**< Peripheral Access Control Register, offset: 0x4C */
  __IO uint32_t PACRI;                             /**< Peripheral Access Control Register, offset: 0x50 */
  __IO uint32_t PACRJ;                             /**< Peripheral Access Control Register, offset: 0x54 */
  __IO uint32_t PACRK;                             /**< Peripheral Access Control Register, offset: 0x58 */
  __IO uint32_t PACRL;                             /**< Peripheral Access Control Register, offset: 0x5C */
  __IO uint32_t PACRM;                             /**< Peripheral Access Control Register, offset: 0x60 */
  __IO uint32_t PACRN;                             /**< Peripheral Access Control Register, offset: 0x64 */
  __IO uint32_t PACRO;                             /**< Peripheral Access Control Register, offset: 0x68 */
  __IO uint32_t PACRP;                             /**< Peripheral Access Control Register, offset: 0x6C */
} AIPS_Type, *AIPS_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- AIPS - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPS_Register_Accessor_Macros AIPS - Register accessor macros
 * @{
 */


/* AIPS - Register accessors */
#define AIPS_PACRA_REG(base)                     ((base)->PACRA)
#define AIPS_PACRB_REG(base)                     ((base)->PACRB)
#define AIPS_PACRE_REG(base)                     ((base)->PACRE)
#define AIPS_PACRF_REG(base)                     ((base)->PACRF)
#define AIPS_PACRG_REG(base)                     ((base)->PACRG)
#define AIPS_PACRH_REG(base)                     ((base)->PACRH)
#define AIPS_PACRI_REG(base)                     ((base)->PACRI)
#define AIPS_PACRJ_REG(base)                     ((base)->PACRJ)
#define AIPS_PACRK_REG(base)                     ((base)->PACRK)
#define AIPS_PACRL_REG(base)                     ((base)->PACRL)
#define AIPS_PACRM_REG(base)                     ((base)->PACRM)
#define AIPS_PACRN_REG(base)                     ((base)->PACRN)
#define AIPS_PACRO_REG(base)                     ((base)->PACRO)
#define AIPS_PACRP_REG(base)                     ((base)->PACRP)

/*!
 * @}
 */ /* end of group AIPS_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- AIPS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPS_Register_Masks AIPS Register Masks
 * @{
 */

/* PACRA Bit Fields */
#define AIPS_PACRA_AC7_MASK                      0x7u
#define AIPS_PACRA_AC7_SHIFT                     0
#define AIPS_PACRA_AC7_WIDTH                     3
#define AIPS_PACRA_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC7_SHIFT))&AIPS_PACRA_AC7_MASK)
#define AIPS_PACRA_RO7_MASK                      0x8u
#define AIPS_PACRA_RO7_SHIFT                     3
#define AIPS_PACRA_RO7_WIDTH                     1
#define AIPS_PACRA_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_RO7_SHIFT))&AIPS_PACRA_RO7_MASK)
#define AIPS_PACRA_AC6_MASK                      0x70u
#define AIPS_PACRA_AC6_SHIFT                     4
#define AIPS_PACRA_AC6_WIDTH                     3
#define AIPS_PACRA_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC6_SHIFT))&AIPS_PACRA_AC6_MASK)
#define AIPS_PACRA_RO6_MASK                      0x80u
#define AIPS_PACRA_RO6_SHIFT                     7
#define AIPS_PACRA_RO6_WIDTH                     1
#define AIPS_PACRA_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_RO6_SHIFT))&AIPS_PACRA_RO6_MASK)
#define AIPS_PACRA_AC5_MASK                      0x700u
#define AIPS_PACRA_AC5_SHIFT                     8
#define AIPS_PACRA_AC5_WIDTH                     3
#define AIPS_PACRA_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC5_SHIFT))&AIPS_PACRA_AC5_MASK)
#define AIPS_PACRA_RO5_MASK                      0x800u
#define AIPS_PACRA_RO5_SHIFT                     11
#define AIPS_PACRA_RO5_WIDTH                     1
#define AIPS_PACRA_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_RO5_SHIFT))&AIPS_PACRA_RO5_MASK)
#define AIPS_PACRA_AC4_MASK                      0x7000u
#define AIPS_PACRA_AC4_SHIFT                     12
#define AIPS_PACRA_AC4_WIDTH                     3
#define AIPS_PACRA_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC4_SHIFT))&AIPS_PACRA_AC4_MASK)
#define AIPS_PACRA_RO4_MASK                      0x8000u
#define AIPS_PACRA_RO4_SHIFT                     15
#define AIPS_PACRA_RO4_WIDTH                     1
#define AIPS_PACRA_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_RO4_SHIFT))&AIPS_PACRA_RO4_MASK)
#define AIPS_PACRA_AC3_MASK                      0x70000u
#define AIPS_PACRA_AC3_SHIFT                     16
#define AIPS_PACRA_AC3_WIDTH                     3
#define AIPS_PACRA_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC3_SHIFT))&AIPS_PACRA_AC3_MASK)
#define AIPS_PACRA_RO3_MASK                      0x80000u
#define AIPS_PACRA_RO3_SHIFT                     19
#define AIPS_PACRA_RO3_WIDTH                     1
#define AIPS_PACRA_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_RO3_SHIFT))&AIPS_PACRA_RO3_MASK)
#define AIPS_PACRA_AC2_MASK                      0x700000u
#define AIPS_PACRA_AC2_SHIFT                     20
#define AIPS_PACRA_AC2_WIDTH                     3
#define AIPS_PACRA_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC2_SHIFT))&AIPS_PACRA_AC2_MASK)
#define AIPS_PACRA_RO2_MASK                      0x800000u
#define AIPS_PACRA_RO2_SHIFT                     23
#define AIPS_PACRA_RO2_WIDTH                     1
#define AIPS_PACRA_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_RO2_SHIFT))&AIPS_PACRA_RO2_MASK)
#define AIPS_PACRA_AC1_MASK                      0x7000000u
#define AIPS_PACRA_AC1_SHIFT                     24
#define AIPS_PACRA_AC1_WIDTH                     3
#define AIPS_PACRA_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC1_SHIFT))&AIPS_PACRA_AC1_MASK)
#define AIPS_PACRA_RO1_MASK                      0x8000000u
#define AIPS_PACRA_RO1_SHIFT                     27
#define AIPS_PACRA_RO1_WIDTH                     1
#define AIPS_PACRA_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_RO1_SHIFT))&AIPS_PACRA_RO1_MASK)
#define AIPS_PACRA_AC0_MASK                      0x70000000u
#define AIPS_PACRA_AC0_SHIFT                     28
#define AIPS_PACRA_AC0_WIDTH                     3
#define AIPS_PACRA_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_AC0_SHIFT))&AIPS_PACRA_AC0_MASK)
#define AIPS_PACRA_RO0_MASK                      0x80000000u
#define AIPS_PACRA_RO0_SHIFT                     31
#define AIPS_PACRA_RO0_WIDTH                     1
#define AIPS_PACRA_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRA_RO0_SHIFT))&AIPS_PACRA_RO0_MASK)
/* PACRB Bit Fields */
#define AIPS_PACRB_AC7_MASK                      0x7u
#define AIPS_PACRB_AC7_SHIFT                     0
#define AIPS_PACRB_AC7_WIDTH                     3
#define AIPS_PACRB_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC7_SHIFT))&AIPS_PACRB_AC7_MASK)
#define AIPS_PACRB_RO7_MASK                      0x8u
#define AIPS_PACRB_RO7_SHIFT                     3
#define AIPS_PACRB_RO7_WIDTH                     1
#define AIPS_PACRB_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_RO7_SHIFT))&AIPS_PACRB_RO7_MASK)
#define AIPS_PACRB_AC6_MASK                      0x70u
#define AIPS_PACRB_AC6_SHIFT                     4
#define AIPS_PACRB_AC6_WIDTH                     3
#define AIPS_PACRB_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC6_SHIFT))&AIPS_PACRB_AC6_MASK)
#define AIPS_PACRB_RO6_MASK                      0x80u
#define AIPS_PACRB_RO6_SHIFT                     7
#define AIPS_PACRB_RO6_WIDTH                     1
#define AIPS_PACRB_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_RO6_SHIFT))&AIPS_PACRB_RO6_MASK)
#define AIPS_PACRB_AC5_MASK                      0x700u
#define AIPS_PACRB_AC5_SHIFT                     8
#define AIPS_PACRB_AC5_WIDTH                     3
#define AIPS_PACRB_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC5_SHIFT))&AIPS_PACRB_AC5_MASK)
#define AIPS_PACRB_RO5_MASK                      0x800u
#define AIPS_PACRB_RO5_SHIFT                     11
#define AIPS_PACRB_RO5_WIDTH                     1
#define AIPS_PACRB_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_RO5_SHIFT))&AIPS_PACRB_RO5_MASK)
#define AIPS_PACRB_AC4_MASK                      0x7000u
#define AIPS_PACRB_AC4_SHIFT                     12
#define AIPS_PACRB_AC4_WIDTH                     3
#define AIPS_PACRB_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC4_SHIFT))&AIPS_PACRB_AC4_MASK)
#define AIPS_PACRB_RO4_MASK                      0x8000u
#define AIPS_PACRB_RO4_SHIFT                     15
#define AIPS_PACRB_RO4_WIDTH                     1
#define AIPS_PACRB_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_RO4_SHIFT))&AIPS_PACRB_RO4_MASK)
#define AIPS_PACRB_AC3_MASK                      0x70000u
#define AIPS_PACRB_AC3_SHIFT                     16
#define AIPS_PACRB_AC3_WIDTH                     3
#define AIPS_PACRB_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC3_SHIFT))&AIPS_PACRB_AC3_MASK)
#define AIPS_PACRB_RO3_MASK                      0x80000u
#define AIPS_PACRB_RO3_SHIFT                     19
#define AIPS_PACRB_RO3_WIDTH                     1
#define AIPS_PACRB_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_RO3_SHIFT))&AIPS_PACRB_RO3_MASK)
#define AIPS_PACRB_AC2_MASK                      0x700000u
#define AIPS_PACRB_AC2_SHIFT                     20
#define AIPS_PACRB_AC2_WIDTH                     3
#define AIPS_PACRB_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC2_SHIFT))&AIPS_PACRB_AC2_MASK)
#define AIPS_PACRB_RO2_MASK                      0x800000u
#define AIPS_PACRB_RO2_SHIFT                     23
#define AIPS_PACRB_RO2_WIDTH                     1
#define AIPS_PACRB_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_RO2_SHIFT))&AIPS_PACRB_RO2_MASK)
#define AIPS_PACRB_AC1_MASK                      0x7000000u
#define AIPS_PACRB_AC1_SHIFT                     24
#define AIPS_PACRB_AC1_WIDTH                     3
#define AIPS_PACRB_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC1_SHIFT))&AIPS_PACRB_AC1_MASK)
#define AIPS_PACRB_RO1_MASK                      0x8000000u
#define AIPS_PACRB_RO1_SHIFT                     27
#define AIPS_PACRB_RO1_WIDTH                     1
#define AIPS_PACRB_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_RO1_SHIFT))&AIPS_PACRB_RO1_MASK)
#define AIPS_PACRB_AC0_MASK                      0x70000000u
#define AIPS_PACRB_AC0_SHIFT                     28
#define AIPS_PACRB_AC0_WIDTH                     3
#define AIPS_PACRB_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_AC0_SHIFT))&AIPS_PACRB_AC0_MASK)
#define AIPS_PACRB_RO0_MASK                      0x80000000u
#define AIPS_PACRB_RO0_SHIFT                     31
#define AIPS_PACRB_RO0_WIDTH                     1
#define AIPS_PACRB_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRB_RO0_SHIFT))&AIPS_PACRB_RO0_MASK)
/* PACRE Bit Fields */
#define AIPS_PACRE_AC7_MASK                      0x7u
#define AIPS_PACRE_AC7_SHIFT                     0
#define AIPS_PACRE_AC7_WIDTH                     3
#define AIPS_PACRE_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC7_SHIFT))&AIPS_PACRE_AC7_MASK)
#define AIPS_PACRE_RO7_MASK                      0x8u
#define AIPS_PACRE_RO7_SHIFT                     3
#define AIPS_PACRE_RO7_WIDTH                     1
#define AIPS_PACRE_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_RO7_SHIFT))&AIPS_PACRE_RO7_MASK)
#define AIPS_PACRE_AC6_MASK                      0x70u
#define AIPS_PACRE_AC6_SHIFT                     4
#define AIPS_PACRE_AC6_WIDTH                     3
#define AIPS_PACRE_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC6_SHIFT))&AIPS_PACRE_AC6_MASK)
#define AIPS_PACRE_RO6_MASK                      0x80u
#define AIPS_PACRE_RO6_SHIFT                     7
#define AIPS_PACRE_RO6_WIDTH                     1
#define AIPS_PACRE_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_RO6_SHIFT))&AIPS_PACRE_RO6_MASK)
#define AIPS_PACRE_AC5_MASK                      0x700u
#define AIPS_PACRE_AC5_SHIFT                     8
#define AIPS_PACRE_AC5_WIDTH                     3
#define AIPS_PACRE_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC5_SHIFT))&AIPS_PACRE_AC5_MASK)
#define AIPS_PACRE_RO5_MASK                      0x800u
#define AIPS_PACRE_RO5_SHIFT                     11
#define AIPS_PACRE_RO5_WIDTH                     1
#define AIPS_PACRE_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_RO5_SHIFT))&AIPS_PACRE_RO5_MASK)
#define AIPS_PACRE_AC4_MASK                      0x7000u
#define AIPS_PACRE_AC4_SHIFT                     12
#define AIPS_PACRE_AC4_WIDTH                     3
#define AIPS_PACRE_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC4_SHIFT))&AIPS_PACRE_AC4_MASK)
#define AIPS_PACRE_RO4_MASK                      0x8000u
#define AIPS_PACRE_RO4_SHIFT                     15
#define AIPS_PACRE_RO4_WIDTH                     1
#define AIPS_PACRE_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_RO4_SHIFT))&AIPS_PACRE_RO4_MASK)
#define AIPS_PACRE_AC3_MASK                      0x70000u
#define AIPS_PACRE_AC3_SHIFT                     16
#define AIPS_PACRE_AC3_WIDTH                     3
#define AIPS_PACRE_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC3_SHIFT))&AIPS_PACRE_AC3_MASK)
#define AIPS_PACRE_RO3_MASK                      0x80000u
#define AIPS_PACRE_RO3_SHIFT                     19
#define AIPS_PACRE_RO3_WIDTH                     1
#define AIPS_PACRE_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_RO3_SHIFT))&AIPS_PACRE_RO3_MASK)
#define AIPS_PACRE_AC2_MASK                      0x700000u
#define AIPS_PACRE_AC2_SHIFT                     20
#define AIPS_PACRE_AC2_WIDTH                     3
#define AIPS_PACRE_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC2_SHIFT))&AIPS_PACRE_AC2_MASK)
#define AIPS_PACRE_RO2_MASK                      0x800000u
#define AIPS_PACRE_RO2_SHIFT                     23
#define AIPS_PACRE_RO2_WIDTH                     1
#define AIPS_PACRE_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_RO2_SHIFT))&AIPS_PACRE_RO2_MASK)
#define AIPS_PACRE_AC1_MASK                      0x7000000u
#define AIPS_PACRE_AC1_SHIFT                     24
#define AIPS_PACRE_AC1_WIDTH                     3
#define AIPS_PACRE_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC1_SHIFT))&AIPS_PACRE_AC1_MASK)
#define AIPS_PACRE_RO1_MASK                      0x8000000u
#define AIPS_PACRE_RO1_SHIFT                     27
#define AIPS_PACRE_RO1_WIDTH                     1
#define AIPS_PACRE_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_RO1_SHIFT))&AIPS_PACRE_RO1_MASK)
#define AIPS_PACRE_AC0_MASK                      0x70000000u
#define AIPS_PACRE_AC0_SHIFT                     28
#define AIPS_PACRE_AC0_WIDTH                     3
#define AIPS_PACRE_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_AC0_SHIFT))&AIPS_PACRE_AC0_MASK)
#define AIPS_PACRE_RO0_MASK                      0x80000000u
#define AIPS_PACRE_RO0_SHIFT                     31
#define AIPS_PACRE_RO0_WIDTH                     1
#define AIPS_PACRE_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRE_RO0_SHIFT))&AIPS_PACRE_RO0_MASK)
/* PACRF Bit Fields */
#define AIPS_PACRF_AC7_MASK                      0x7u
#define AIPS_PACRF_AC7_SHIFT                     0
#define AIPS_PACRF_AC7_WIDTH                     3
#define AIPS_PACRF_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC7_SHIFT))&AIPS_PACRF_AC7_MASK)
#define AIPS_PACRF_RO7_MASK                      0x8u
#define AIPS_PACRF_RO7_SHIFT                     3
#define AIPS_PACRF_RO7_WIDTH                     1
#define AIPS_PACRF_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_RO7_SHIFT))&AIPS_PACRF_RO7_MASK)
#define AIPS_PACRF_AC6_MASK                      0x70u
#define AIPS_PACRF_AC6_SHIFT                     4
#define AIPS_PACRF_AC6_WIDTH                     3
#define AIPS_PACRF_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC6_SHIFT))&AIPS_PACRF_AC6_MASK)
#define AIPS_PACRF_RO6_MASK                      0x80u
#define AIPS_PACRF_RO6_SHIFT                     7
#define AIPS_PACRF_RO6_WIDTH                     1
#define AIPS_PACRF_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_RO6_SHIFT))&AIPS_PACRF_RO6_MASK)
#define AIPS_PACRF_AC5_MASK                      0x700u
#define AIPS_PACRF_AC5_SHIFT                     8
#define AIPS_PACRF_AC5_WIDTH                     3
#define AIPS_PACRF_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC5_SHIFT))&AIPS_PACRF_AC5_MASK)
#define AIPS_PACRF_RO5_MASK                      0x800u
#define AIPS_PACRF_RO5_SHIFT                     11
#define AIPS_PACRF_RO5_WIDTH                     1
#define AIPS_PACRF_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_RO5_SHIFT))&AIPS_PACRF_RO5_MASK)
#define AIPS_PACRF_AC4_MASK                      0x7000u
#define AIPS_PACRF_AC4_SHIFT                     12
#define AIPS_PACRF_AC4_WIDTH                     3
#define AIPS_PACRF_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC4_SHIFT))&AIPS_PACRF_AC4_MASK)
#define AIPS_PACRF_RO4_MASK                      0x8000u
#define AIPS_PACRF_RO4_SHIFT                     15
#define AIPS_PACRF_RO4_WIDTH                     1
#define AIPS_PACRF_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_RO4_SHIFT))&AIPS_PACRF_RO4_MASK)
#define AIPS_PACRF_AC3_MASK                      0x70000u
#define AIPS_PACRF_AC3_SHIFT                     16
#define AIPS_PACRF_AC3_WIDTH                     3
#define AIPS_PACRF_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC3_SHIFT))&AIPS_PACRF_AC3_MASK)
#define AIPS_PACRF_RO3_MASK                      0x80000u
#define AIPS_PACRF_RO3_SHIFT                     19
#define AIPS_PACRF_RO3_WIDTH                     1
#define AIPS_PACRF_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_RO3_SHIFT))&AIPS_PACRF_RO3_MASK)
#define AIPS_PACRF_AC2_MASK                      0x700000u
#define AIPS_PACRF_AC2_SHIFT                     20
#define AIPS_PACRF_AC2_WIDTH                     3
#define AIPS_PACRF_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC2_SHIFT))&AIPS_PACRF_AC2_MASK)
#define AIPS_PACRF_RO2_MASK                      0x800000u
#define AIPS_PACRF_RO2_SHIFT                     23
#define AIPS_PACRF_RO2_WIDTH                     1
#define AIPS_PACRF_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_RO2_SHIFT))&AIPS_PACRF_RO2_MASK)
#define AIPS_PACRF_AC1_MASK                      0x7000000u
#define AIPS_PACRF_AC1_SHIFT                     24
#define AIPS_PACRF_AC1_WIDTH                     3
#define AIPS_PACRF_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC1_SHIFT))&AIPS_PACRF_AC1_MASK)
#define AIPS_PACRF_RO1_MASK                      0x8000000u
#define AIPS_PACRF_RO1_SHIFT                     27
#define AIPS_PACRF_RO1_WIDTH                     1
#define AIPS_PACRF_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_RO1_SHIFT))&AIPS_PACRF_RO1_MASK)
#define AIPS_PACRF_AC0_MASK                      0x70000000u
#define AIPS_PACRF_AC0_SHIFT                     28
#define AIPS_PACRF_AC0_WIDTH                     3
#define AIPS_PACRF_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_AC0_SHIFT))&AIPS_PACRF_AC0_MASK)
#define AIPS_PACRF_RO0_MASK                      0x80000000u
#define AIPS_PACRF_RO0_SHIFT                     31
#define AIPS_PACRF_RO0_WIDTH                     1
#define AIPS_PACRF_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRF_RO0_SHIFT))&AIPS_PACRF_RO0_MASK)
/* PACRG Bit Fields */
#define AIPS_PACRG_AC7_MASK                      0x7u
#define AIPS_PACRG_AC7_SHIFT                     0
#define AIPS_PACRG_AC7_WIDTH                     3
#define AIPS_PACRG_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC7_SHIFT))&AIPS_PACRG_AC7_MASK)
#define AIPS_PACRG_RO7_MASK                      0x8u
#define AIPS_PACRG_RO7_SHIFT                     3
#define AIPS_PACRG_RO7_WIDTH                     1
#define AIPS_PACRG_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_RO7_SHIFT))&AIPS_PACRG_RO7_MASK)
#define AIPS_PACRG_AC6_MASK                      0x70u
#define AIPS_PACRG_AC6_SHIFT                     4
#define AIPS_PACRG_AC6_WIDTH                     3
