RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
#define AIPS_PACRG_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC6_SHIFT))&AIPS_PACRG_AC6_MASK)
#define AIPS_PACRG_RO6_MASK                      0x80u
#define AIPS_PACRG_RO6_SHIFT                     7
#define AIPS_PACRG_RO6_WIDTH                     1
#define AIPS_PACRG_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_RO6_SHIFT))&AIPS_PACRG_RO6_MASK)
#define AIPS_PACRG_AC5_MASK                      0x700u
#define AIPS_PACRG_AC5_SHIFT                     8
#define AIPS_PACRG_AC5_WIDTH                     3
#define AIPS_PACRG_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC5_SHIFT))&AIPS_PACRG_AC5_MASK)
#define AIPS_PACRG_RO5_MASK                      0x800u
#define AIPS_PACRG_RO5_SHIFT                     11
#define AIPS_PACRG_RO5_WIDTH                     1
#define AIPS_PACRG_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_RO5_SHIFT))&AIPS_PACRG_RO5_MASK)
#define AIPS_PACRG_AC4_MASK                      0x7000u
#define AIPS_PACRG_AC4_SHIFT                     12
#define AIPS_PACRG_AC4_WIDTH                     3
#define AIPS_PACRG_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC4_SHIFT))&AIPS_PACRG_AC4_MASK)
#define AIPS_PACRG_RO4_MASK                      0x8000u
#define AIPS_PACRG_RO4_SHIFT                     15
#define AIPS_PACRG_RO4_WIDTH                     1
#define AIPS_PACRG_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_RO4_SHIFT))&AIPS_PACRG_RO4_MASK)
#define AIPS_PACRG_AC3_MASK                      0x70000u
#define AIPS_PACRG_AC3_SHIFT                     16
#define AIPS_PACRG_AC3_WIDTH                     3
#define AIPS_PACRG_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC3_SHIFT))&AIPS_PACRG_AC3_MASK)
#define AIPS_PACRG_RO3_MASK                      0x80000u
#define AIPS_PACRG_RO3_SHIFT                     19
#define AIPS_PACRG_RO3_WIDTH                     1
#define AIPS_PACRG_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_RO3_SHIFT))&AIPS_PACRG_RO3_MASK)
#define AIPS_PACRG_AC2_MASK                      0x700000u
#define AIPS_PACRG_AC2_SHIFT                     20
#define AIPS_PACRG_AC2_WIDTH                     3
#define AIPS_PACRG_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC2_SHIFT))&AIPS_PACRG_AC2_MASK)
#define AIPS_PACRG_RO2_MASK                      0x800000u
#define AIPS_PACRG_RO2_SHIFT                     23
#define AIPS_PACRG_RO2_WIDTH                     1
#define AIPS_PACRG_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_RO2_SHIFT))&AIPS_PACRG_RO2_MASK)
#define AIPS_PACRG_AC1_MASK                      0x7000000u
#define AIPS_PACRG_AC1_SHIFT                     24
#define AIPS_PACRG_AC1_WIDTH                     3
#define AIPS_PACRG_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC1_SHIFT))&AIPS_PACRG_AC1_MASK)
#define AIPS_PACRG_RO1_MASK                      0x8000000u
#define AIPS_PACRG_RO1_SHIFT                     27
#define AIPS_PACRG_RO1_WIDTH                     1
#define AIPS_PACRG_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_RO1_SHIFT))&AIPS_PACRG_RO1_MASK)
#define AIPS_PACRG_AC0_MASK                      0x70000000u
#define AIPS_PACRG_AC0_SHIFT                     28
#define AIPS_PACRG_AC0_WIDTH                     3
#define AIPS_PACRG_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_AC0_SHIFT))&AIPS_PACRG_AC0_MASK)
#define AIPS_PACRG_RO0_MASK                      0x80000000u
#define AIPS_PACRG_RO0_SHIFT                     31
#define AIPS_PACRG_RO0_WIDTH                     1
#define AIPS_PACRG_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRG_RO0_SHIFT))&AIPS_PACRG_RO0_MASK)
/* PACRH Bit Fields */
#define AIPS_PACRH_AC7_MASK                      0x7u
#define AIPS_PACRH_AC7_SHIFT                     0
#define AIPS_PACRH_AC7_WIDTH                     3
#define AIPS_PACRH_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_AC7_SHIFT))&AIPS_PACRH_AC7_MASK)
#define AIPS_PACRH_RO7_MASK                      0x8u
#define AIPS_PACRH_RO7_SHIFT                     3
#define AIPS_PACRH_RO7_WIDTH                     1
#define AIPS_PACRH_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_RO7_SHIFT))&AIPS_PACRH_RO7_MASK)
#define AIPS_PACRH_AC6_MASK                      0x70u
#define AIPS_PACRH_AC6_SHIFT                     4
#define AIPS_PACRH_AC6_WIDTH                     3
#define AIPS_PACRH_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_AC6_SHIFT))&AIPS_PACRH_AC6_MASK)
#define AIPS_PACRH_RO6_MASK                      0x80u
#define AIPS_PACRH_RO6_SHIFT                     7
#define AIPS_PACRH_RO6_WIDTH                     1
#define AIPS_PACRH_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_RO6_SHIFT))&AIPS_PACRH_RO6_MASK)
#define AIPS_PACRH_AC5_MASK                      0x700u
#define AIPS_PACRH_AC5_SHIFT                     8
#define AIPS_PACRH_AC5_WIDTH                     3
#define AIPS_PACRH_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_AC5_SHIFT))&AIPS_PACRH_AC5_MASK)
#define AIPS_PACRH_RO5_MASK                      0x800u
#define AIPS_PACRH_RO5_SHIFT                     11
#define AIPS_PACRH_RO5_WIDTH                     1
#define AIPS_PACRH_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_RO5_SHIFT))&AIPS_PACRH_RO5_MASK)
#define AIPS_PACRH_AC4_MASK                      0x7000u
#define AIPS_PACRH_AC4_SHIFT                     12
#define AIPS_PACRH_AC4_WIDTH                     3
#define AIPS_PACRH_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_AC4_SHIFT))&AIPS_PACRH_AC4_MASK)
#define AIPS_PACRH_RO4_MASK                      0x8000u
#define AIPS_PACRH_RO4_SHIFT                     15
#define AIPS_PACRH_RO4_WIDTH                     1
#define AIPS_PACRH_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_RO4_SHIFT))&AIPS_PACRH_RO4_MASK)
#define AIPS_PACRH_AC3_MASK                      0x70000u
#define AIPS_PACRH_AC3_SHIFT                     16
#define AIPS_PACRH_AC3_WIDTH                     3
#define AIPS_PACRH_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_AC3_SHIFT))&AIPS_PACRH_AC3_MASK)
#define AIPS_PACRH_RO3_MASK                      0x80000u
#define AIPS_PACRH_RO3_SHIFT                     19
#define AIPS_PACRH_RO3_WIDTH                     1
#define AIPS_PACRH_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_RO3_SHIFT))&AIPS_PACRH_RO3_MASK)
#define AIPS_PACRH_AC2_MASK                      0x700000u
#define AIPS_PACRH_AC2_SHIFT                     20
#define AIPS_PACRH_AC2_WIDTH                     3
#define AIPS_PACRH_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_AC2_SHIFT))&AIPS_PACRH_AC2_MASK)
#define AIPS_PACRH_RO2_MASK                      0x800000u
#define AIPS_PACRH_RO2_SHIFT                     23
#define AIPS_PACRH_RO2_WIDTH                     1
#define AIPS_PACRH_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_RO2_SHIFT))&AIPS_PACRH_RO2_MASK)
#define AIPS_PACRH_AC1_MASK                      0x7000000u
#define AIPS_PACRH_AC1_SHIFT                     24
#define AIPS_PACRH_AC1_WIDTH                     3
#define AIPS_PACRH_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_AC1_SHIFT))&AIPS_PACRH_AC1_MASK)
#define AIPS_PACRH_RO1_MASK                      0x8000000u
#define AIPS_PACRH_RO1_SHIFT                     27
#define AIPS_PACRH_RO1_WIDTH                     1
#define AIPS_PACRH_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_RO1_SHIFT))&AIPS_PACRH_RO1_MASK)
#define AIPS_PACRH_AC0_MASK                      0x70000000u
#define AIPS_PACRH_AC0_SHIFT                     28
#define AIPS_PACRH_AC0_WIDTH                     3
#define AIPS_PACRH_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_AC0_SHIFT))&AIPS_PACRH_AC0_MASK)
#define AIPS_PACRH_RO0_MASK                      0x80000000u
#define AIPS_PACRH_RO0_SHIFT                     31
#define AIPS_PACRH_RO0_WIDTH                     1
#define AIPS_PACRH_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRH_RO0_SHIFT))&AIPS_PACRH_RO0_MASK)
/* PACRI Bit Fields */
#define AIPS_PACRI_AC7_MASK                      0x7u
#define AIPS_PACRI_AC7_SHIFT                     0
#define AIPS_PACRI_AC7_WIDTH                     3
#define AIPS_PACRI_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_AC7_SHIFT))&AIPS_PACRI_AC7_MASK)
#define AIPS_PACRI_RO7_MASK                      0x8u
#define AIPS_PACRI_RO7_SHIFT                     3
#define AIPS_PACRI_RO7_WIDTH                     1
#define AIPS_PACRI_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_RO7_SHIFT))&AIPS_PACRI_RO7_MASK)
#define AIPS_PACRI_AC6_MASK                      0x70u
#define AIPS_PACRI_AC6_SHIFT                     4
#define AIPS_PACRI_AC6_WIDTH                     3
#define AIPS_PACRI_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_AC6_SHIFT))&AIPS_PACRI_AC6_MASK)
#define AIPS_PACRI_RO6_MASK                      0x80u
#define AIPS_PACRI_RO6_SHIFT                     7
#define AIPS_PACRI_RO6_WIDTH                     1
#define AIPS_PACRI_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_RO6_SHIFT))&AIPS_PACRI_RO6_MASK)
#define AIPS_PACRI_AC5_MASK                      0x700u
#define AIPS_PACRI_AC5_SHIFT                     8
#define AIPS_PACRI_AC5_WIDTH                     3
#define AIPS_PACRI_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_AC5_SHIFT))&AIPS_PACRI_AC5_MASK)
#define AIPS_PACRI_RO5_MASK                      0x800u
#define AIPS_PACRI_RO5_SHIFT                     11
#define AIPS_PACRI_RO5_WIDTH                     1
#define AIPS_PACRI_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_RO5_SHIFT))&AIPS_PACRI_RO5_MASK)
#define AIPS_PACRI_AC4_MASK                      0x7000u
#define AIPS_PACRI_AC4_SHIFT                     12
#define AIPS_PACRI_AC4_WIDTH                     3
#define AIPS_PACRI_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_AC4_SHIFT))&AIPS_PACRI_AC4_MASK)
#define AIPS_PACRI_RO4_MASK                      0x8000u
#define AIPS_PACRI_RO4_SHIFT                     15
#define AIPS_PACRI_RO4_WIDTH                     1
#define AIPS_PACRI_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_RO4_SHIFT))&AIPS_PACRI_RO4_MASK)
#define AIPS_PACRI_AC3_MASK                      0x70000u
#define AIPS_PACRI_AC3_SHIFT                     16
#define AIPS_PACRI_AC3_WIDTH                     3
#define AIPS_PACRI_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_AC3_SHIFT))&AIPS_PACRI_AC3_MASK)
#define AIPS_PACRI_RO3_MASK                      0x80000u
#define AIPS_PACRI_RO3_SHIFT                     19
#define AIPS_PACRI_RO3_WIDTH                     1
#define AIPS_PACRI_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_RO3_SHIFT))&AIPS_PACRI_RO3_MASK)
#define AIPS_PACRI_AC2_MASK                      0x700000u
#define AIPS_PACRI_AC2_SHIFT                     20
#define AIPS_PACRI_AC2_WIDTH                     3
#define AIPS_PACRI_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_AC2_SHIFT))&AIPS_PACRI_AC2_MASK)
#define AIPS_PACRI_RO2_MASK                      0x800000u
#define AIPS_PACRI_RO2_SHIFT                     23
#define AIPS_PACRI_RO2_WIDTH                     1
#define AIPS_PACRI_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_RO2_SHIFT))&AIPS_PACRI_RO2_MASK)
#define AIPS_PACRI_AC1_MASK                      0x7000000u
#define AIPS_PACRI_AC1_SHIFT                     24
#define AIPS_PACRI_AC1_WIDTH                     3
#define AIPS_PACRI_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_AC1_SHIFT))&AIPS_PACRI_AC1_MASK)
#define AIPS_PACRI_RO1_MASK                      0x8000000u
#define AIPS_PACRI_RO1_SHIFT                     27
#define AIPS_PACRI_RO1_WIDTH                     1
#define AIPS_PACRI_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_RO1_SHIFT))&AIPS_PACRI_RO1_MASK)
#define AIPS_PACRI_AC0_MASK                      0x70000000u
#define AIPS_PACRI_AC0_SHIFT                     28
#define AIPS_PACRI_AC0_WIDTH                     3
#define AIPS_PACRI_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_AC0_SHIFT))&AIPS_PACRI_AC0_MASK)
#define AIPS_PACRI_RO0_MASK                      0x80000000u
#define AIPS_PACRI_RO0_SHIFT                     31
#define AIPS_PACRI_RO0_WIDTH                     1
#define AIPS_PACRI_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRI_RO0_SHIFT))&AIPS_PACRI_RO0_MASK)
/* PACRJ Bit Fields */
#define AIPS_PACRJ_AC7_MASK                      0x7u
#define AIPS_PACRJ_AC7_SHIFT                     0
#define AIPS_PACRJ_AC7_WIDTH                     3
#define AIPS_PACRJ_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_AC7_SHIFT))&AIPS_PACRJ_AC7_MASK)
#define AIPS_PACRJ_RO7_MASK                      0x8u
#define AIPS_PACRJ_RO7_SHIFT                     3
#define AIPS_PACRJ_RO7_WIDTH                     1
#define AIPS_PACRJ_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_RO7_SHIFT))&AIPS_PACRJ_RO7_MASK)
#define AIPS_PACRJ_AC6_MASK                      0x70u
#define AIPS_PACRJ_AC6_SHIFT                     4
#define AIPS_PACRJ_AC6_WIDTH                     3
#define AIPS_PACRJ_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_AC6_SHIFT))&AIPS_PACRJ_AC6_MASK)
#define AIPS_PACRJ_RO6_MASK                      0x80u
#define AIPS_PACRJ_RO6_SHIFT                     7
#define AIPS_PACRJ_RO6_WIDTH                     1
#define AIPS_PACRJ_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_RO6_SHIFT))&AIPS_PACRJ_RO6_MASK)
#define AIPS_PACRJ_AC5_MASK                      0x700u
#define AIPS_PACRJ_AC5_SHIFT                     8
#define AIPS_PACRJ_AC5_WIDTH                     3
#define AIPS_PACRJ_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_AC5_SHIFT))&AIPS_PACRJ_AC5_MASK)
#define AIPS_PACRJ_RO5_MASK                      0x800u
#define AIPS_PACRJ_RO5_SHIFT                     11
#define AIPS_PACRJ_RO5_WIDTH                     1
#define AIPS_PACRJ_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_RO5_SHIFT))&AIPS_PACRJ_RO5_MASK)
#define AIPS_PACRJ_AC4_MASK                      0x7000u
#define AIPS_PACRJ_AC4_SHIFT                     12
#define AIPS_PACRJ_AC4_WIDTH                     3
#define AIPS_PACRJ_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_AC4_SHIFT))&AIPS_PACRJ_AC4_MASK)
#define AIPS_PACRJ_RO4_MASK                      0x8000u
#define AIPS_PACRJ_RO4_SHIFT                     15
#define AIPS_PACRJ_RO4_WIDTH                     1
#define AIPS_PACRJ_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_RO4_SHIFT))&AIPS_PACRJ_RO4_MASK)
#define AIPS_PACRJ_AC3_MASK                      0x70000u
#define AIPS_PACRJ_AC3_SHIFT                     16
#define AIPS_PACRJ_AC3_WIDTH                     3
#define AIPS_PACRJ_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_AC3_SHIFT))&AIPS_PACRJ_AC3_MASK)
#define AIPS_PACRJ_RO3_MASK                      0x80000u
#define AIPS_PACRJ_RO3_SHIFT                     19
#define AIPS_PACRJ_RO3_WIDTH                     1
#define AIPS_PACRJ_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_RO3_SHIFT))&AIPS_PACRJ_RO3_MASK)
#define AIPS_PACRJ_AC2_MASK                      0x700000u
#define AIPS_PACRJ_AC2_SHIFT                     20
#define AIPS_PACRJ_AC2_WIDTH                     3
#define AIPS_PACRJ_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_AC2_SHIFT))&AIPS_PACRJ_AC2_MASK)
#define AIPS_PACRJ_RO2_MASK                      0x800000u
#define AIPS_PACRJ_RO2_SHIFT                     23
#define AIPS_PACRJ_RO2_WIDTH                     1
#define AIPS_PACRJ_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_RO2_SHIFT))&AIPS_PACRJ_RO2_MASK)
#define AIPS_PACRJ_AC1_MASK                      0x7000000u
#define AIPS_PACRJ_AC1_SHIFT                     24
#define AIPS_PACRJ_AC1_WIDTH                     3
#define AIPS_PACRJ_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_AC1_SHIFT))&AIPS_PACRJ_AC1_MASK)
#define AIPS_PACRJ_RO1_MASK                      0x8000000u
#define AIPS_PACRJ_RO1_SHIFT                     27
#define AIPS_PACRJ_RO1_WIDTH                     1
#define AIPS_PACRJ_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_RO1_SHIFT))&AIPS_PACRJ_RO1_MASK)
#define AIPS_PACRJ_AC0_MASK                      0x70000000u
#define AIPS_PACRJ_AC0_SHIFT                     28
#define AIPS_PACRJ_AC0_WIDTH                     3
#define AIPS_PACRJ_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_AC0_SHIFT))&AIPS_PACRJ_AC0_MASK)
#define AIPS_PACRJ_RO0_MASK                      0x80000000u
#define AIPS_PACRJ_RO0_SHIFT                     31
#define AIPS_PACRJ_RO0_WIDTH                     1
#define AIPS_PACRJ_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRJ_RO0_SHIFT))&AIPS_PACRJ_RO0_MASK)
/* PACRK Bit Fields */
#define AIPS_PACRK_AC7_MASK                      0x7u
#define AIPS_PACRK_AC7_SHIFT                     0
#define AIPS_PACRK_AC7_WIDTH                     3
#define AIPS_PACRK_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_AC7_SHIFT))&AIPS_PACRK_AC7_MASK)
#define AIPS_PACRK_RO7_MASK                      0x8u
#define AIPS_PACRK_RO7_SHIFT                     3
#define AIPS_PACRK_RO7_WIDTH                     1
#define AIPS_PACRK_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_RO7_SHIFT))&AIPS_PACRK_RO7_MASK)
#define AIPS_PACRK_AC6_MASK                      0x70u
#define AIPS_PACRK_AC6_SHIFT                     4
#define AIPS_PACRK_AC6_WIDTH                     3
#define AIPS_PACRK_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_AC6_SHIFT))&AIPS_PACRK_AC6_MASK)
#define AIPS_PACRK_RO6_MASK                      0x80u
#define AIPS_PACRK_RO6_SHIFT                     7
#define AIPS_PACRK_RO6_WIDTH                     1
#define AIPS_PACRK_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_RO6_SHIFT))&AIPS_PACRK_RO6_MASK)
#define AIPS_PACRK_AC5_MASK                      0x700u
#define AIPS_PACRK_AC5_SHIFT                     8
#define AIPS_PACRK_AC5_WIDTH                     3
#define AIPS_PACRK_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_AC5_SHIFT))&AIPS_PACRK_AC5_MASK)
#define AIPS_PACRK_RO5_MASK                      0x800u
#define AIPS_PACRK_RO5_SHIFT                     11
#define AIPS_PACRK_RO5_WIDTH                     1
#define AIPS_PACRK_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_RO5_SHIFT))&AIPS_PACRK_RO5_MASK)
#define AIPS_PACRK_AC4_MASK                      0x7000u
#define AIPS_PACRK_AC4_SHIFT                     12
#define AIPS_PACRK_AC4_WIDTH                     3
#define AIPS_PACRK_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_AC4_SHIFT))&AIPS_PACRK_AC4_MASK)
#define AIPS_PACRK_RO4_MASK                      0x8000u
#define AIPS_PACRK_RO4_SHIFT                     15
#define AIPS_PACRK_RO4_WIDTH                     1
#define AIPS_PACRK_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_RO4_SHIFT))&AIPS_PACRK_RO4_MASK)
#define AIPS_PACRK_AC3_MASK                      0x70000u
#define AIPS_PACRK_AC3_SHIFT                     16
#define AIPS_PACRK_AC3_WIDTH                     3
#define AIPS_PACRK_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_AC3_SHIFT))&AIPS_PACRK_AC3_MASK)
#define AIPS_PACRK_RO3_MASK                      0x80000u
#define AIPS_PACRK_RO3_SHIFT                     19
#define AIPS_PACRK_RO3_WIDTH                     1
#define AIPS_PACRK_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_RO3_SHIFT))&AIPS_PACRK_RO3_MASK)
#define AIPS_PACRK_AC2_MASK                      0x700000u
#define AIPS_PACRK_AC2_SHIFT                     20
#define AIPS_PACRK_AC2_WIDTH                     3
#define AIPS_PACRK_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_AC2_SHIFT))&AIPS_PACRK_AC2_MASK)
#define AIPS_PACRK_RO2_MASK                      0x800000u
#define AIPS_PACRK_RO2_SHIFT                     23
#define AIPS_PACRK_RO2_WIDTH                     1
#define AIPS_PACRK_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_RO2_SHIFT))&AIPS_PACRK_RO2_MASK)
#define AIPS_PACRK_AC1_MASK                      0x7000000u
#define AIPS_PACRK_AC1_SHIFT                     24
#define AIPS_PACRK_AC1_WIDTH                     3
#define AIPS_PACRK_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_AC1_SHIFT))&AIPS_PACRK_AC1_MASK)
#define AIPS_PACRK_RO1_MASK                      0x8000000u
#define AIPS_PACRK_RO1_SHIFT                     27
#define AIPS_PACRK_RO1_WIDTH                     1
#define AIPS_PACRK_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_RO1_SHIFT))&AIPS_PACRK_RO1_MASK)
#define AIPS_PACRK_AC0_MASK                      0x70000000u
#define AIPS_PACRK_AC0_SHIFT                     28
#define AIPS_PACRK_AC0_WIDTH                     3
#define AIPS_PACRK_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_AC0_SHIFT))&AIPS_PACRK_AC0_MASK)
#define AIPS_PACRK_RO0_MASK                      0x80000000u
#define AIPS_PACRK_RO0_SHIFT                     31
#define AIPS_PACRK_RO0_WIDTH                     1
#define AIPS_PACRK_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRK_RO0_SHIFT))&AIPS_PACRK_RO0_MASK)
/* PACRL Bit Fields */
#define AIPS_PACRL_AC7_MASK                      0x7u
#define AIPS_PACRL_AC7_SHIFT                     0
#define AIPS_PACRL_AC7_WIDTH                     3
#define AIPS_PACRL_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_AC7_SHIFT))&AIPS_PACRL_AC7_MASK)
#define AIPS_PACRL_RO7_MASK                      0x8u
#define AIPS_PACRL_RO7_SHIFT                     3
#define AIPS_PACRL_RO7_WIDTH                     1
#define AIPS_PACRL_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_RO7_SHIFT))&AIPS_PACRL_RO7_MASK)
#define AIPS_PACRL_AC6_MASK                      0x70u
#define AIPS_PACRL_AC6_SHIFT                     4
#define AIPS_PACRL_AC6_WIDTH                     3
#define AIPS_PACRL_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_AC6_SHIFT))&AIPS_PACRL_AC6_MASK)
#define AIPS_PACRL_RO6_MASK                      0x80u
#define AIPS_PACRL_RO6_SHIFT                     7
#define AIPS_PACRL_RO6_WIDTH                     1
#define AIPS_PACRL_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_RO6_SHIFT))&AIPS_PACRL_RO6_MASK)
#define AIPS_PACRL_AC5_MASK                      0x700u
#define AIPS_PACRL_AC5_SHIFT                     8
#define AIPS_PACRL_AC5_WIDTH                     3
#define AIPS_PACRL_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_AC5_SHIFT))&AIPS_PACRL_AC5_MASK)
#define AIPS_PACRL_RO5_MASK                      0x800u
#define AIPS_PACRL_RO5_SHIFT                     11
#define AIPS_PACRL_RO5_WIDTH                     1
#define AIPS_PACRL_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_RO5_SHIFT))&AIPS_PACRL_RO5_MASK)
#define AIPS_PACRL_AC4_MASK                      0x7000u
#define AIPS_PACRL_AC4_SHIFT                     12
#define AIPS_PACRL_AC4_WIDTH                     3
