RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
#define AIPS_PACRL_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_AC4_SHIFT))&AIPS_PACRL_AC4_MASK)
#define AIPS_PACRL_RO4_MASK                      0x8000u
#define AIPS_PACRL_RO4_SHIFT                     15
#define AIPS_PACRL_RO4_WIDTH                     1
#define AIPS_PACRL_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_RO4_SHIFT))&AIPS_PACRL_RO4_MASK)
#define AIPS_PACRL_AC3_MASK                      0x70000u
#define AIPS_PACRL_AC3_SHIFT                     16
#define AIPS_PACRL_AC3_WIDTH                     3
#define AIPS_PACRL_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_AC3_SHIFT))&AIPS_PACRL_AC3_MASK)
#define AIPS_PACRL_RO3_MASK                      0x80000u
#define AIPS_PACRL_RO3_SHIFT                     19
#define AIPS_PACRL_RO3_WIDTH                     1
#define AIPS_PACRL_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_RO3_SHIFT))&AIPS_PACRL_RO3_MASK)
#define AIPS_PACRL_AC2_MASK                      0x700000u
#define AIPS_PACRL_AC2_SHIFT                     20
#define AIPS_PACRL_AC2_WIDTH                     3
#define AIPS_PACRL_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_AC2_SHIFT))&AIPS_PACRL_AC2_MASK)
#define AIPS_PACRL_RO2_MASK                      0x800000u
#define AIPS_PACRL_RO2_SHIFT                     23
#define AIPS_PACRL_RO2_WIDTH                     1
#define AIPS_PACRL_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_RO2_SHIFT))&AIPS_PACRL_RO2_MASK)
#define AIPS_PACRL_AC1_MASK                      0x7000000u
#define AIPS_PACRL_AC1_SHIFT                     24
#define AIPS_PACRL_AC1_WIDTH                     3
#define AIPS_PACRL_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_AC1_SHIFT))&AIPS_PACRL_AC1_MASK)
#define AIPS_PACRL_RO1_MASK                      0x8000000u
#define AIPS_PACRL_RO1_SHIFT                     27
#define AIPS_PACRL_RO1_WIDTH                     1
#define AIPS_PACRL_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_RO1_SHIFT))&AIPS_PACRL_RO1_MASK)
#define AIPS_PACRL_AC0_MASK                      0x70000000u
#define AIPS_PACRL_AC0_SHIFT                     28
#define AIPS_PACRL_AC0_WIDTH                     3
#define AIPS_PACRL_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_AC0_SHIFT))&AIPS_PACRL_AC0_MASK)
#define AIPS_PACRL_RO0_MASK                      0x80000000u
#define AIPS_PACRL_RO0_SHIFT                     31
#define AIPS_PACRL_RO0_WIDTH                     1
#define AIPS_PACRL_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRL_RO0_SHIFT))&AIPS_PACRL_RO0_MASK)
/* PACRM Bit Fields */
#define AIPS_PACRM_AC7_MASK                      0x7u
#define AIPS_PACRM_AC7_SHIFT                     0
#define AIPS_PACRM_AC7_WIDTH                     3
#define AIPS_PACRM_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_AC7_SHIFT))&AIPS_PACRM_AC7_MASK)
#define AIPS_PACRM_RO7_MASK                      0x8u
#define AIPS_PACRM_RO7_SHIFT                     3
#define AIPS_PACRM_RO7_WIDTH                     1
#define AIPS_PACRM_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_RO7_SHIFT))&AIPS_PACRM_RO7_MASK)
#define AIPS_PACRM_AC6_MASK                      0x70u
#define AIPS_PACRM_AC6_SHIFT                     4
#define AIPS_PACRM_AC6_WIDTH                     3
#define AIPS_PACRM_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_AC6_SHIFT))&AIPS_PACRM_AC6_MASK)
#define AIPS_PACRM_RO6_MASK                      0x80u
#define AIPS_PACRM_RO6_SHIFT                     7
#define AIPS_PACRM_RO6_WIDTH                     1
#define AIPS_PACRM_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_RO6_SHIFT))&AIPS_PACRM_RO6_MASK)
#define AIPS_PACRM_AC5_MASK                      0x700u
#define AIPS_PACRM_AC5_SHIFT                     8
#define AIPS_PACRM_AC5_WIDTH                     3
#define AIPS_PACRM_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_AC5_SHIFT))&AIPS_PACRM_AC5_MASK)
#define AIPS_PACRM_RO5_MASK                      0x800u
#define AIPS_PACRM_RO5_SHIFT                     11
#define AIPS_PACRM_RO5_WIDTH                     1
#define AIPS_PACRM_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_RO5_SHIFT))&AIPS_PACRM_RO5_MASK)
#define AIPS_PACRM_AC4_MASK                      0x7000u
#define AIPS_PACRM_AC4_SHIFT                     12
#define AIPS_PACRM_AC4_WIDTH                     3
#define AIPS_PACRM_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_AC4_SHIFT))&AIPS_PACRM_AC4_MASK)
#define AIPS_PACRM_RO4_MASK                      0x8000u
#define AIPS_PACRM_RO4_SHIFT                     15
#define AIPS_PACRM_RO4_WIDTH                     1
#define AIPS_PACRM_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_RO4_SHIFT))&AIPS_PACRM_RO4_MASK)
#define AIPS_PACRM_AC3_MASK                      0x70000u
#define AIPS_PACRM_AC3_SHIFT                     16
#define AIPS_PACRM_AC3_WIDTH                     3
#define AIPS_PACRM_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_AC3_SHIFT))&AIPS_PACRM_AC3_MASK)
#define AIPS_PACRM_RO3_MASK                      0x80000u
#define AIPS_PACRM_RO3_SHIFT                     19
#define AIPS_PACRM_RO3_WIDTH                     1
#define AIPS_PACRM_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_RO3_SHIFT))&AIPS_PACRM_RO3_MASK)
#define AIPS_PACRM_AC2_MASK                      0x700000u
#define AIPS_PACRM_AC2_SHIFT                     20
#define AIPS_PACRM_AC2_WIDTH                     3
#define AIPS_PACRM_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_AC2_SHIFT))&AIPS_PACRM_AC2_MASK)
#define AIPS_PACRM_RO2_MASK                      0x800000u
#define AIPS_PACRM_RO2_SHIFT                     23
#define AIPS_PACRM_RO2_WIDTH                     1
#define AIPS_PACRM_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_RO2_SHIFT))&AIPS_PACRM_RO2_MASK)
#define AIPS_PACRM_AC1_MASK                      0x7000000u
#define AIPS_PACRM_AC1_SHIFT                     24
#define AIPS_PACRM_AC1_WIDTH                     3
#define AIPS_PACRM_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_AC1_SHIFT))&AIPS_PACRM_AC1_MASK)
#define AIPS_PACRM_RO1_MASK                      0x8000000u
#define AIPS_PACRM_RO1_SHIFT                     27
#define AIPS_PACRM_RO1_WIDTH                     1
#define AIPS_PACRM_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_RO1_SHIFT))&AIPS_PACRM_RO1_MASK)
#define AIPS_PACRM_AC0_MASK                      0x70000000u
#define AIPS_PACRM_AC0_SHIFT                     28
#define AIPS_PACRM_AC0_WIDTH                     3
#define AIPS_PACRM_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_AC0_SHIFT))&AIPS_PACRM_AC0_MASK)
#define AIPS_PACRM_RO0_MASK                      0x80000000u
#define AIPS_PACRM_RO0_SHIFT                     31
#define AIPS_PACRM_RO0_WIDTH                     1
#define AIPS_PACRM_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRM_RO0_SHIFT))&AIPS_PACRM_RO0_MASK)
/* PACRN Bit Fields */
#define AIPS_PACRN_AC7_MASK                      0x7u
#define AIPS_PACRN_AC7_SHIFT                     0
#define AIPS_PACRN_AC7_WIDTH                     3
#define AIPS_PACRN_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_AC7_SHIFT))&AIPS_PACRN_AC7_MASK)
#define AIPS_PACRN_RO7_MASK                      0x8u
#define AIPS_PACRN_RO7_SHIFT                     3
#define AIPS_PACRN_RO7_WIDTH                     1
#define AIPS_PACRN_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_RO7_SHIFT))&AIPS_PACRN_RO7_MASK)
#define AIPS_PACRN_AC6_MASK                      0x70u
#define AIPS_PACRN_AC6_SHIFT                     4
#define AIPS_PACRN_AC6_WIDTH                     3
#define AIPS_PACRN_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_AC6_SHIFT))&AIPS_PACRN_AC6_MASK)
#define AIPS_PACRN_RO6_MASK                      0x80u
#define AIPS_PACRN_RO6_SHIFT                     7
#define AIPS_PACRN_RO6_WIDTH                     1
#define AIPS_PACRN_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_RO6_SHIFT))&AIPS_PACRN_RO6_MASK)
#define AIPS_PACRN_AC5_MASK                      0x700u
#define AIPS_PACRN_AC5_SHIFT                     8
#define AIPS_PACRN_AC5_WIDTH                     3
#define AIPS_PACRN_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_AC5_SHIFT))&AIPS_PACRN_AC5_MASK)
#define AIPS_PACRN_RO5_MASK                      0x800u
#define AIPS_PACRN_RO5_SHIFT                     11
#define AIPS_PACRN_RO5_WIDTH                     1
#define AIPS_PACRN_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_RO5_SHIFT))&AIPS_PACRN_RO5_MASK)
#define AIPS_PACRN_AC4_MASK                      0x7000u
#define AIPS_PACRN_AC4_SHIFT                     12
#define AIPS_PACRN_AC4_WIDTH                     3
#define AIPS_PACRN_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_AC4_SHIFT))&AIPS_PACRN_AC4_MASK)
#define AIPS_PACRN_RO4_MASK                      0x8000u
#define AIPS_PACRN_RO4_SHIFT                     15
#define AIPS_PACRN_RO4_WIDTH                     1
#define AIPS_PACRN_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_RO4_SHIFT))&AIPS_PACRN_RO4_MASK)
#define AIPS_PACRN_AC3_MASK                      0x70000u
#define AIPS_PACRN_AC3_SHIFT                     16
#define AIPS_PACRN_AC3_WIDTH                     3
#define AIPS_PACRN_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_AC3_SHIFT))&AIPS_PACRN_AC3_MASK)
#define AIPS_PACRN_RO3_MASK                      0x80000u
#define AIPS_PACRN_RO3_SHIFT                     19
#define AIPS_PACRN_RO3_WIDTH                     1
#define AIPS_PACRN_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_RO3_SHIFT))&AIPS_PACRN_RO3_MASK)
#define AIPS_PACRN_AC2_MASK                      0x700000u
#define AIPS_PACRN_AC2_SHIFT                     20
#define AIPS_PACRN_AC2_WIDTH                     3
#define AIPS_PACRN_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_AC2_SHIFT))&AIPS_PACRN_AC2_MASK)
#define AIPS_PACRN_RO2_MASK                      0x800000u
#define AIPS_PACRN_RO2_SHIFT                     23
#define AIPS_PACRN_RO2_WIDTH                     1
#define AIPS_PACRN_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_RO2_SHIFT))&AIPS_PACRN_RO2_MASK)
#define AIPS_PACRN_AC1_MASK                      0x7000000u
#define AIPS_PACRN_AC1_SHIFT                     24
#define AIPS_PACRN_AC1_WIDTH                     3
#define AIPS_PACRN_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_AC1_SHIFT))&AIPS_PACRN_AC1_MASK)
#define AIPS_PACRN_RO1_MASK                      0x8000000u
#define AIPS_PACRN_RO1_SHIFT                     27
#define AIPS_PACRN_RO1_WIDTH                     1
#define AIPS_PACRN_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_RO1_SHIFT))&AIPS_PACRN_RO1_MASK)
#define AIPS_PACRN_AC0_MASK                      0x70000000u
#define AIPS_PACRN_AC0_SHIFT                     28
#define AIPS_PACRN_AC0_WIDTH                     3
#define AIPS_PACRN_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_AC0_SHIFT))&AIPS_PACRN_AC0_MASK)
#define AIPS_PACRN_RO0_MASK                      0x80000000u
#define AIPS_PACRN_RO0_SHIFT                     31
#define AIPS_PACRN_RO0_WIDTH                     1
#define AIPS_PACRN_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRN_RO0_SHIFT))&AIPS_PACRN_RO0_MASK)
/* PACRO Bit Fields */
#define AIPS_PACRO_AC7_MASK                      0x7u
#define AIPS_PACRO_AC7_SHIFT                     0
#define AIPS_PACRO_AC7_WIDTH                     3
#define AIPS_PACRO_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_AC7_SHIFT))&AIPS_PACRO_AC7_MASK)
#define AIPS_PACRO_RO7_MASK                      0x8u
#define AIPS_PACRO_RO7_SHIFT                     3
#define AIPS_PACRO_RO7_WIDTH                     1
#define AIPS_PACRO_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_RO7_SHIFT))&AIPS_PACRO_RO7_MASK)
#define AIPS_PACRO_AC6_MASK                      0x70u
#define AIPS_PACRO_AC6_SHIFT                     4
#define AIPS_PACRO_AC6_WIDTH                     3
#define AIPS_PACRO_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_AC6_SHIFT))&AIPS_PACRO_AC6_MASK)
#define AIPS_PACRO_RO6_MASK                      0x80u
#define AIPS_PACRO_RO6_SHIFT                     7
#define AIPS_PACRO_RO6_WIDTH                     1
#define AIPS_PACRO_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_RO6_SHIFT))&AIPS_PACRO_RO6_MASK)
#define AIPS_PACRO_AC5_MASK                      0x700u
#define AIPS_PACRO_AC5_SHIFT                     8
#define AIPS_PACRO_AC5_WIDTH                     3
#define AIPS_PACRO_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_AC5_SHIFT))&AIPS_PACRO_AC5_MASK)
#define AIPS_PACRO_RO5_MASK                      0x800u
#define AIPS_PACRO_RO5_SHIFT                     11
#define AIPS_PACRO_RO5_WIDTH                     1
#define AIPS_PACRO_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_RO5_SHIFT))&AIPS_PACRO_RO5_MASK)
#define AIPS_PACRO_AC4_MASK                      0x7000u
#define AIPS_PACRO_AC4_SHIFT                     12
#define AIPS_PACRO_AC4_WIDTH                     3
#define AIPS_PACRO_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_AC4_SHIFT))&AIPS_PACRO_AC4_MASK)
#define AIPS_PACRO_RO4_MASK                      0x8000u
#define AIPS_PACRO_RO4_SHIFT                     15
#define AIPS_PACRO_RO4_WIDTH                     1
#define AIPS_PACRO_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_RO4_SHIFT))&AIPS_PACRO_RO4_MASK)
#define AIPS_PACRO_AC3_MASK                      0x70000u
#define AIPS_PACRO_AC3_SHIFT                     16
#define AIPS_PACRO_AC3_WIDTH                     3
#define AIPS_PACRO_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_AC3_SHIFT))&AIPS_PACRO_AC3_MASK)
#define AIPS_PACRO_RO3_MASK                      0x80000u
#define AIPS_PACRO_RO3_SHIFT                     19
#define AIPS_PACRO_RO3_WIDTH                     1
#define AIPS_PACRO_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_RO3_SHIFT))&AIPS_PACRO_RO3_MASK)
#define AIPS_PACRO_AC2_MASK                      0x700000u
#define AIPS_PACRO_AC2_SHIFT                     20
#define AIPS_PACRO_AC2_WIDTH                     3
#define AIPS_PACRO_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_AC2_SHIFT))&AIPS_PACRO_AC2_MASK)
#define AIPS_PACRO_RO2_MASK                      0x800000u
#define AIPS_PACRO_RO2_SHIFT                     23
#define AIPS_PACRO_RO2_WIDTH                     1
#define AIPS_PACRO_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_RO2_SHIFT))&AIPS_PACRO_RO2_MASK)
#define AIPS_PACRO_AC1_MASK                      0x7000000u
#define AIPS_PACRO_AC1_SHIFT                     24
#define AIPS_PACRO_AC1_WIDTH                     3
#define AIPS_PACRO_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_AC1_SHIFT))&AIPS_PACRO_AC1_MASK)
#define AIPS_PACRO_RO1_MASK                      0x8000000u
#define AIPS_PACRO_RO1_SHIFT                     27
#define AIPS_PACRO_RO1_WIDTH                     1
#define AIPS_PACRO_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_RO1_SHIFT))&AIPS_PACRO_RO1_MASK)
#define AIPS_PACRO_AC0_MASK                      0x70000000u
#define AIPS_PACRO_AC0_SHIFT                     28
#define AIPS_PACRO_AC0_WIDTH                     3
#define AIPS_PACRO_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_AC0_SHIFT))&AIPS_PACRO_AC0_MASK)
#define AIPS_PACRO_RO0_MASK                      0x80000000u
#define AIPS_PACRO_RO0_SHIFT                     31
#define AIPS_PACRO_RO0_WIDTH                     1
#define AIPS_PACRO_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRO_RO0_SHIFT))&AIPS_PACRO_RO0_MASK)
/* PACRP Bit Fields */
#define AIPS_PACRP_AC7_MASK                      0x7u
#define AIPS_PACRP_AC7_SHIFT                     0
#define AIPS_PACRP_AC7_WIDTH                     3
#define AIPS_PACRP_AC7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_AC7_SHIFT))&AIPS_PACRP_AC7_MASK)
#define AIPS_PACRP_RO7_MASK                      0x8u
#define AIPS_PACRP_RO7_SHIFT                     3
#define AIPS_PACRP_RO7_WIDTH                     1
#define AIPS_PACRP_RO7(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_RO7_SHIFT))&AIPS_PACRP_RO7_MASK)
#define AIPS_PACRP_AC6_MASK                      0x70u
#define AIPS_PACRP_AC6_SHIFT                     4
#define AIPS_PACRP_AC6_WIDTH                     3
#define AIPS_PACRP_AC6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_AC6_SHIFT))&AIPS_PACRP_AC6_MASK)
#define AIPS_PACRP_RO6_MASK                      0x80u
#define AIPS_PACRP_RO6_SHIFT                     7
#define AIPS_PACRP_RO6_WIDTH                     1
#define AIPS_PACRP_RO6(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_RO6_SHIFT))&AIPS_PACRP_RO6_MASK)
#define AIPS_PACRP_AC5_MASK                      0x700u
#define AIPS_PACRP_AC5_SHIFT                     8
#define AIPS_PACRP_AC5_WIDTH                     3
#define AIPS_PACRP_AC5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_AC5_SHIFT))&AIPS_PACRP_AC5_MASK)
#define AIPS_PACRP_RO5_MASK                      0x800u
#define AIPS_PACRP_RO5_SHIFT                     11
#define AIPS_PACRP_RO5_WIDTH                     1
#define AIPS_PACRP_RO5(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_RO5_SHIFT))&AIPS_PACRP_RO5_MASK)
#define AIPS_PACRP_AC4_MASK                      0x7000u
#define AIPS_PACRP_AC4_SHIFT                     12
#define AIPS_PACRP_AC4_WIDTH                     3
#define AIPS_PACRP_AC4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_AC4_SHIFT))&AIPS_PACRP_AC4_MASK)
#define AIPS_PACRP_RO4_MASK                      0x8000u
#define AIPS_PACRP_RO4_SHIFT                     15
#define AIPS_PACRP_RO4_WIDTH                     1
#define AIPS_PACRP_RO4(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_RO4_SHIFT))&AIPS_PACRP_RO4_MASK)
#define AIPS_PACRP_AC3_MASK                      0x70000u
#define AIPS_PACRP_AC3_SHIFT                     16
#define AIPS_PACRP_AC3_WIDTH                     3
#define AIPS_PACRP_AC3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_AC3_SHIFT))&AIPS_PACRP_AC3_MASK)
#define AIPS_PACRP_RO3_MASK                      0x80000u
#define AIPS_PACRP_RO3_SHIFT                     19
#define AIPS_PACRP_RO3_WIDTH                     1
#define AIPS_PACRP_RO3(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_RO3_SHIFT))&AIPS_PACRP_RO3_MASK)
#define AIPS_PACRP_AC2_MASK                      0x700000u
#define AIPS_PACRP_AC2_SHIFT                     20
#define AIPS_PACRP_AC2_WIDTH                     3
#define AIPS_PACRP_AC2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_AC2_SHIFT))&AIPS_PACRP_AC2_MASK)
#define AIPS_PACRP_RO2_MASK                      0x800000u
#define AIPS_PACRP_RO2_SHIFT                     23
#define AIPS_PACRP_RO2_WIDTH                     1
#define AIPS_PACRP_RO2(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_RO2_SHIFT))&AIPS_PACRP_RO2_MASK)
#define AIPS_PACRP_AC1_MASK                      0x7000000u
#define AIPS_PACRP_AC1_SHIFT                     24
#define AIPS_PACRP_AC1_WIDTH                     3
#define AIPS_PACRP_AC1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_AC1_SHIFT))&AIPS_PACRP_AC1_MASK)
#define AIPS_PACRP_RO1_MASK                      0x8000000u
#define AIPS_PACRP_RO1_SHIFT                     27
#define AIPS_PACRP_RO1_WIDTH                     1
#define AIPS_PACRP_RO1(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_RO1_SHIFT))&AIPS_PACRP_RO1_MASK)
#define AIPS_PACRP_AC0_MASK                      0x70000000u
#define AIPS_PACRP_AC0_SHIFT                     28
#define AIPS_PACRP_AC0_WIDTH                     3
#define AIPS_PACRP_AC0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_AC0_SHIFT))&AIPS_PACRP_AC0_MASK)
#define AIPS_PACRP_RO0_MASK                      0x80000000u
#define AIPS_PACRP_RO0_SHIFT                     31
#define AIPS_PACRP_RO0_WIDTH                     1
#define AIPS_PACRP_RO0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_PACRP_RO0_SHIFT))&AIPS_PACRP_RO0_MASK)

/*!
 * @}
 */ /* end of group AIPS_Register_Masks */


/* AIPS - Peripheral instance base addresses */
/** Peripheral AIPS base address */
#define AIPS_BASE                                (0x40000000u)
/** Peripheral AIPS base pointer */
#define AIPS                                     ((AIPS_Type *)AIPS_BASE)
#define AIPS_BASE_PTR                            (AIPS)
/** Array initializer of AIPS peripheral base addresses */
#define AIPS_BASE_ADDRS                          { AIPS_BASE }
/** Array initializer of AIPS peripheral base pointers */
#define AIPS_BASE_PTRS                           { AIPS }

/* ----------------------------------------------------------------------------
   -- AIPS - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPS_Register_Accessor_Macros AIPS - Register accessor macros
 * @{
 */


/* AIPS - Register instance definitions */
/* AIPS */
#define AIPS_PACRA                               AIPS_PACRA_REG(AIPS)
#define AIPS_PACRB                               AIPS_PACRB_REG(AIPS)
#define AIPS_PACRE                               AIPS_PACRE_REG(AIPS)
#define AIPS_PACRF                               AIPS_PACRF_REG(AIPS)
#define AIPS_PACRG                               AIPS_PACRG_REG(AIPS)
#define AIPS_PACRH                               AIPS_PACRH_REG(AIPS)
#define AIPS_PACRI                               AIPS_PACRI_REG(AIPS)
#define AIPS_PACRJ                               AIPS_PACRJ_REG(AIPS)
#define AIPS_PACRK                               AIPS_PACRK_REG(AIPS)
#define AIPS_PACRL                               AIPS_PACRL_REG(AIPS)
#define AIPS_PACRM                               AIPS_PACRM_REG(AIPS)
#define AIPS_PACRN                               AIPS_PACRN_REG(AIPS)
#define AIPS_PACRO                               AIPS_PACRO_REG(AIPS)
#define AIPS_PACRP                               AIPS_PACRP_REG(AIPS)

/*!
 * @}
 */ /* end of group AIPS_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group AIPS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CAU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAU_Peripheral_Access_Layer CAU Peripheral Access Layer
 * @{
 */

