RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
#define LCD_WF8B_BPALCD10_MASK                   0x1u
#define LCD_WF8B_BPALCD10_SHIFT                  0
#define LCD_WF8B_BPALCD10_WIDTH                  1
#define LCD_WF8B_BPALCD10(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD10_SHIFT))&LCD_WF8B_BPALCD10_MASK)
#define LCD_WF8B_BPALCD9_MASK                    0x1u
#define LCD_WF8B_BPALCD9_SHIFT                   0
#define LCD_WF8B_BPALCD9_WIDTH                   1
#define LCD_WF8B_BPALCD9(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD9_SHIFT))&LCD_WF8B_BPALCD9_MASK)
#define LCD_WF8B_BPALCD8_MASK                    0x1u
#define LCD_WF8B_BPALCD8_SHIFT                   0
#define LCD_WF8B_BPALCD8_WIDTH                   1
#define LCD_WF8B_BPALCD8(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPALCD8_SHIFT))&LCD_WF8B_BPALCD8_MASK)
#define LCD_WF8B_BPBLCD1_MASK                    0x2u
#define LCD_WF8B_BPBLCD1_SHIFT                   1
#define LCD_WF8B_BPBLCD1_WIDTH                   1
#define LCD_WF8B_BPBLCD1(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD1_SHIFT))&LCD_WF8B_BPBLCD1_MASK)
#define LCD_WF8B_BPBLCD32_MASK                   0x2u
#define LCD_WF8B_BPBLCD32_SHIFT                  1
#define LCD_WF8B_BPBLCD32_WIDTH                  1
#define LCD_WF8B_BPBLCD32(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD32_SHIFT))&LCD_WF8B_BPBLCD32_MASK)
#define LCD_WF8B_BPBLCD30_MASK                   0x2u
#define LCD_WF8B_BPBLCD30_SHIFT                  1
#define LCD_WF8B_BPBLCD30_WIDTH                  1
#define LCD_WF8B_BPBLCD30(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD30_SHIFT))&LCD_WF8B_BPBLCD30_MASK)
#define LCD_WF8B_BPBLCD60_MASK                   0x2u
#define LCD_WF8B_BPBLCD60_SHIFT                  1
#define LCD_WF8B_BPBLCD60_WIDTH                  1
#define LCD_WF8B_BPBLCD60(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD60_SHIFT))&LCD_WF8B_BPBLCD60_MASK)
#define LCD_WF8B_BPBLCD24_MASK                   0x2u
#define LCD_WF8B_BPBLCD24_SHIFT                  1
#define LCD_WF8B_BPBLCD24_WIDTH                  1
#define LCD_WF8B_BPBLCD24(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD24_SHIFT))&LCD_WF8B_BPBLCD24_MASK)
#define LCD_WF8B_BPBLCD28_MASK                   0x2u
#define LCD_WF8B_BPBLCD28_SHIFT                  1
#define LCD_WF8B_BPBLCD28_WIDTH                  1
#define LCD_WF8B_BPBLCD28(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD28_SHIFT))&LCD_WF8B_BPBLCD28_MASK)
#define LCD_WF8B_BPBLCD23_MASK                   0x2u
#define LCD_WF8B_BPBLCD23_SHIFT                  1
#define LCD_WF8B_BPBLCD23_WIDTH                  1
#define LCD_WF8B_BPBLCD23(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD23_SHIFT))&LCD_WF8B_BPBLCD23_MASK)
#define LCD_WF8B_BPBLCD48_MASK                   0x2u
#define LCD_WF8B_BPBLCD48_SHIFT                  1
#define LCD_WF8B_BPBLCD48_WIDTH                  1
#define LCD_WF8B_BPBLCD48(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD48_SHIFT))&LCD_WF8B_BPBLCD48_MASK)
#define LCD_WF8B_BPBLCD10_MASK                   0x2u
#define LCD_WF8B_BPBLCD10_SHIFT                  1
#define LCD_WF8B_BPBLCD10_WIDTH                  1
#define LCD_WF8B_BPBLCD10(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD10_SHIFT))&LCD_WF8B_BPBLCD10_MASK)
#define LCD_WF8B_BPBLCD15_MASK                   0x2u
#define LCD_WF8B_BPBLCD15_SHIFT                  1
#define LCD_WF8B_BPBLCD15_WIDTH                  1
#define LCD_WF8B_BPBLCD15(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD15_SHIFT))&LCD_WF8B_BPBLCD15_MASK)
#define LCD_WF8B_BPBLCD36_MASK                   0x2u
#define LCD_WF8B_BPBLCD36_SHIFT                  1
#define LCD_WF8B_BPBLCD36_WIDTH                  1
#define LCD_WF8B_BPBLCD36(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD36_SHIFT))&LCD_WF8B_BPBLCD36_MASK)
#define LCD_WF8B_BPBLCD44_MASK                   0x2u
#define LCD_WF8B_BPBLCD44_SHIFT                  1
#define LCD_WF8B_BPBLCD44_WIDTH                  1
#define LCD_WF8B_BPBLCD44(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD44_SHIFT))&LCD_WF8B_BPBLCD44_MASK)
#define LCD_WF8B_BPBLCD62_MASK                   0x2u
#define LCD_WF8B_BPBLCD62_SHIFT                  1
#define LCD_WF8B_BPBLCD62_WIDTH                  1
#define LCD_WF8B_BPBLCD62(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD62_SHIFT))&LCD_WF8B_BPBLCD62_MASK)
#define LCD_WF8B_BPBLCD53_MASK                   0x2u
#define LCD_WF8B_BPBLCD53_SHIFT                  1
#define LCD_WF8B_BPBLCD53_WIDTH                  1
#define LCD_WF8B_BPBLCD53(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD53_SHIFT))&LCD_WF8B_BPBLCD53_MASK)
#define LCD_WF8B_BPBLCD22_MASK                   0x2u
#define LCD_WF8B_BPBLCD22_SHIFT                  1
#define LCD_WF8B_BPBLCD22_WIDTH                  1
#define LCD_WF8B_BPBLCD22(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD22_SHIFT))&LCD_WF8B_BPBLCD22_MASK)
#define LCD_WF8B_BPBLCD47_MASK                   0x2u
#define LCD_WF8B_BPBLCD47_SHIFT                  1
#define LCD_WF8B_BPBLCD47_WIDTH                  1
#define LCD_WF8B_BPBLCD47(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD47_SHIFT))&LCD_WF8B_BPBLCD47_MASK)
#define LCD_WF8B_BPBLCD33_MASK                   0x2u
#define LCD_WF8B_BPBLCD33_SHIFT                  1
#define LCD_WF8B_BPBLCD33_WIDTH                  1
#define LCD_WF8B_BPBLCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD33_SHIFT))&LCD_WF8B_BPBLCD33_MASK)
#define LCD_WF8B_BPBLCD2_MASK                    0x2u
#define LCD_WF8B_BPBLCD2_SHIFT                   1
#define LCD_WF8B_BPBLCD2_WIDTH                   1
#define LCD_WF8B_BPBLCD2(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD2_SHIFT))&LCD_WF8B_BPBLCD2_MASK)
#define LCD_WF8B_BPBLCD49_MASK                   0x2u
#define LCD_WF8B_BPBLCD49_SHIFT                  1
#define LCD_WF8B_BPBLCD49_WIDTH                  1
#define LCD_WF8B_BPBLCD49(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD49_SHIFT))&LCD_WF8B_BPBLCD49_MASK)
#define LCD_WF8B_BPBLCD0_MASK                    0x2u
#define LCD_WF8B_BPBLCD0_SHIFT                   1
#define LCD_WF8B_BPBLCD0_WIDTH                   1
#define LCD_WF8B_BPBLCD0(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD0_SHIFT))&LCD_WF8B_BPBLCD0_MASK)
#define LCD_WF8B_BPBLCD55_MASK                   0x2u
#define LCD_WF8B_BPBLCD55_SHIFT                  1
#define LCD_WF8B_BPBLCD55_WIDTH                  1
#define LCD_WF8B_BPBLCD55(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD55_SHIFT))&LCD_WF8B_BPBLCD55_MASK)
#define LCD_WF8B_BPBLCD56_MASK                   0x2u
#define LCD_WF8B_BPBLCD56_SHIFT                  1
#define LCD_WF8B_BPBLCD56_WIDTH                  1
#define LCD_WF8B_BPBLCD56(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD56_SHIFT))&LCD_WF8B_BPBLCD56_MASK)
#define LCD_WF8B_BPBLCD21_MASK                   0x2u
#define LCD_WF8B_BPBLCD21_SHIFT                  1
#define LCD_WF8B_BPBLCD21_WIDTH                  1
#define LCD_WF8B_BPBLCD21(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD21_SHIFT))&LCD_WF8B_BPBLCD21_MASK)
#define LCD_WF8B_BPBLCD6_MASK                    0x2u
#define LCD_WF8B_BPBLCD6_SHIFT                   1
#define LCD_WF8B_BPBLCD6_WIDTH                   1
#define LCD_WF8B_BPBLCD6(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD6_SHIFT))&LCD_WF8B_BPBLCD6_MASK)
#define LCD_WF8B_BPBLCD29_MASK                   0x2u
#define LCD_WF8B_BPBLCD29_SHIFT                  1
#define LCD_WF8B_BPBLCD29_WIDTH                  1
#define LCD_WF8B_BPBLCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD29_SHIFT))&LCD_WF8B_BPBLCD29_MASK)
#define LCD_WF8B_BPBLCD25_MASK                   0x2u
#define LCD_WF8B_BPBLCD25_SHIFT                  1
#define LCD_WF8B_BPBLCD25_WIDTH                  1
#define LCD_WF8B_BPBLCD25(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD25_SHIFT))&LCD_WF8B_BPBLCD25_MASK)
#define LCD_WF8B_BPBLCD8_MASK                    0x2u
#define LCD_WF8B_BPBLCD8_SHIFT                   1
#define LCD_WF8B_BPBLCD8_WIDTH                   1
#define LCD_WF8B_BPBLCD8(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD8_SHIFT))&LCD_WF8B_BPBLCD8_MASK)
#define LCD_WF8B_BPBLCD54_MASK                   0x2u
#define LCD_WF8B_BPBLCD54_SHIFT                  1
#define LCD_WF8B_BPBLCD54_WIDTH                  1
#define LCD_WF8B_BPBLCD54(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD54_SHIFT))&LCD_WF8B_BPBLCD54_MASK)
#define LCD_WF8B_BPBLCD38_MASK                   0x2u
#define LCD_WF8B_BPBLCD38_SHIFT                  1
#define LCD_WF8B_BPBLCD38_WIDTH                  1
#define LCD_WF8B_BPBLCD38(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD38_SHIFT))&LCD_WF8B_BPBLCD38_MASK)
#define LCD_WF8B_BPBLCD43_MASK                   0x2u
#define LCD_WF8B_BPBLCD43_SHIFT                  1
#define LCD_WF8B_BPBLCD43_WIDTH                  1
#define LCD_WF8B_BPBLCD43(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD43_SHIFT))&LCD_WF8B_BPBLCD43_MASK)
#define LCD_WF8B_BPBLCD20_MASK                   0x2u
#define LCD_WF8B_BPBLCD20_SHIFT                  1
#define LCD_WF8B_BPBLCD20_WIDTH                  1
#define LCD_WF8B_BPBLCD20(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD20_SHIFT))&LCD_WF8B_BPBLCD20_MASK)
#define LCD_WF8B_BPBLCD9_MASK                    0x2u
#define LCD_WF8B_BPBLCD9_SHIFT                   1
#define LCD_WF8B_BPBLCD9_WIDTH                   1
#define LCD_WF8B_BPBLCD9(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD9_SHIFT))&LCD_WF8B_BPBLCD9_MASK)
#define LCD_WF8B_BPBLCD7_MASK                    0x2u
#define LCD_WF8B_BPBLCD7_SHIFT                   1
#define LCD_WF8B_BPBLCD7_WIDTH                   1
#define LCD_WF8B_BPBLCD7(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD7_SHIFT))&LCD_WF8B_BPBLCD7_MASK)
#define LCD_WF8B_BPBLCD50_MASK                   0x2u
#define LCD_WF8B_BPBLCD50_SHIFT                  1
#define LCD_WF8B_BPBLCD50_WIDTH                  1
#define LCD_WF8B_BPBLCD50(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD50_SHIFT))&LCD_WF8B_BPBLCD50_MASK)
#define LCD_WF8B_BPBLCD40_MASK                   0x2u
#define LCD_WF8B_BPBLCD40_SHIFT                  1
#define LCD_WF8B_BPBLCD40_WIDTH                  1
#define LCD_WF8B_BPBLCD40(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD40_SHIFT))&LCD_WF8B_BPBLCD40_MASK)
#define LCD_WF8B_BPBLCD63_MASK                   0x2u
#define LCD_WF8B_BPBLCD63_SHIFT                  1
#define LCD_WF8B_BPBLCD63_WIDTH                  1
#define LCD_WF8B_BPBLCD63(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD63_SHIFT))&LCD_WF8B_BPBLCD63_MASK)
#define LCD_WF8B_BPBLCD26_MASK                   0x2u
#define LCD_WF8B_BPBLCD26_SHIFT                  1
#define LCD_WF8B_BPBLCD26_WIDTH                  1
#define LCD_WF8B_BPBLCD26(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD26_SHIFT))&LCD_WF8B_BPBLCD26_MASK)
#define LCD_WF8B_BPBLCD12_MASK                   0x2u
#define LCD_WF8B_BPBLCD12_SHIFT                  1
#define LCD_WF8B_BPBLCD12_WIDTH                  1
#define LCD_WF8B_BPBLCD12(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD12_SHIFT))&LCD_WF8B_BPBLCD12_MASK)
#define LCD_WF8B_BPBLCD19_MASK                   0x2u
#define LCD_WF8B_BPBLCD19_SHIFT                  1
#define LCD_WF8B_BPBLCD19_WIDTH                  1
#define LCD_WF8B_BPBLCD19(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD19_SHIFT))&LCD_WF8B_BPBLCD19_MASK)
#define LCD_WF8B_BPBLCD34_MASK                   0x2u
#define LCD_WF8B_BPBLCD34_SHIFT                  1
#define LCD_WF8B_BPBLCD34_WIDTH                  1
#define LCD_WF8B_BPBLCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD34_SHIFT))&LCD_WF8B_BPBLCD34_MASK)
#define LCD_WF8B_BPBLCD39_MASK                   0x2u
#define LCD_WF8B_BPBLCD39_SHIFT                  1
#define LCD_WF8B_BPBLCD39_WIDTH                  1
#define LCD_WF8B_BPBLCD39(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD39_SHIFT))&LCD_WF8B_BPBLCD39_MASK)
#define LCD_WF8B_BPBLCD59_MASK                   0x2u
#define LCD_WF8B_BPBLCD59_SHIFT                  1
#define LCD_WF8B_BPBLCD59_WIDTH                  1
#define LCD_WF8B_BPBLCD59(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD59_SHIFT))&LCD_WF8B_BPBLCD59_MASK)
#define LCD_WF8B_BPBLCD61_MASK                   0x2u
#define LCD_WF8B_BPBLCD61_SHIFT                  1
#define LCD_WF8B_BPBLCD61_WIDTH                  1
#define LCD_WF8B_BPBLCD61(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD61_SHIFT))&LCD_WF8B_BPBLCD61_MASK)
#define LCD_WF8B_BPBLCD37_MASK                   0x2u
#define LCD_WF8B_BPBLCD37_SHIFT                  1
#define LCD_WF8B_BPBLCD37_WIDTH                  1
#define LCD_WF8B_BPBLCD37(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD37_SHIFT))&LCD_WF8B_BPBLCD37_MASK)
#define LCD_WF8B_BPBLCD31_MASK                   0x2u
#define LCD_WF8B_BPBLCD31_SHIFT                  1
#define LCD_WF8B_BPBLCD31_WIDTH                  1
#define LCD_WF8B_BPBLCD31(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD31_SHIFT))&LCD_WF8B_BPBLCD31_MASK)
#define LCD_WF8B_BPBLCD58_MASK                   0x2u
#define LCD_WF8B_BPBLCD58_SHIFT                  1
#define LCD_WF8B_BPBLCD58_WIDTH                  1
#define LCD_WF8B_BPBLCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD58_SHIFT))&LCD_WF8B_BPBLCD58_MASK)
#define LCD_WF8B_BPBLCD18_MASK                   0x2u
#define LCD_WF8B_BPBLCD18_SHIFT                  1
#define LCD_WF8B_BPBLCD18_WIDTH                  1
#define LCD_WF8B_BPBLCD18(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD18_SHIFT))&LCD_WF8B_BPBLCD18_MASK)
#define LCD_WF8B_BPBLCD45_MASK                   0x2u
#define LCD_WF8B_BPBLCD45_SHIFT                  1
#define LCD_WF8B_BPBLCD45_WIDTH                  1
#define LCD_WF8B_BPBLCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD45_SHIFT))&LCD_WF8B_BPBLCD45_MASK)
#define LCD_WF8B_BPBLCD27_MASK                   0x2u
#define LCD_WF8B_BPBLCD27_SHIFT                  1
#define LCD_WF8B_BPBLCD27_WIDTH                  1
#define LCD_WF8B_BPBLCD27(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD27_SHIFT))&LCD_WF8B_BPBLCD27_MASK)
#define LCD_WF8B_BPBLCD14_MASK                   0x2u
#define LCD_WF8B_BPBLCD14_SHIFT                  1
#define LCD_WF8B_BPBLCD14_WIDTH                  1
#define LCD_WF8B_BPBLCD14(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD14_SHIFT))&LCD_WF8B_BPBLCD14_MASK)
#define LCD_WF8B_BPBLCD51_MASK                   0x2u
#define LCD_WF8B_BPBLCD51_SHIFT                  1
#define LCD_WF8B_BPBLCD51_WIDTH                  1
#define LCD_WF8B_BPBLCD51(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD51_SHIFT))&LCD_WF8B_BPBLCD51_MASK)
#define LCD_WF8B_BPBLCD52_MASK                   0x2u
#define LCD_WF8B_BPBLCD52_SHIFT                  1
#define LCD_WF8B_BPBLCD52_WIDTH                  1
#define LCD_WF8B_BPBLCD52(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD52_SHIFT))&LCD_WF8B_BPBLCD52_MASK)
#define LCD_WF8B_BPBLCD4_MASK                    0x2u
#define LCD_WF8B_BPBLCD4_SHIFT                   1
#define LCD_WF8B_BPBLCD4_WIDTH                   1
#define LCD_WF8B_BPBLCD4(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD4_SHIFT))&LCD_WF8B_BPBLCD4_MASK)
#define LCD_WF8B_BPBLCD35_MASK                   0x2u
#define LCD_WF8B_BPBLCD35_SHIFT                  1
#define LCD_WF8B_BPBLCD35_WIDTH                  1
#define LCD_WF8B_BPBLCD35(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD35_SHIFT))&LCD_WF8B_BPBLCD35_MASK)
#define LCD_WF8B_BPBLCD17_MASK                   0x2u
#define LCD_WF8B_BPBLCD17_SHIFT                  1
#define LCD_WF8B_BPBLCD17_WIDTH                  1
#define LCD_WF8B_BPBLCD17(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD17_SHIFT))&LCD_WF8B_BPBLCD17_MASK)
#define LCD_WF8B_BPBLCD41_MASK                   0x2u
#define LCD_WF8B_BPBLCD41_SHIFT                  1
#define LCD_WF8B_BPBLCD41_WIDTH                  1
#define LCD_WF8B_BPBLCD41(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD41_SHIFT))&LCD_WF8B_BPBLCD41_MASK)
#define LCD_WF8B_BPBLCD11_MASK                   0x2u
#define LCD_WF8B_BPBLCD11_SHIFT                  1
#define LCD_WF8B_BPBLCD11_WIDTH                  1
#define LCD_WF8B_BPBLCD11(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD11_SHIFT))&LCD_WF8B_BPBLCD11_MASK)
#define LCD_WF8B_BPBLCD46_MASK                   0x2u
#define LCD_WF8B_BPBLCD46_SHIFT                  1
#define LCD_WF8B_BPBLCD46_WIDTH                  1
#define LCD_WF8B_BPBLCD46(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD46_SHIFT))&LCD_WF8B_BPBLCD46_MASK)
#define LCD_WF8B_BPBLCD57_MASK                   0x2u
#define LCD_WF8B_BPBLCD57_SHIFT                  1
#define LCD_WF8B_BPBLCD57_WIDTH                  1
#define LCD_WF8B_BPBLCD57(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD57_SHIFT))&LCD_WF8B_BPBLCD57_MASK)
#define LCD_WF8B_BPBLCD42_MASK                   0x2u
#define LCD_WF8B_BPBLCD42_SHIFT                  1
#define LCD_WF8B_BPBLCD42_WIDTH                  1
#define LCD_WF8B_BPBLCD42(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD42_SHIFT))&LCD_WF8B_BPBLCD42_MASK)
#define LCD_WF8B_BPBLCD5_MASK                    0x2u
#define LCD_WF8B_BPBLCD5_SHIFT                   1
#define LCD_WF8B_BPBLCD5_WIDTH                   1
#define LCD_WF8B_BPBLCD5(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD5_SHIFT))&LCD_WF8B_BPBLCD5_MASK)
#define LCD_WF8B_BPBLCD3_MASK                    0x2u
#define LCD_WF8B_BPBLCD3_SHIFT                   1
#define LCD_WF8B_BPBLCD3_WIDTH                   1
#define LCD_WF8B_BPBLCD3(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD3_SHIFT))&LCD_WF8B_BPBLCD3_MASK)
#define LCD_WF8B_BPBLCD16_MASK                   0x2u
#define LCD_WF8B_BPBLCD16_SHIFT                  1
#define LCD_WF8B_BPBLCD16_WIDTH                  1
#define LCD_WF8B_BPBLCD16(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD16_SHIFT))&LCD_WF8B_BPBLCD16_MASK)
#define LCD_WF8B_BPBLCD13_MASK                   0x2u
#define LCD_WF8B_BPBLCD13_SHIFT                  1
#define LCD_WF8B_BPBLCD13_WIDTH                  1
#define LCD_WF8B_BPBLCD13(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPBLCD13_SHIFT))&LCD_WF8B_BPBLCD13_MASK)
#define LCD_WF8B_BPCLCD10_MASK                   0x4u
#define LCD_WF8B_BPCLCD10_SHIFT                  2
#define LCD_WF8B_BPCLCD10_WIDTH                  1
#define LCD_WF8B_BPCLCD10(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD10_SHIFT))&LCD_WF8B_BPCLCD10_MASK)
#define LCD_WF8B_BPCLCD55_MASK                   0x4u
#define LCD_WF8B_BPCLCD55_SHIFT                  2
#define LCD_WF8B_BPCLCD55_WIDTH                  1
#define LCD_WF8B_BPCLCD55(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD55_SHIFT))&LCD_WF8B_BPCLCD55_MASK)
#define LCD_WF8B_BPCLCD2_MASK                    0x4u
#define LCD_WF8B_BPCLCD2_SHIFT                   2
#define LCD_WF8B_BPCLCD2_WIDTH                   1
#define LCD_WF8B_BPCLCD2(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD2_SHIFT))&LCD_WF8B_BPCLCD2_MASK)
#define LCD_WF8B_BPCLCD23_MASK                   0x4u
#define LCD_WF8B_BPCLCD23_SHIFT                  2
#define LCD_WF8B_BPCLCD23_WIDTH                  1
#define LCD_WF8B_BPCLCD23(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD23_SHIFT))&LCD_WF8B_BPCLCD23_MASK)
#define LCD_WF8B_BPCLCD48_MASK                   0x4u
#define LCD_WF8B_BPCLCD48_SHIFT                  2
#define LCD_WF8B_BPCLCD48_WIDTH                  1
#define LCD_WF8B_BPCLCD48(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD48_SHIFT))&LCD_WF8B_BPCLCD48_MASK)
#define LCD_WF8B_BPCLCD24_MASK                   0x4u
#define LCD_WF8B_BPCLCD24_SHIFT                  2
#define LCD_WF8B_BPCLCD24_WIDTH                  1
#define LCD_WF8B_BPCLCD24(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD24_SHIFT))&LCD_WF8B_BPCLCD24_MASK)
#define LCD_WF8B_BPCLCD60_MASK                   0x4u
#define LCD_WF8B_BPCLCD60_SHIFT                  2
#define LCD_WF8B_BPCLCD60_WIDTH                  1
#define LCD_WF8B_BPCLCD60(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD60_SHIFT))&LCD_WF8B_BPCLCD60_MASK)
#define LCD_WF8B_BPCLCD47_MASK                   0x4u
#define LCD_WF8B_BPCLCD47_SHIFT                  2
#define LCD_WF8B_BPCLCD47_WIDTH                  1
#define LCD_WF8B_BPCLCD47(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD47_SHIFT))&LCD_WF8B_BPCLCD47_MASK)
#define LCD_WF8B_BPCLCD22_MASK                   0x4u
#define LCD_WF8B_BPCLCD22_SHIFT                  2
#define LCD_WF8B_BPCLCD22_WIDTH                  1
#define LCD_WF8B_BPCLCD22(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD22_SHIFT))&LCD_WF8B_BPCLCD22_MASK)
#define LCD_WF8B_BPCLCD8_MASK                    0x4u
#define LCD_WF8B_BPCLCD8_SHIFT                   2
#define LCD_WF8B_BPCLCD8_WIDTH                   1
#define LCD_WF8B_BPCLCD8(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD8_SHIFT))&LCD_WF8B_BPCLCD8_MASK)
#define LCD_WF8B_BPCLCD21_MASK                   0x4u
#define LCD_WF8B_BPCLCD21_SHIFT                  2
#define LCD_WF8B_BPCLCD21_WIDTH                  1
#define LCD_WF8B_BPCLCD21(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD21_SHIFT))&LCD_WF8B_BPCLCD21_MASK)
#define LCD_WF8B_BPCLCD49_MASK                   0x4u
#define LCD_WF8B_BPCLCD49_SHIFT                  2
#define LCD_WF8B_BPCLCD49_WIDTH                  1
#define LCD_WF8B_BPCLCD49(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD49_SHIFT))&LCD_WF8B_BPCLCD49_MASK)
#define LCD_WF8B_BPCLCD25_MASK                   0x4u
#define LCD_WF8B_BPCLCD25_SHIFT                  2
#define LCD_WF8B_BPCLCD25_WIDTH                  1
#define LCD_WF8B_BPCLCD25(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD25_SHIFT))&LCD_WF8B_BPCLCD25_MASK)
#define LCD_WF8B_BPCLCD1_MASK                    0x4u
#define LCD_WF8B_BPCLCD1_SHIFT                   2
#define LCD_WF8B_BPCLCD1_WIDTH                   1
#define LCD_WF8B_BPCLCD1(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD1_SHIFT))&LCD_WF8B_BPCLCD1_MASK)
#define LCD_WF8B_BPCLCD20_MASK                   0x4u
#define LCD_WF8B_BPCLCD20_SHIFT                  2
#define LCD_WF8B_BPCLCD20_WIDTH                  1
#define LCD_WF8B_BPCLCD20(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD20_SHIFT))&LCD_WF8B_BPCLCD20_MASK)
#define LCD_WF8B_BPCLCD50_MASK                   0x4u
#define LCD_WF8B_BPCLCD50_SHIFT                  2
#define LCD_WF8B_BPCLCD50_WIDTH                  1
#define LCD_WF8B_BPCLCD50(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD50_SHIFT))&LCD_WF8B_BPCLCD50_MASK)
#define LCD_WF8B_BPCLCD19_MASK                   0x4u
#define LCD_WF8B_BPCLCD19_SHIFT                  2
#define LCD_WF8B_BPCLCD19_WIDTH                  1
#define LCD_WF8B_BPCLCD19(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD19_SHIFT))&LCD_WF8B_BPCLCD19_MASK)
#define LCD_WF8B_BPCLCD26_MASK                   0x4u
#define LCD_WF8B_BPCLCD26_SHIFT                  2
#define LCD_WF8B_BPCLCD26_WIDTH                  1
