RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
/* MMAU - Register accessors */
#define MMAU_X0_REG(base)                        ((base)->X0)
#define MMAU_X1_REG(base)                        ((base)->X1)
#define MMAU_X2_REG(base)                        ((base)->X2)
#define MMAU_X3_REG(base)                        ((base)->X3)
#define MMAU_A0_REG(base)                        ((base)->A0)
#define MMAU_A1_REG(base)                        ((base)->A1)
#define MMAU_CSR_REG(base)                       ((base)->CSR)
#define MMAU_CSR_IF_CLR_REG(base)                ((base)->CSR_IF_CLR)

/*!
 * @}
 */ /* end of group MMAU_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- MMAU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MMAU_Register_Masks MMAU Register Masks
 * @{
 */

/* X0 Bit Fields */
#define MMAU_X0_X0_MASK                          0xFFFFFFFFu
#define MMAU_X0_X0_SHIFT                         0
#define MMAU_X0_X0_WIDTH                         32
#define MMAU_X0_X0(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_X0_X0_SHIFT))&MMAU_X0_X0_MASK)
/* X1 Bit Fields */
#define MMAU_X1_X1_MASK                          0xFFFFFFFFu
#define MMAU_X1_X1_SHIFT                         0
#define MMAU_X1_X1_WIDTH                         32
#define MMAU_X1_X1(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_X1_X1_SHIFT))&MMAU_X1_X1_MASK)
/* X2 Bit Fields */
#define MMAU_X2_X2_MASK                          0xFFFFFFFFu
#define MMAU_X2_X2_SHIFT                         0
#define MMAU_X2_X2_WIDTH                         32
#define MMAU_X2_X2(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_X2_X2_SHIFT))&MMAU_X2_X2_MASK)
/* X3 Bit Fields */
#define MMAU_X3_X3_MASK                          0xFFFFFFFFu
#define MMAU_X3_X3_SHIFT                         0
#define MMAU_X3_X3_WIDTH                         32
#define MMAU_X3_X3(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_X3_X3_SHIFT))&MMAU_X3_X3_MASK)
/* A0 Bit Fields */
#define MMAU_A0_A0_MASK                          0xFFFFFFFFu
#define MMAU_A0_A0_SHIFT                         0
#define MMAU_A0_A0_WIDTH                         32
#define MMAU_A0_A0(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_A0_A0_SHIFT))&MMAU_A0_A0_MASK)
/* A1 Bit Fields */
#define MMAU_A1_A1_MASK                          0xFFFFFFFFu
#define MMAU_A1_A1_SHIFT                         0
#define MMAU_A1_A1_WIDTH                         32
#define MMAU_A1_A1(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_A1_A1_SHIFT))&MMAU_A1_A1_MASK)
/* CSR Bit Fields */
#define MMAU_CSR_Q_MASK                          0x1u
#define MMAU_CSR_Q_SHIFT                         0
#define MMAU_CSR_Q_WIDTH                         1
#define MMAU_CSR_Q(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_Q_SHIFT))&MMAU_CSR_Q_MASK)
#define MMAU_CSR_V_MASK                          0x2u
#define MMAU_CSR_V_SHIFT                         1
#define MMAU_CSR_V_WIDTH                         1
#define MMAU_CSR_V(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_V_SHIFT))&MMAU_CSR_V_MASK)
#define MMAU_CSR_DZ_MASK                         0x4u
#define MMAU_CSR_DZ_SHIFT                        2
#define MMAU_CSR_DZ_WIDTH                        1
#define MMAU_CSR_DZ(x)                           (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_DZ_SHIFT))&MMAU_CSR_DZ_MASK)
#define MMAU_CSR_N_MASK                          0x8u
#define MMAU_CSR_N_SHIFT                         3
#define MMAU_CSR_N_WIDTH                         1
#define MMAU_CSR_N(x)                            (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_N_SHIFT))&MMAU_CSR_N_MASK)
#define MMAU_CSR_QIF_MASK                        0x10u
#define MMAU_CSR_QIF_SHIFT                       4
#define MMAU_CSR_QIF_WIDTH                       1
#define MMAU_CSR_QIF(x)                          (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_QIF_SHIFT))&MMAU_CSR_QIF_MASK)
#define MMAU_CSR_VIF_MASK                        0x20u
#define MMAU_CSR_VIF_SHIFT                       5
#define MMAU_CSR_VIF_WIDTH                       1
#define MMAU_CSR_VIF(x)                          (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_VIF_SHIFT))&MMAU_CSR_VIF_MASK)
#define MMAU_CSR_DZIF_MASK                       0x40u
#define MMAU_CSR_DZIF_SHIFT                      6
#define MMAU_CSR_DZIF_WIDTH                      1
#define MMAU_CSR_DZIF(x)                         (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_DZIF_SHIFT))&MMAU_CSR_DZIF_MASK)
#define MMAU_CSR_QIE_MASK                        0x1000u
#define MMAU_CSR_QIE_SHIFT                       12
#define MMAU_CSR_QIE_WIDTH                       1
#define MMAU_CSR_QIE(x)                          (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_QIE_SHIFT))&MMAU_CSR_QIE_MASK)
#define MMAU_CSR_VIE_MASK                        0x2000u
#define MMAU_CSR_VIE_SHIFT                       13
#define MMAU_CSR_VIE_WIDTH                       1
#define MMAU_CSR_VIE(x)                          (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_VIE_SHIFT))&MMAU_CSR_VIE_MASK)
#define MMAU_CSR_DZIE_MASK                       0x4000u
#define MMAU_CSR_DZIE_SHIFT                      14
#define MMAU_CSR_DZIE_WIDTH                      1
#define MMAU_CSR_DZIE(x)                         (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_DZIE_SHIFT))&MMAU_CSR_DZIE_MASK)
#define MMAU_CSR_DRE_MASK                        0x10000u
#define MMAU_CSR_DRE_SHIFT                       16
#define MMAU_CSR_DRE_WIDTH                       1
#define MMAU_CSR_DRE(x)                          (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_DRE_SHIFT))&MMAU_CSR_DRE_MASK)
#define MMAU_CSR_SO_MASK                         0x20000u
#define MMAU_CSR_SO_SHIFT                        17
#define MMAU_CSR_SO_WIDTH                        1
#define MMAU_CSR_SO(x)                           (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_SO_SHIFT))&MMAU_CSR_SO_MASK)
#define MMAU_CSR_HDR_MASK                        0xF00000u
#define MMAU_CSR_HDR_SHIFT                       20
#define MMAU_CSR_HDR_WIDTH                       4
#define MMAU_CSR_HDR(x)                          (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_HDR_SHIFT))&MMAU_CSR_HDR_MASK)
#define MMAU_CSR_BUSY_MASK                       0x80000000u
#define MMAU_CSR_BUSY_SHIFT                      31
#define MMAU_CSR_BUSY_WIDTH                      1
#define MMAU_CSR_BUSY(x)                         (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_BUSY_SHIFT))&MMAU_CSR_BUSY_MASK)
/* CSR_IF_CLR Bit Fields */
#define MMAU_CSR_IF_CLR_Q_MASK                   0x1u
#define MMAU_CSR_IF_CLR_Q_SHIFT                  0
#define MMAU_CSR_IF_CLR_Q_WIDTH                  1
#define MMAU_CSR_IF_CLR_Q(x)                     (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_IF_CLR_Q_SHIFT))&MMAU_CSR_IF_CLR_Q_MASK)
#define MMAU_CSR_IF_CLR_V_MASK                   0x2u
#define MMAU_CSR_IF_CLR_V_SHIFT                  1
#define MMAU_CSR_IF_CLR_V_WIDTH                  1
#define MMAU_CSR_IF_CLR_V(x)                     (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_IF_CLR_V_SHIFT))&MMAU_CSR_IF_CLR_V_MASK)
#define MMAU_CSR_IF_CLR_DZ_MASK                  0x4u
#define MMAU_CSR_IF_CLR_DZ_SHIFT                 2
#define MMAU_CSR_IF_CLR_DZ_WIDTH                 1
#define MMAU_CSR_IF_CLR_DZ(x)                    (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_IF_CLR_DZ_SHIFT))&MMAU_CSR_IF_CLR_DZ_MASK)
#define MMAU_CSR_IF_CLR_N_MASK                   0x8u
#define MMAU_CSR_IF_CLR_N_SHIFT                  3
#define MMAU_CSR_IF_CLR_N_WIDTH                  1
#define MMAU_CSR_IF_CLR_N(x)                     (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_IF_CLR_N_SHIFT))&MMAU_CSR_IF_CLR_N_MASK)
#define MMAU_CSR_IF_CLR_QIF_MASK                 0x10u
#define MMAU_CSR_IF_CLR_QIF_SHIFT                4
#define MMAU_CSR_IF_CLR_QIF_WIDTH                1
#define MMAU_CSR_IF_CLR_QIF(x)                   (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_IF_CLR_QIF_SHIFT))&MMAU_CSR_IF_CLR_QIF_MASK)
#define MMAU_CSR_IF_CLR_VIF_MASK                 0x20u
#define MMAU_CSR_IF_CLR_VIF_SHIFT                5
#define MMAU_CSR_IF_CLR_VIF_WIDTH                1
#define MMAU_CSR_IF_CLR_VIF(x)                   (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_IF_CLR_VIF_SHIFT))&MMAU_CSR_IF_CLR_VIF_MASK)
#define MMAU_CSR_IF_CLR_DZIF_MASK                0x40u
#define MMAU_CSR_IF_CLR_DZIF_SHIFT               6
#define MMAU_CSR_IF_CLR_DZIF_WIDTH               1
#define MMAU_CSR_IF_CLR_DZIF(x)                  (((uint32_t)(((uint32_t)(x))<<MMAU_CSR_IF_CLR_DZIF_SHIFT))&MMAU_CSR_IF_CLR_DZIF_MASK)

/*!
 * @}
 */ /* end of group MMAU_Register_Masks */


/* MMAU - Peripheral instance base addresses */
/** Peripheral MMAU base address */
#define MMAU_BASE                                (0xF0004000u)
/** Peripheral MMAU base pointer */
#define MMAU                                     ((MMAU_Type *)MMAU_BASE)
#define MMAU_BASE_PTR                            (MMAU)
/** Array initializer of MMAU peripheral base addresses */
#define MMAU_BASE_ADDRS                          { MMAU_BASE }
/** Array initializer of MMAU peripheral base pointers */
#define MMAU_BASE_PTRS                           { MMAU }
/** Interrupt vectors for the MMAU peripheral type */
#define MMAU_IRQS                                { MMAU_IRQn }

/* ----------------------------------------------------------------------------
   -- MMAU - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MMAU_Register_Accessor_Macros MMAU - Register accessor macros
 * @{
 */


