RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
/* PORT - Peripheral instance base addresses */
/** Peripheral PORTA base address */
#define PORTA_BASE                               (0x40046000u)
/** Peripheral PORTA base pointer */
#define PORTA                                    ((PORT_Type *)PORTA_BASE)
#define PORTA_BASE_PTR                           (PORTA)
/** Peripheral PORTB base address */
#define PORTB_BASE                               (0x40047000u)
/** Peripheral PORTB base pointer */
#define PORTB                                    ((PORT_Type *)PORTB_BASE)
#define PORTB_BASE_PTR                           (PORTB)
/** Peripheral PORTC base address */
#define PORTC_BASE                               (0x40048000u)
/** Peripheral PORTC base pointer */
#define PORTC                                    ((PORT_Type *)PORTC_BASE)
#define PORTC_BASE_PTR                           (PORTC)
/** Peripheral PORTD base address */
#define PORTD_BASE                               (0x40049000u)
/** Peripheral PORTD base pointer */
#define PORTD                                    ((PORT_Type *)PORTD_BASE)
#define PORTD_BASE_PTR                           (PORTD)
/** Peripheral PORTE base address */
#define PORTE_BASE                               (0x4004A000u)
/** Peripheral PORTE base pointer */
#define PORTE                                    ((PORT_Type *)PORTE_BASE)
#define PORTE_BASE_PTR                           (PORTE)
/** Peripheral PORTF base address */
#define PORTF_BASE                               (0x4004B000u)
/** Peripheral PORTF base pointer */
#define PORTF                                    ((PORT_Type *)PORTF_BASE)
#define PORTF_BASE_PTR                           (PORTF)
/** Peripheral PORTG base address */
#define PORTG_BASE                               (0x4004C000u)
/** Peripheral PORTG base pointer */
#define PORTG                                    ((PORT_Type *)PORTG_BASE)
#define PORTG_BASE_PTR                           (PORTG)
/** Peripheral PORTH base address */
#define PORTH_BASE                               (0x4004D000u)
/** Peripheral PORTH base pointer */
#define PORTH                                    ((PORT_Type *)PORTH_BASE)
#define PORTH_BASE_PTR                           (PORTH)
/** Peripheral PORTI base address */
#define PORTI_BASE                               (0x4004E000u)
/** Peripheral PORTI base pointer */
#define PORTI                                    ((PORT_Type *)PORTI_BASE)
#define PORTI_BASE_PTR                           (PORTI)
/** Peripheral PORTJ base address */
#define PORTJ_BASE                               (0x40037000u)
/** Peripheral PORTJ base pointer */
#define PORTJ                                    ((PORT_Type *)PORTJ_BASE)
#define PORTJ_BASE_PTR                           (PORTJ)
/** Peripheral PORTK base address */
#define PORTK_BASE                               (0x40038000u)
/** Peripheral PORTK base pointer */
#define PORTK                                    ((PORT_Type *)PORTK_BASE)
#define PORTK_BASE_PTR                           (PORTK)
/** Peripheral PORTL base address */
#define PORTL_BASE                               (0x40039000u)
/** Peripheral PORTL base pointer */
#define PORTL                                    ((PORT_Type *)PORTL_BASE)
#define PORTL_BASE_PTR                           (PORTL)
/** Peripheral PORTM base address */
#define PORTM_BASE                               (0x4003A000u)
/** Peripheral PORTM base pointer */
#define PORTM                                    ((PORT_Type *)PORTM_BASE)
#define PORTM_BASE_PTR                           (PORTM)
/** Array initializer of PORT peripheral base addresses */
#define PORT_BASE_ADDRS                          { PORTA_BASE, PORTB_BASE, PORTC_BASE, PORTD_BASE, PORTE_BASE, PORTF_BASE, PORTG_BASE, PORTH_BASE, PORTI_BASE, PORTJ_BASE, PORTK_BASE, PORTL_BASE, PORTM_BASE }
/** Array initializer of PORT peripheral base pointers */
#define PORT_BASE_PTRS                           { PORTA, PORTB, PORTC, PORTD, PORTE, PORTF, PORTG, PORTH, PORTI, PORTJ, PORTK, PORTL, PORTM }
/** Interrupt vectors for the PORT peripheral type */
#define PORT_IRQS                                { PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn, PTx_IRQn }

/* ----------------------------------------------------------------------------
   -- PORT - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PORT_Register_Accessor_Macros PORT - Register accessor macros
 * @{
 */


/* PORT - Register instance definitions */
/* PORTA */
#define PORTA_PCR0                               PORT_PCR_REG(PORTA,0)
#define PORTA_PCR1                               PORT_PCR_REG(PORTA,1)
#define PORTA_PCR2                               PORT_PCR_REG(PORTA,2)
#define PORTA_PCR3                               PORT_PCR_REG(PORTA,3)
#define PORTA_PCR4                               PORT_PCR_REG(PORTA,4)
#define PORTA_PCR5                               PORT_PCR_REG(PORTA,5)
#define PORTA_PCR6                               PORT_PCR_REG(PORTA,6)
#define PORTA_PCR7                               PORT_PCR_REG(PORTA,7)
#define PORTA_GPCLR                              PORT_GPCLR_REG(PORTA)
#define PORTA_GPCHR                              PORT_GPCHR_REG(PORTA)
#define PORTA_ISFR                               PORT_ISFR_REG(PORTA)
/* PORTB */
#define PORTB_PCR0                               PORT_PCR_REG(PORTB,0)
#define PORTB_PCR1                               PORT_PCR_REG(PORTB,1)
#define PORTB_PCR2                               PORT_PCR_REG(PORTB,2)
#define PORTB_PCR3                               PORT_PCR_REG(PORTB,3)
#define PORTB_PCR4                               PORT_PCR_REG(PORTB,4)
#define PORTB_PCR5                               PORT_PCR_REG(PORTB,5)
#define PORTB_PCR6                               PORT_PCR_REG(PORTB,6)
#define PORTB_PCR7                               PORT_PCR_REG(PORTB,7)
#define PORTB_GPCLR                              PORT_GPCLR_REG(PORTB)
#define PORTB_GPCHR                              PORT_GPCHR_REG(PORTB)
#define PORTB_ISFR                               PORT_ISFR_REG(PORTB)
/* PORTC */
#define PORTC_PCR0                               PORT_PCR_REG(PORTC,0)
#define PORTC_PCR1                               PORT_PCR_REG(PORTC,1)
#define PORTC_PCR2                               PORT_PCR_REG(PORTC,2)
#define PORTC_PCR3                               PORT_PCR_REG(PORTC,3)
#define PORTC_PCR4                               PORT_PCR_REG(PORTC,4)
#define PORTC_PCR5                               PORT_PCR_REG(PORTC,5)
#define PORTC_PCR6                               PORT_PCR_REG(PORTC,6)
#define PORTC_PCR7                               PORT_PCR_REG(PORTC,7)
#define PORTC_GPCLR                              PORT_GPCLR_REG(PORTC)
#define PORTC_GPCHR                              PORT_GPCHR_REG(PORTC)
#define PORTC_ISFR                               PORT_ISFR_REG(PORTC)
/* PORTD */
#define PORTD_PCR0                               PORT_PCR_REG(PORTD,0)
#define PORTD_PCR1                               PORT_PCR_REG(PORTD,1)
#define PORTD_PCR2                               PORT_PCR_REG(PORTD,2)
#define PORTD_PCR3                               PORT_PCR_REG(PORTD,3)
#define PORTD_PCR4                               PORT_PCR_REG(PORTD,4)
#define PORTD_PCR5                               PORT_PCR_REG(PORTD,5)
#define PORTD_PCR6                               PORT_PCR_REG(PORTD,6)
#define PORTD_PCR7                               PORT_PCR_REG(PORTD,7)
#define PORTD_GPCLR                              PORT_GPCLR_REG(PORTD)
#define PORTD_GPCHR                              PORT_GPCHR_REG(PORTD)
#define PORTD_ISFR                               PORT_ISFR_REG(PORTD)
/* PORTE */
#define PORTE_PCR0                               PORT_PCR_REG(PORTE,0)
#define PORTE_PCR1                               PORT_PCR_REG(PORTE,1)
#define PORTE_PCR2                               PORT_PCR_REG(PORTE,2)
#define PORTE_PCR3                               PORT_PCR_REG(PORTE,3)
#define PORTE_PCR4                               PORT_PCR_REG(PORTE,4)
#define PORTE_PCR5                               PORT_PCR_REG(PORTE,5)
#define PORTE_PCR6                               PORT_PCR_REG(PORTE,6)
#define PORTE_PCR7                               PORT_PCR_REG(PORTE,7)
#define PORTE_GPCLR                              PORT_GPCLR_REG(PORTE)
#define PORTE_GPCHR                              PORT_GPCHR_REG(PORTE)
#define PORTE_ISFR                               PORT_ISFR_REG(PORTE)
#define PORTE_DFER                               PORT_DFER_REG(PORTE)
#define PORTE_DFCR                               PORT_DFCR_REG(PORTE)
#define PORTE_DFWR                               PORT_DFWR_REG(PORTE)
/* PORTF */
#define PORTF_PCR0                               PORT_PCR_REG(PORTF,0)
#define PORTF_PCR1                               PORT_PCR_REG(PORTF,1)
#define PORTF_PCR2                               PORT_PCR_REG(PORTF,2)
#define PORTF_PCR3                               PORT_PCR_REG(PORTF,3)
#define PORTF_PCR4                               PORT_PCR_REG(PORTF,4)
#define PORTF_PCR5                               PORT_PCR_REG(PORTF,5)
#define PORTF_PCR6                               PORT_PCR_REG(PORTF,6)
#define PORTF_PCR7                               PORT_PCR_REG(PORTF,7)
#define PORTF_GPCLR                              PORT_GPCLR_REG(PORTF)
#define PORTF_GPCHR                              PORT_GPCHR_REG(PORTF)
#define PORTF_ISFR                               PORT_ISFR_REG(PORTF)
/* PORTG */
#define PORTG_PCR0                               PORT_PCR_REG(PORTG,0)
#define PORTG_PCR1                               PORT_PCR_REG(PORTG,1)
#define PORTG_PCR2                               PORT_PCR_REG(PORTG,2)
#define PORTG_PCR3                               PORT_PCR_REG(PORTG,3)
#define PORTG_PCR4                               PORT_PCR_REG(PORTG,4)
#define PORTG_PCR5                               PORT_PCR_REG(PORTG,5)
#define PORTG_PCR6                               PORT_PCR_REG(PORTG,6)
#define PORTG_PCR7                               PORT_PCR_REG(PORTG,7)
#define PORTG_GPCLR                              PORT_GPCLR_REG(PORTG)
#define PORTG_GPCHR                              PORT_GPCHR_REG(PORTG)
#define PORTG_ISFR                               PORT_ISFR_REG(PORTG)
/* PORTH */
#define PORTH_PCR0                               PORT_PCR_REG(PORTH,0)
#define PORTH_PCR1                               PORT_PCR_REG(PORTH,1)
#define PORTH_PCR2                               PORT_PCR_REG(PORTH,2)
#define PORTH_PCR3                               PORT_PCR_REG(PORTH,3)
#define PORTH_PCR4                               PORT_PCR_REG(PORTH,4)
#define PORTH_PCR5                               PORT_PCR_REG(PORTH,5)
#define PORTH_PCR6                               PORT_PCR_REG(PORTH,6)
#define PORTH_PCR7                               PORT_PCR_REG(PORTH,7)
#define PORTH_GPCLR                              PORT_GPCLR_REG(PORTH)
#define PORTH_GPCHR                              PORT_GPCHR_REG(PORTH)
#define PORTH_ISFR                               PORT_ISFR_REG(PORTH)
/* PORTI */
#define PORTI_PCR0                               PORT_PCR_REG(PORTI,0)
#define PORTI_PCR1                               PORT_PCR_REG(PORTI,1)
#define PORTI_PCR2                               PORT_PCR_REG(PORTI,2)
#define PORTI_PCR3                               PORT_PCR_REG(PORTI,3)
#define PORTI_PCR4                               PORT_PCR_REG(PORTI,4)
#define PORTI_PCR5                               PORT_PCR_REG(PORTI,5)
#define PORTI_PCR6                               PORT_PCR_REG(PORTI,6)
#define PORTI_PCR7                               PORT_PCR_REG(PORTI,7)
#define PORTI_GPCLR                              PORT_GPCLR_REG(PORTI)
#define PORTI_GPCHR                              PORT_GPCHR_REG(PORTI)
#define PORTI_ISFR                               PORT_ISFR_REG(PORTI)
/* PORTJ */
#define PORTJ_PCR0                               PORT_PCR_REG(PORTJ,0)
#define PORTJ_PCR1                               PORT_PCR_REG(PORTJ,1)
#define PORTJ_PCR2                               PORT_PCR_REG(PORTJ,2)
#define PORTJ_PCR3                               PORT_PCR_REG(PORTJ,3)
#define PORTJ_PCR4                               PORT_PCR_REG(PORTJ,4)
#define PORTJ_PCR5                               PORT_PCR_REG(PORTJ,5)
#define PORTJ_PCR6                               PORT_PCR_REG(PORTJ,6)
#define PORTJ_PCR7                               PORT_PCR_REG(PORTJ,7)
#define PORTJ_GPCLR                              PORT_GPCLR_REG(PORTJ)
#define PORTJ_GPCHR                              PORT_GPCHR_REG(PORTJ)
#define PORTJ_ISFR                               PORT_ISFR_REG(PORTJ)
/* PORTK */
#define PORTK_PCR0                               PORT_PCR_REG(PORTK,0)
#define PORTK_PCR1                               PORT_PCR_REG(PORTK,1)
#define PORTK_PCR2                               PORT_PCR_REG(PORTK,2)
#define PORTK_PCR3                               PORT_PCR_REG(PORTK,3)
#define PORTK_PCR4                               PORT_PCR_REG(PORTK,4)
#define PORTK_PCR5                               PORT_PCR_REG(PORTK,5)
#define PORTK_PCR6                               PORT_PCR_REG(PORTK,6)
#define PORTK_PCR7                               PORT_PCR_REG(PORTK,7)
#define PORTK_GPCLR                              PORT_GPCLR_REG(PORTK)
#define PORTK_GPCHR                              PORT_GPCHR_REG(PORTK)
#define PORTK_ISFR                               PORT_ISFR_REG(PORTK)
/* PORTL */
#define PORTL_PCR0                               PORT_PCR_REG(PORTL,0)
#define PORTL_PCR1                               PORT_PCR_REG(PORTL,1)
#define PORTL_PCR2                               PORT_PCR_REG(PORTL,2)
#define PORTL_PCR3                               PORT_PCR_REG(PORTL,3)
#define PORTL_PCR4                               PORT_PCR_REG(PORTL,4)
#define PORTL_PCR5                               PORT_PCR_REG(PORTL,5)
#define PORTL_PCR6                               PORT_PCR_REG(PORTL,6)
#define PORTL_PCR7                               PORT_PCR_REG(PORTL,7)
#define PORTL_GPCLR                              PORT_GPCLR_REG(PORTL)
#define PORTL_GPCHR                              PORT_GPCHR_REG(PORTL)
#define PORTL_ISFR                               PORT_ISFR_REG(PORTL)
/* PORTM */
#define PORTM_PCR0                               PORT_PCR_REG(PORTM,0)
#define PORTM_PCR1                               PORT_PCR_REG(PORTM,1)
#define PORTM_PCR2                               PORT_PCR_REG(PORTM,2)
#define PORTM_PCR3                               PORT_PCR_REG(PORTM,3)
#define PORTM_PCR4                               PORT_PCR_REG(PORTM,4)
#define PORTM_PCR5                               PORT_PCR_REG(PORTM,5)
#define PORTM_PCR6                               PORT_PCR_REG(PORTM,6)
#define PORTM_PCR7                               PORT_PCR_REG(PORTM,7)
#define PORTM_GPCLR                              PORT_GPCLR_REG(PORTM)
#define PORTM_GPCHR                              PORT_GPCHR_REG(PORTM)
#define PORTM_ISFR                               PORT_ISFR_REG(PORTM)

