RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
/* SOPT1 Bit Fields */
#define SIM_SOPT1_SRAMSIZE_MASK                  0xF000u
#define SIM_SOPT1_SRAMSIZE_SHIFT                 12
#define SIM_SOPT1_SRAMSIZE_WIDTH                 4
#define SIM_SOPT1_SRAMSIZE(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_SRAMSIZE_SHIFT))&SIM_SOPT1_SRAMSIZE_MASK)
#define SIM_SOPT1_OSC32KSEL_MASK                 0xC0000u
#define SIM_SOPT1_OSC32KSEL_SHIFT                18
#define SIM_SOPT1_OSC32KSEL_WIDTH                2
#define SIM_SOPT1_OSC32KSEL(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_OSC32KSEL_SHIFT))&SIM_SOPT1_OSC32KSEL_MASK)
/* SOPT1_CFG Bit Fields */
#define SIM_SOPT1_CFG_LPTMR0SEL_MASK             0x3u
#define SIM_SOPT1_CFG_LPTMR0SEL_SHIFT            0
#define SIM_SOPT1_CFG_LPTMR0SEL_WIDTH            2
#define SIM_SOPT1_CFG_LPTMR0SEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_LPTMR0SEL_SHIFT))&SIM_SOPT1_CFG_LPTMR0SEL_MASK)
#define SIM_SOPT1_CFG_LPTMR1SEL_MASK             0xCu
#define SIM_SOPT1_CFG_LPTMR1SEL_SHIFT            2
#define SIM_SOPT1_CFG_LPTMR1SEL_WIDTH            2
#define SIM_SOPT1_CFG_LPTMR1SEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_LPTMR1SEL_SHIFT))&SIM_SOPT1_CFG_LPTMR1SEL_MASK)
#define SIM_SOPT1_CFG_LPTMR2SEL_MASK             0x30u
#define SIM_SOPT1_CFG_LPTMR2SEL_SHIFT            4
#define SIM_SOPT1_CFG_LPTMR2SEL_WIDTH            2
#define SIM_SOPT1_CFG_LPTMR2SEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_LPTMR2SEL_SHIFT))&SIM_SOPT1_CFG_LPTMR2SEL_MASK)
#define SIM_SOPT1_CFG_LPTMR3SEL_MASK             0xC0u
#define SIM_SOPT1_CFG_LPTMR3SEL_SHIFT            6
#define SIM_SOPT1_CFG_LPTMR3SEL_WIDTH            2
#define SIM_SOPT1_CFG_LPTMR3SEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_LPTMR3SEL_SHIFT))&SIM_SOPT1_CFG_LPTMR3SEL_MASK)
#define SIM_SOPT1_CFG_RAMSBDIS_MASK              0x100u
#define SIM_SOPT1_CFG_RAMSBDIS_SHIFT             8
#define SIM_SOPT1_CFG_RAMSBDIS_WIDTH             1
#define SIM_SOPT1_CFG_RAMSBDIS(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_RAMSBDIS_SHIFT))&SIM_SOPT1_CFG_RAMSBDIS_MASK)
#define SIM_SOPT1_CFG_RAMBPEN_MASK               0x200u
#define SIM_SOPT1_CFG_RAMBPEN_SHIFT              9
#define SIM_SOPT1_CFG_RAMBPEN_WIDTH              1
#define SIM_SOPT1_CFG_RAMBPEN(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_RAMBPEN_SHIFT))&SIM_SOPT1_CFG_RAMBPEN_MASK)
/* CTRL_REG Bit Fields */
#define SIM_CTRL_REG_NMIDIS_MASK                 0x1u
#define SIM_CTRL_REG_NMIDIS_SHIFT                0
#define SIM_CTRL_REG_NMIDIS_WIDTH                1
#define SIM_CTRL_REG_NMIDIS(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_NMIDIS_SHIFT))&SIM_CTRL_REG_NMIDIS_MASK)
#define SIM_CTRL_REG_PLLVLPEN_MASK               0x2u
#define SIM_CTRL_REG_PLLVLPEN_SHIFT              1
#define SIM_CTRL_REG_PLLVLPEN_WIDTH              1
#define SIM_CTRL_REG_PLLVLPEN(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_PLLVLPEN_SHIFT))&SIM_CTRL_REG_PLLVLPEN_MASK)
#define SIM_CTRL_REG_ADCTRGSEL_MASK              0x18u
#define SIM_CTRL_REG_ADCTRGSEL_SHIFT             3
#define SIM_CTRL_REG_ADCTRGSEL_WIDTH             2
#define SIM_CTRL_REG_ADCTRGSEL(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_ADCTRGSEL_SHIFT))&SIM_CTRL_REG_ADCTRGSEL_MASK)
#define SIM_CTRL_REG_CLKOUT_MASK                 0xE0u
#define SIM_CTRL_REG_CLKOUT_SHIFT                5
#define SIM_CTRL_REG_CLKOUT_WIDTH                3
#define SIM_CTRL_REG_CLKOUT(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_CLKOUT_SHIFT))&SIM_CTRL_REG_CLKOUT_MASK)
#define SIM_CTRL_REG_SPI0_INV0_MASK              0x100u
#define SIM_CTRL_REG_SPI0_INV0_SHIFT             8
#define SIM_CTRL_REG_SPI0_INV0_WIDTH             1
#define SIM_CTRL_REG_SPI0_INV0(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_SPI0_INV0_SHIFT))&SIM_CTRL_REG_SPI0_INV0_MASK)
#define SIM_CTRL_REG_SPI0_INV1_MASK              0x200u
#define SIM_CTRL_REG_SPI0_INV1_SHIFT             9
#define SIM_CTRL_REG_SPI0_INV1_WIDTH             1
#define SIM_CTRL_REG_SPI0_INV1(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_SPI0_INV1_SHIFT))&SIM_CTRL_REG_SPI0_INV1_MASK)
#define SIM_CTRL_REG_SPI0_INV2_MASK              0x400u
#define SIM_CTRL_REG_SPI0_INV2_SHIFT             10
#define SIM_CTRL_REG_SPI0_INV2_WIDTH             1
#define SIM_CTRL_REG_SPI0_INV2(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_SPI0_INV2_SHIFT))&SIM_CTRL_REG_SPI0_INV2_MASK)
#define SIM_CTRL_REG_SPI0_INV3_MASK              0x800u
#define SIM_CTRL_REG_SPI0_INV3_SHIFT             11
#define SIM_CTRL_REG_SPI0_INV3_WIDTH             1
#define SIM_CTRL_REG_SPI0_INV3(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_SPI0_INV3_SHIFT))&SIM_CTRL_REG_SPI0_INV3_MASK)
#define SIM_CTRL_REG_SPI1_INV0_MASK              0x1000u
#define SIM_CTRL_REG_SPI1_INV0_SHIFT             12
#define SIM_CTRL_REG_SPI1_INV0_WIDTH             1
#define SIM_CTRL_REG_SPI1_INV0(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_SPI1_INV0_SHIFT))&SIM_CTRL_REG_SPI1_INV0_MASK)
#define SIM_CTRL_REG_SPI1_INV1_MASK              0x2000u
#define SIM_CTRL_REG_SPI1_INV1_SHIFT             13
#define SIM_CTRL_REG_SPI1_INV1_WIDTH             1
#define SIM_CTRL_REG_SPI1_INV1(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_SPI1_INV1_SHIFT))&SIM_CTRL_REG_SPI1_INV1_MASK)
#define SIM_CTRL_REG_SPI1_INV2_MASK              0x4000u
#define SIM_CTRL_REG_SPI1_INV2_SHIFT             14
#define SIM_CTRL_REG_SPI1_INV2_WIDTH             1
#define SIM_CTRL_REG_SPI1_INV2(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_SPI1_INV2_SHIFT))&SIM_CTRL_REG_SPI1_INV2_MASK)
#define SIM_CTRL_REG_SPI1_INV3_MASK              0x8000u
#define SIM_CTRL_REG_SPI1_INV3_SHIFT             15
#define SIM_CTRL_REG_SPI1_INV3_WIDTH             1
#define SIM_CTRL_REG_SPI1_INV3(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_SPI1_INV3_SHIFT))&SIM_CTRL_REG_SPI1_INV3_MASK)
#define SIM_CTRL_REG_PLLFLLSEL_MASK              0x30000u
#define SIM_CTRL_REG_PLLFLLSEL_SHIFT             16
#define SIM_CTRL_REG_PLLFLLSEL_WIDTH             2
#define SIM_CTRL_REG_PLLFLLSEL(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_PLLFLLSEL_SHIFT))&SIM_CTRL_REG_PLLFLLSEL_MASK)
#define SIM_CTRL_REG_XBARCLKOUT_MASK             0xE00000u
#define SIM_CTRL_REG_XBARCLKOUT_SHIFT            21
#define SIM_CTRL_REG_XBARCLKOUT_WIDTH            3
#define SIM_CTRL_REG_XBARCLKOUT(x)               (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_XBARCLKOUT_SHIFT))&SIM_CTRL_REG_XBARCLKOUT_MASK)
#define SIM_CTRL_REG_AFEOUTCLKSEL_MASK           0x1000000u
#define SIM_CTRL_REG_AFEOUTCLKSEL_SHIFT          24
#define SIM_CTRL_REG_AFEOUTCLKSEL_WIDTH          1
#define SIM_CTRL_REG_AFEOUTCLKSEL(x)             (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_AFEOUTCLKSEL_SHIFT))&SIM_CTRL_REG_AFEOUTCLKSEL_MASK)
#define SIM_CTRL_REG_LPUARTSRC_MASK              0xC000000u
#define SIM_CTRL_REG_LPUARTSRC_SHIFT             26
#define SIM_CTRL_REG_LPUARTSRC_WIDTH             2
#define SIM_CTRL_REG_LPUARTSRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_LPUARTSRC_SHIFT))&SIM_CTRL_REG_LPUARTSRC_MASK)
#define SIM_CTRL_REG_TMRFREEZE_MASK              0x80000000u
#define SIM_CTRL_REG_TMRFREEZE_SHIFT             31
#define SIM_CTRL_REG_TMRFREEZE_WIDTH             1
#define SIM_CTRL_REG_TMRFREEZE(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_TMRFREEZE_SHIFT))&SIM_CTRL_REG_TMRFREEZE_MASK)
/* SDID Bit Fields */
#define SIM_SDID_PINID_MASK                      0xFu
#define SIM_SDID_PINID_SHIFT                     0
#define SIM_SDID_PINID_WIDTH                     4
#define SIM_SDID_PINID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_PINID_SHIFT))&SIM_SDID_PINID_MASK)
#define SIM_SDID_DIEID_MASK                      0xF0u
#define SIM_SDID_DIEID_SHIFT                     4
#define SIM_SDID_DIEID_WIDTH                     4
#define SIM_SDID_DIEID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_DIEID_SHIFT))&SIM_SDID_DIEID_MASK)
#define SIM_SDID_REVID_MASK                      0xF00u
#define SIM_SDID_REVID_SHIFT                     8
#define SIM_SDID_REVID_WIDTH                     4
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_REVID_SHIFT))&SIM_SDID_REVID_MASK)
#define SIM_SDID_SRAMSIZE_MASK                   0xF000u
#define SIM_SDID_SRAMSIZE_SHIFT                  12
#define SIM_SDID_SRAMSIZE_WIDTH                  4
#define SIM_SDID_SRAMSIZE(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SRAMSIZE_SHIFT))&SIM_SDID_SRAMSIZE_MASK)
#define SIM_SDID_ATTR_MASK                       0xF0000u
#define SIM_SDID_ATTR_SHIFT                      16
#define SIM_SDID_ATTR_WIDTH                      4
#define SIM_SDID_ATTR(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SDID_ATTR_SHIFT))&SIM_SDID_ATTR_MASK)
#define SIM_SDID_SERIESID_MASK                   0xF00000u
#define SIM_SDID_SERIESID_SHIFT                  20
#define SIM_SDID_SERIESID_WIDTH                  4
#define SIM_SDID_SERIESID(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SERIESID_SHIFT))&SIM_SDID_SERIESID_MASK)
#define SIM_SDID_SUBFAMID_MASK                   0xF000000u
#define SIM_SDID_SUBFAMID_SHIFT                  24
#define SIM_SDID_SUBFAMID_WIDTH                  4
#define SIM_SDID_SUBFAMID(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SUBFAMID_SHIFT))&SIM_SDID_SUBFAMID_MASK)
#define SIM_SDID_FAMID_MASK                      0xF0000000u
#define SIM_SDID_FAMID_SHIFT                     28
#define SIM_SDID_FAMID_WIDTH                     4
#define SIM_SDID_FAMID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_FAMID_SHIFT))&SIM_SDID_FAMID_MASK)
/* SCGC4 Bit Fields */
#define SIM_SCGC4_EWM_MASK                       0x2u
#define SIM_SCGC4_EWM_SHIFT                      1
#define SIM_SCGC4_EWM_WIDTH                      1
#define SIM_SCGC4_EWM(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_EWM_SHIFT))&SIM_SCGC4_EWM_MASK)
#define SIM_SCGC4_I2C0_MASK                      0x80u
#define SIM_SCGC4_I2C0_SHIFT                     7
#define SIM_SCGC4_I2C0_WIDTH                     1
#define SIM_SCGC4_I2C0(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_I2C0_SHIFT))&SIM_SCGC4_I2C0_MASK)
#define SIM_SCGC4_I2C1_MASK                      0x100u
#define SIM_SCGC4_I2C1_SHIFT                     8
#define SIM_SCGC4_I2C1_WIDTH                     1
#define SIM_SCGC4_I2C1(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_I2C1_SHIFT))&SIM_SCGC4_I2C1_MASK)
#define SIM_SCGC4_UART0_MASK                     0x400u
#define SIM_SCGC4_UART0_SHIFT                    10
#define SIM_SCGC4_UART0_WIDTH                    1
#define SIM_SCGC4_UART0(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_UART0_SHIFT))&SIM_SCGC4_UART0_MASK)
#define SIM_SCGC4_UART1_MASK                     0x800u
#define SIM_SCGC4_UART1_SHIFT                    11
#define SIM_SCGC4_UART1_WIDTH                    1
#define SIM_SCGC4_UART1(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_UART1_SHIFT))&SIM_SCGC4_UART1_MASK)
#define SIM_SCGC4_UART2_MASK                     0x1000u
#define SIM_SCGC4_UART2_SHIFT                    12
#define SIM_SCGC4_UART2_WIDTH                    1
#define SIM_SCGC4_UART2(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_UART2_SHIFT))&SIM_SCGC4_UART2_MASK)
#define SIM_SCGC4_UART3_MASK                     0x2000u
#define SIM_SCGC4_UART3_SHIFT                    13
#define SIM_SCGC4_UART3_WIDTH                    1
#define SIM_SCGC4_UART3(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_UART3_SHIFT))&SIM_SCGC4_UART3_MASK)
#define SIM_SCGC4_VREF_MASK                      0x8000u
#define SIM_SCGC4_VREF_SHIFT                     15
#define SIM_SCGC4_VREF_WIDTH                     1
#define SIM_SCGC4_VREF(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_VREF_SHIFT))&SIM_SCGC4_VREF_MASK)
#define SIM_SCGC4_CMP_MASK                       0x40000u
#define SIM_SCGC4_CMP_SHIFT                      18
#define SIM_SCGC4_CMP_WIDTH                      1
#define SIM_SCGC4_CMP(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_CMP_SHIFT))&SIM_SCGC4_CMP_MASK)
#define SIM_SCGC4_SPI0_MASK                      0x200000u
#define SIM_SCGC4_SPI0_SHIFT                     21
#define SIM_SCGC4_SPI0_WIDTH                     1
#define SIM_SCGC4_SPI0(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_SPI0_SHIFT))&SIM_SCGC4_SPI0_MASK)
#define SIM_SCGC4_SPI1_MASK                      0x400000u
#define SIM_SCGC4_SPI1_SHIFT                     22
#define SIM_SCGC4_SPI1_WIDTH                     1
#define SIM_SCGC4_SPI1(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC4_SPI1_SHIFT))&SIM_SCGC4_SPI1_MASK)
/* SCGC5 Bit Fields */
#define SIM_SCGC5_SLCD_MASK                      0x8u
#define SIM_SCGC5_SLCD_SHIFT                     3
#define SIM_SCGC5_SLCD_WIDTH                     1
#define SIM_SCGC5_SLCD(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_SLCD_SHIFT))&SIM_SCGC5_SLCD_MASK)
#define SIM_SCGC5_PORTA_MASK                     0x40u
#define SIM_SCGC5_PORTA_SHIFT                    6
#define SIM_SCGC5_PORTA_WIDTH                    1
#define SIM_SCGC5_PORTA(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTA_SHIFT))&SIM_SCGC5_PORTA_MASK)
#define SIM_SCGC5_PORTB_MASK                     0x80u
#define SIM_SCGC5_PORTB_SHIFT                    7
#define SIM_SCGC5_PORTB_WIDTH                    1
#define SIM_SCGC5_PORTB(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTB_SHIFT))&SIM_SCGC5_PORTB_MASK)
#define SIM_SCGC5_PORTC_MASK                     0x100u
#define SIM_SCGC5_PORTC_SHIFT                    8
#define SIM_SCGC5_PORTC_WIDTH                    1
#define SIM_SCGC5_PORTC(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTC_SHIFT))&SIM_SCGC5_PORTC_MASK)
#define SIM_SCGC5_PORTD_MASK                     0x200u
#define SIM_SCGC5_PORTD_SHIFT                    9
#define SIM_SCGC5_PORTD_WIDTH                    1
#define SIM_SCGC5_PORTD(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTD_SHIFT))&SIM_SCGC5_PORTD_MASK)
#define SIM_SCGC5_PORTE_MASK                     0x400u
#define SIM_SCGC5_PORTE_SHIFT                    10
#define SIM_SCGC5_PORTE_WIDTH                    1
#define SIM_SCGC5_PORTE(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTE_SHIFT))&SIM_SCGC5_PORTE_MASK)
#define SIM_SCGC5_PORTF_MASK                     0x800u
#define SIM_SCGC5_PORTF_SHIFT                    11
#define SIM_SCGC5_PORTF_WIDTH                    1
#define SIM_SCGC5_PORTF(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTF_SHIFT))&SIM_SCGC5_PORTF_MASK)
#define SIM_SCGC5_PORTG_MASK                     0x1000u
#define SIM_SCGC5_PORTG_SHIFT                    12
#define SIM_SCGC5_PORTG_WIDTH                    1
#define SIM_SCGC5_PORTG(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTG_SHIFT))&SIM_SCGC5_PORTG_MASK)
#define SIM_SCGC5_PORTH_MASK                     0x2000u
#define SIM_SCGC5_PORTH_SHIFT                    13
#define SIM_SCGC5_PORTH_WIDTH                    1
#define SIM_SCGC5_PORTH(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTH_SHIFT))&SIM_SCGC5_PORTH_MASK)
#define SIM_SCGC5_PORTI_MASK                     0x4000u
#define SIM_SCGC5_PORTI_SHIFT                    14
#define SIM_SCGC5_PORTI_WIDTH                    1
#define SIM_SCGC5_PORTI(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_PORTI_SHIFT))&SIM_SCGC5_PORTI_MASK)
#define SIM_SCGC5_RTC_MASK                       0x10000u
#define SIM_SCGC5_RTC_SHIFT                      16
#define SIM_SCGC5_RTC_WIDTH                      1
#define SIM_SCGC5_RTC(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_RTC_SHIFT))&SIM_SCGC5_RTC_MASK)
#define SIM_SCGC5_RTCREG_MASK                    0x20000u
#define SIM_SCGC5_RTCREG_SHIFT                   17
#define SIM_SCGC5_RTCREG_WIDTH                   1
#define SIM_SCGC5_RTCREG(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_RTCREG_SHIFT))&SIM_SCGC5_RTCREG_MASK)
#define SIM_SCGC5_XBAR_MASK                      0x200000u
#define SIM_SCGC5_XBAR_SHIFT                     21
#define SIM_SCGC5_XBAR_WIDTH                     1
#define SIM_SCGC5_XBAR(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_XBAR_SHIFT))&SIM_SCGC5_XBAR_MASK)
#define SIM_SCGC5_TMR0_MASK                      0x800000u
#define SIM_SCGC5_TMR0_SHIFT                     23
#define SIM_SCGC5_TMR0_WIDTH                     1
#define SIM_SCGC5_TMR0(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_TMR0_SHIFT))&SIM_SCGC5_TMR0_MASK)
#define SIM_SCGC5_TMR1_MASK                      0x1000000u
#define SIM_SCGC5_TMR1_SHIFT                     24
#define SIM_SCGC5_TMR1_WIDTH                     1
#define SIM_SCGC5_TMR1(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_TMR1_SHIFT))&SIM_SCGC5_TMR1_MASK)
#define SIM_SCGC5_TMR2_MASK                      0x2000000u
#define SIM_SCGC5_TMR2_SHIFT                     25
#define SIM_SCGC5_TMR2_WIDTH                     1
#define SIM_SCGC5_TMR2(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_TMR2_SHIFT))&SIM_SCGC5_TMR2_MASK)
#define SIM_SCGC5_TMR3_MASK                      0x4000000u
#define SIM_SCGC5_TMR3_SHIFT                     26
#define SIM_SCGC5_TMR3_WIDTH                     1
#define SIM_SCGC5_TMR3(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC5_TMR3_SHIFT))&SIM_SCGC5_TMR3_MASK)
/* SCGC6 Bit Fields */
#define SIM_SCGC6_FTFA_MASK                      0x1u
#define SIM_SCGC6_FTFA_SHIFT                     0
#define SIM_SCGC6_FTFA_WIDTH                     1
#define SIM_SCGC6_FTFA(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_FTFA_SHIFT))&SIM_SCGC6_FTFA_MASK)
#define SIM_SCGC6_DMACHMUX_MASK                  0x2u
#define SIM_SCGC6_DMACHMUX_SHIFT                 1
#define SIM_SCGC6_DMACHMUX_WIDTH                 1
#define SIM_SCGC6_DMACHMUX(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_DMACHMUX_SHIFT))&SIM_SCGC6_DMACHMUX_MASK)
#define SIM_SCGC6_RNGA_MASK                      0x200u
#define SIM_SCGC6_RNGA_SHIFT                     9
#define SIM_SCGC6_RNGA_WIDTH                     1
#define SIM_SCGC6_RNGA(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_RNGA_SHIFT))&SIM_SCGC6_RNGA_MASK)
#define SIM_SCGC6_LPUART_MASK                    0x400u
#define SIM_SCGC6_LPUART_SHIFT                   10
#define SIM_SCGC6_LPUART_WIDTH                   1
#define SIM_SCGC6_LPUART(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_LPUART_SHIFT))&SIM_SCGC6_LPUART_MASK)
#define SIM_SCGC6_ADC_MASK                       0x800u
#define SIM_SCGC6_ADC_SHIFT                      11
#define SIM_SCGC6_ADC_WIDTH                      1
#define SIM_SCGC6_ADC(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_ADC_SHIFT))&SIM_SCGC6_ADC_MASK)
#define SIM_SCGC6_PIT0_MASK                      0x2000u
#define SIM_SCGC6_PIT0_SHIFT                     13
#define SIM_SCGC6_PIT0_WIDTH                     1
#define SIM_SCGC6_PIT0(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_PIT0_SHIFT))&SIM_SCGC6_PIT0_MASK)
#define SIM_SCGC6_PIT1_MASK                      0x4000u
#define SIM_SCGC6_PIT1_SHIFT                     14
#define SIM_SCGC6_PIT1_WIDTH                     1
#define SIM_SCGC6_PIT1(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_PIT1_SHIFT))&SIM_SCGC6_PIT1_MASK)
#define SIM_SCGC6_AFE_MASK                       0x10000u
#define SIM_SCGC6_AFE_SHIFT                      16
#define SIM_SCGC6_AFE_WIDTH                      1
#define SIM_SCGC6_AFE(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_AFE_SHIFT))&SIM_SCGC6_AFE_MASK)
#define SIM_SCGC6_CRC_MASK                       0x100000u
#define SIM_SCGC6_CRC_SHIFT                      20
#define SIM_SCGC6_CRC_WIDTH                      1
#define SIM_SCGC6_CRC(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_CRC_SHIFT))&SIM_SCGC6_CRC_MASK)
#define SIM_SCGC6_PDB_MASK                       0x400000u
#define SIM_SCGC6_PDB_SHIFT                      22
#define SIM_SCGC6_PDB_WIDTH                      1
#define SIM_SCGC6_PDB(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_PDB_SHIFT))&SIM_SCGC6_PDB_MASK)
#define SIM_SCGC6_PORTJ_MASK                     0x800000u
#define SIM_SCGC6_PORTJ_SHIFT                    23
#define SIM_SCGC6_PORTJ_WIDTH                    1
#define SIM_SCGC6_PORTJ(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_PORTJ_SHIFT))&SIM_SCGC6_PORTJ_MASK)
#define SIM_SCGC6_PORTK_MASK                     0x1000000u
#define SIM_SCGC6_PORTK_SHIFT                    24
#define SIM_SCGC6_PORTK_WIDTH                    1
#define SIM_SCGC6_PORTK(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_PORTK_SHIFT))&SIM_SCGC6_PORTK_MASK)
#define SIM_SCGC6_PORTL_MASK                     0x2000000u
#define SIM_SCGC6_PORTL_SHIFT                    25
#define SIM_SCGC6_PORTL_WIDTH                    1
#define SIM_SCGC6_PORTL(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_PORTL_SHIFT))&SIM_SCGC6_PORTL_MASK)
#define SIM_SCGC6_PORTM_MASK                     0x4000000u
#define SIM_SCGC6_PORTM_SHIFT                    26
#define SIM_SCGC6_PORTM_WIDTH                    1
#define SIM_SCGC6_PORTM(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_PORTM_SHIFT))&SIM_SCGC6_PORTM_MASK)
#define SIM_SCGC6_LPTMR_MASK                     0x10000000u
#define SIM_SCGC6_LPTMR_SHIFT                    28
#define SIM_SCGC6_LPTMR_WIDTH                    1
#define SIM_SCGC6_LPTMR(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_LPTMR_SHIFT))&SIM_SCGC6_LPTMR_MASK)
/* SCGC7 Bit Fields */
#define SIM_SCGC7_MPU_MASK                       0x1u
#define SIM_SCGC7_MPU_SHIFT                      0
#define SIM_SCGC7_MPU_WIDTH                      1
#define SIM_SCGC7_MPU(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC7_MPU_SHIFT))&SIM_SCGC7_MPU_MASK)
#define SIM_SCGC7_DMA_MASK                       0x2u
#define SIM_SCGC7_DMA_SHIFT                      1
#define SIM_SCGC7_DMA_WIDTH                      1
#define SIM_SCGC7_DMA(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC7_DMA_SHIFT))&SIM_SCGC7_DMA_MASK)
#define SIM_SCGC7_CAU_MASK                       0x4u
#define SIM_SCGC7_CAU_SHIFT                      2
#define SIM_SCGC7_CAU_WIDTH                      1
#define SIM_SCGC7_CAU(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC7_CAU_SHIFT))&SIM_SCGC7_CAU_MASK)
/* CLKDIV1 Bit Fields */
#define SIM_CLKDIV1_FLASHCLKMODE_MASK            0x10000u
#define SIM_CLKDIV1_FLASHCLKMODE_SHIFT           16
#define SIM_CLKDIV1_FLASHCLKMODE_WIDTH           1
#define SIM_CLKDIV1_FLASHCLKMODE(x)              (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_FLASHCLKMODE_SHIFT))&SIM_CLKDIV1_FLASHCLKMODE_MASK)
#define SIM_CLKDIV1_CLKDIVBUS_MASK               0x3000000u
#define SIM_CLKDIV1_CLKDIVBUS_SHIFT              24
#define SIM_CLKDIV1_CLKDIVBUS_WIDTH              2
#define SIM_CLKDIV1_CLKDIVBUS(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_CLKDIVBUS_SHIFT))&SIM_CLKDIV1_CLKDIVBUS_MASK)
#define SIM_CLKDIV1_CLKDIVSYS_MASK               0xF0000000u
#define SIM_CLKDIV1_CLKDIVSYS_SHIFT              28
#define SIM_CLKDIV1_CLKDIVSYS_WIDTH              4
#define SIM_CLKDIV1_CLKDIVSYS(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_CLKDIVSYS_SHIFT))&SIM_CLKDIV1_CLKDIVSYS_MASK)
/* FCFG1 Bit Fields */
#define SIM_FCFG1_FLASHDIS_MASK                  0x1u
