RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
#define SIM_FCFG1_FLASHDIS_SHIFT                 0
#define SIM_FCFG1_FLASHDIS_WIDTH                 1
#define SIM_FCFG1_FLASHDIS(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_FLASHDIS_SHIFT))&SIM_FCFG1_FLASHDIS_MASK)
#define SIM_FCFG1_FLASHDOZE_MASK                 0x2u
#define SIM_FCFG1_FLASHDOZE_SHIFT                1
#define SIM_FCFG1_FLASHDOZE_WIDTH                1
#define SIM_FCFG1_FLASHDOZE(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_FLASHDOZE_SHIFT))&SIM_FCFG1_FLASHDOZE_MASK)
#define SIM_FCFG1_PFSIZE_MASK                    0xF000000u
#define SIM_FCFG1_PFSIZE_SHIFT                   24
#define SIM_FCFG1_PFSIZE_WIDTH                   4
#define SIM_FCFG1_PFSIZE(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_PFSIZE_SHIFT))&SIM_FCFG1_PFSIZE_MASK)
/* FCFG2 Bit Fields */
#define SIM_FCFG2_MAXADDR_MASK                   0x7F000000u
#define SIM_FCFG2_MAXADDR_SHIFT                  24
#define SIM_FCFG2_MAXADDR_WIDTH                  7
#define SIM_FCFG2_MAXADDR(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_FCFG2_MAXADDR_SHIFT))&SIM_FCFG2_MAXADDR_MASK)
/* UIDH Bit Fields */
#define SIM_UIDH_UID127_96_MASK                  0xFFFFFFFFu
#define SIM_UIDH_UID127_96_SHIFT                 0
#define SIM_UIDH_UID127_96_WIDTH                 32
#define SIM_UIDH_UID127_96(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_UIDH_UID127_96_SHIFT))&SIM_UIDH_UID127_96_MASK)
/* UIDMH Bit Fields */
#define SIM_UIDMH_UID95_64_MASK                  0xFFFFFFFFu
#define SIM_UIDMH_UID95_64_SHIFT                 0
#define SIM_UIDMH_UID95_64_WIDTH                 32
#define SIM_UIDMH_UID95_64(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_UIDMH_UID95_64_SHIFT))&SIM_UIDMH_UID95_64_MASK)
/* UIDML Bit Fields */
#define SIM_UIDML_UID63_32_MASK                  0xFFFFFFFFu
#define SIM_UIDML_UID63_32_SHIFT                 0
#define SIM_UIDML_UID63_32_WIDTH                 32
#define SIM_UIDML_UID63_32(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_UIDML_UID63_32_SHIFT))&SIM_UIDML_UID63_32_MASK)
/* UIDL Bit Fields */
#define SIM_UIDL_UID31_0_MASK                    0xFFFFFFFFu
#define SIM_UIDL_UID31_0_SHIFT                   0
#define SIM_UIDL_UID31_0_WIDTH                   32
#define SIM_UIDL_UID31_0(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_UIDL_UID31_0_SHIFT))&SIM_UIDL_UID31_0_MASK)
/* MISC_CTL Bit Fields */
#define SIM_MISC_CTL_OSCON_MASK                  0x1u
#define SIM_MISC_CTL_OSCON_SHIFT                 0
#define SIM_MISC_CTL_OSCON_WIDTH                 1
#define SIM_MISC_CTL_OSCON(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_OSCON_SHIFT))&SIM_MISC_CTL_OSCON_MASK)
#define SIM_MISC_CTL_PDBADCTRG_MASK              0x2u
#define SIM_MISC_CTL_PDBADCTRG_SHIFT             1
#define SIM_MISC_CTL_PDBADCTRG_WIDTH             1
#define SIM_MISC_CTL_PDBADCTRG(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_PDBADCTRG_SHIFT))&SIM_MISC_CTL_PDBADCTRG_MASK)
#define SIM_MISC_CTL_DMADONESEL_MASK             0xCu
#define SIM_MISC_CTL_DMADONESEL_SHIFT            2
#define SIM_MISC_CTL_DMADONESEL_WIDTH            2
#define SIM_MISC_CTL_DMADONESEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_DMADONESEL_SHIFT))&SIM_MISC_CTL_DMADONESEL_MASK)
#define SIM_MISC_CTL_AFECLKSEL_MASK              0x30u
#define SIM_MISC_CTL_AFECLKSEL_SHIFT             4
#define SIM_MISC_CTL_AFECLKSEL_WIDTH             2
#define SIM_MISC_CTL_AFECLKSEL(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_AFECLKSEL_SHIFT))&SIM_MISC_CTL_AFECLKSEL_MASK)
#define SIM_MISC_CTL_AFECLKPADDIR_MASK           0x40u
#define SIM_MISC_CTL_AFECLKPADDIR_SHIFT          6
#define SIM_MISC_CTL_AFECLKPADDIR_WIDTH          1
#define SIM_MISC_CTL_AFECLKPADDIR(x)             (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_AFECLKPADDIR_SHIFT))&SIM_MISC_CTL_AFECLKPADDIR_MASK)
#define SIM_MISC_CTL_UARTMODTYPE_MASK            0x80u
#define SIM_MISC_CTL_UARTMODTYPE_SHIFT           7
#define SIM_MISC_CTL_UARTMODTYPE_WIDTH           1
#define SIM_MISC_CTL_UARTMODTYPE(x)              (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_UARTMODTYPE_SHIFT))&SIM_MISC_CTL_UARTMODTYPE_MASK)
#define SIM_MISC_CTL_UART0IRSEL_MASK             0x100u
#define SIM_MISC_CTL_UART0IRSEL_SHIFT            8
#define SIM_MISC_CTL_UART0IRSEL_WIDTH            1
#define SIM_MISC_CTL_UART0IRSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_UART0IRSEL_SHIFT))&SIM_MISC_CTL_UART0IRSEL_MASK)
#define SIM_MISC_CTL_UART1IRSEL_MASK             0x200u
#define SIM_MISC_CTL_UART1IRSEL_SHIFT            9
#define SIM_MISC_CTL_UART1IRSEL_WIDTH            1
#define SIM_MISC_CTL_UART1IRSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_UART1IRSEL_SHIFT))&SIM_MISC_CTL_UART1IRSEL_MASK)
#define SIM_MISC_CTL_UART2IRSEL_MASK             0x400u
#define SIM_MISC_CTL_UART2IRSEL_SHIFT            10
#define SIM_MISC_CTL_UART2IRSEL_WIDTH            1
#define SIM_MISC_CTL_UART2IRSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_UART2IRSEL_SHIFT))&SIM_MISC_CTL_UART2IRSEL_MASK)
#define SIM_MISC_CTL_UART3IRSEL_MASK             0x800u
#define SIM_MISC_CTL_UART3IRSEL_SHIFT            11
#define SIM_MISC_CTL_UART3IRSEL_WIDTH            1
#define SIM_MISC_CTL_UART3IRSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_UART3IRSEL_SHIFT))&SIM_MISC_CTL_UART3IRSEL_MASK)
#define SIM_MISC_CTL_EWMINSEL_MASK               0x4000u
#define SIM_MISC_CTL_EWMINSEL_SHIFT              14
#define SIM_MISC_CTL_EWMINSEL_WIDTH              1
#define SIM_MISC_CTL_EWMINSEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_EWMINSEL_SHIFT))&SIM_MISC_CTL_EWMINSEL_MASK)
#define SIM_MISC_CTL_TMR0PLLSEL_MASK             0x8000u
#define SIM_MISC_CTL_TMR0PLLSEL_SHIFT            15
#define SIM_MISC_CTL_TMR0PLLSEL_WIDTH            1
#define SIM_MISC_CTL_TMR0PLLSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR0PLLSEL_SHIFT))&SIM_MISC_CTL_TMR0PLLSEL_MASK)
#define SIM_MISC_CTL_TMR0SCSEL_MASK              0x10000u
#define SIM_MISC_CTL_TMR0SCSEL_SHIFT             16
#define SIM_MISC_CTL_TMR0SCSEL_WIDTH             1
#define SIM_MISC_CTL_TMR0SCSEL(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR0SCSEL_SHIFT))&SIM_MISC_CTL_TMR0SCSEL_MASK)
#define SIM_MISC_CTL_TMR1SCSEL_MASK              0x20000u
#define SIM_MISC_CTL_TMR1SCSEL_SHIFT             17
#define SIM_MISC_CTL_TMR1SCSEL_WIDTH             1
#define SIM_MISC_CTL_TMR1SCSEL(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR1SCSEL_SHIFT))&SIM_MISC_CTL_TMR1SCSEL_MASK)
#define SIM_MISC_CTL_TMR2SCSEL_MASK              0x40000u
#define SIM_MISC_CTL_TMR2SCSEL_SHIFT             18
#define SIM_MISC_CTL_TMR2SCSEL_WIDTH             1
#define SIM_MISC_CTL_TMR2SCSEL(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR2SCSEL_SHIFT))&SIM_MISC_CTL_TMR2SCSEL_MASK)
#define SIM_MISC_CTL_TMR3SCSEL_MASK              0x80000u
#define SIM_MISC_CTL_TMR3SCSEL_SHIFT             19
#define SIM_MISC_CTL_TMR3SCSEL_WIDTH             1
#define SIM_MISC_CTL_TMR3SCSEL(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR3SCSEL_SHIFT))&SIM_MISC_CTL_TMR3SCSEL_MASK)
#define SIM_MISC_CTL_TMR0PCSSEL_MASK             0x300000u
#define SIM_MISC_CTL_TMR0PCSSEL_SHIFT            20
#define SIM_MISC_CTL_TMR0PCSSEL_WIDTH            2
#define SIM_MISC_CTL_TMR0PCSSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR0PCSSEL_SHIFT))&SIM_MISC_CTL_TMR0PCSSEL_MASK)
#define SIM_MISC_CTL_TMR1PCSSEL_MASK             0xC00000u
#define SIM_MISC_CTL_TMR1PCSSEL_SHIFT            22
#define SIM_MISC_CTL_TMR1PCSSEL_WIDTH            2
#define SIM_MISC_CTL_TMR1PCSSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR1PCSSEL_SHIFT))&SIM_MISC_CTL_TMR1PCSSEL_MASK)
#define SIM_MISC_CTL_TMR2PCSSEL_MASK             0x3000000u
#define SIM_MISC_CTL_TMR2PCSSEL_SHIFT            24
#define SIM_MISC_CTL_TMR2PCSSEL_WIDTH            2
#define SIM_MISC_CTL_TMR2PCSSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR2PCSSEL_SHIFT))&SIM_MISC_CTL_TMR2PCSSEL_MASK)
#define SIM_MISC_CTL_TMR3PCSSEL_MASK             0xC000000u
#define SIM_MISC_CTL_TMR3PCSSEL_SHIFT            26
#define SIM_MISC_CTL_TMR3PCSSEL_WIDTH            2
#define SIM_MISC_CTL_TMR3PCSSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_TMR3PCSSEL_SHIFT))&SIM_MISC_CTL_TMR3PCSSEL_MASK)
#define SIM_MISC_CTL_RTCCLKSEL_MASK              0x10000000u
#define SIM_MISC_CTL_RTCCLKSEL_SHIFT             28
#define SIM_MISC_CTL_RTCCLKSEL_WIDTH             1
#define SIM_MISC_CTL_RTCCLKSEL(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_RTCCLKSEL_SHIFT))&SIM_MISC_CTL_RTCCLKSEL_MASK)
#define SIM_MISC_CTL_VREFBUFOUTEN_MASK           0x20000000u
#define SIM_MISC_CTL_VREFBUFOUTEN_SHIFT          29
#define SIM_MISC_CTL_VREFBUFOUTEN_WIDTH          1
#define SIM_MISC_CTL_VREFBUFOUTEN(x)             (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_VREFBUFOUTEN_SHIFT))&SIM_MISC_CTL_VREFBUFOUTEN_MASK)
#define SIM_MISC_CTL_VREFBUFINSEL_MASK           0x40000000u
#define SIM_MISC_CTL_VREFBUFINSEL_SHIFT          30
#define SIM_MISC_CTL_VREFBUFINSEL_WIDTH          1
#define SIM_MISC_CTL_VREFBUFINSEL(x)             (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_VREFBUFINSEL_SHIFT))&SIM_MISC_CTL_VREFBUFINSEL_MASK)
#define SIM_MISC_CTL_VREFBUFPD_MASK              0x80000000u
#define SIM_MISC_CTL_VREFBUFPD_SHIFT             31
#define SIM_MISC_CTL_VREFBUFPD_WIDTH             1
#define SIM_MISC_CTL_VREFBUFPD(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_VREFBUFPD_SHIFT))&SIM_MISC_CTL_VREFBUFPD_MASK)
/* ADC_COMP0 Bit Fields */
#define SIM_ADC_COMP0_ADCCOMPVAL0_MASK           0xFFFFu
#define SIM_ADC_COMP0_ADCCOMPVAL0_SHIFT          0
#define SIM_ADC_COMP0_ADCCOMPVAL0_WIDTH          16
#define SIM_ADC_COMP0_ADCCOMPVAL0(x)             (((uint32_t)(((uint32_t)(x))<<SIM_ADC_COMP0_ADCCOMPVAL0_SHIFT))&SIM_ADC_COMP0_ADCCOMPVAL0_MASK)
#define SIM_ADC_COMP0_ADCCOMPVAL1_MASK           0xFFFF0000u
#define SIM_ADC_COMP0_ADCCOMPVAL1_SHIFT          16
#define SIM_ADC_COMP0_ADCCOMPVAL1_WIDTH          16
#define SIM_ADC_COMP0_ADCCOMPVAL1(x)             (((uint32_t)(((uint32_t)(x))<<SIM_ADC_COMP0_ADCCOMPVAL1_SHIFT))&SIM_ADC_COMP0_ADCCOMPVAL1_MASK)
/* ADC_COMP1 Bit Fields */
#define SIM_ADC_COMP1_ADCCOMPVAL2_MASK           0xFFFFu
#define SIM_ADC_COMP1_ADCCOMPVAL2_SHIFT          0
#define SIM_ADC_COMP1_ADCCOMPVAL2_WIDTH          16
#define SIM_ADC_COMP1_ADCCOMPVAL2(x)             (((uint32_t)(((uint32_t)(x))<<SIM_ADC_COMP1_ADCCOMPVAL2_SHIFT))&SIM_ADC_COMP1_ADCCOMPVAL2_MASK)

/*!
 * @}
 */ /* end of group SIM_Register_Masks */


/* SIM - Peripheral instance base addresses */
/** Peripheral SIM base address */
#define SIM_BASE                                 (0x4003E000u)
/** Peripheral SIM base pointer */
#define SIM                                      ((SIM_Type *)SIM_BASE)
#define SIM_BASE_PTR                             (SIM)
/** Array initializer of SIM peripheral base addresses */
#define SIM_BASE_ADDRS                           { SIM_BASE }
/** Array initializer of SIM peripheral base pointers */
#define SIM_BASE_PTRS                            { SIM }

/* ----------------------------------------------------------------------------
   -- SIM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Register_Accessor_Macros SIM - Register accessor macros
 * @{
 */


/* SIM - Register instance definitions */
/* SIM */
#define SIM_SOPT1                                SIM_SOPT1_REG(SIM)
#define SIM_SOPT1_CFG                            SIM_SOPT1_CFG_REG(SIM)
#define SIM_CTRL_REG                             SIM_CTRL_REG_REG(SIM)
#define SIM_SDID                                 SIM_SDID_REG(SIM)
#define SIM_SCGC4                                SIM_SCGC4_REG(SIM)
#define SIM_SCGC5                                SIM_SCGC5_REG(SIM)
#define SIM_SCGC6                                SIM_SCGC6_REG(SIM)
#define SIM_SCGC7                                SIM_SCGC7_REG(SIM)
#define SIM_CLKDIV1                              SIM_CLKDIV1_REG(SIM)
#define SIM_FCFG1                                SIM_FCFG1_REG(SIM)
#define SIM_FCFG2                                SIM_FCFG2_REG(SIM)
#define SIM_UIDH                                 SIM_UIDH_REG(SIM)
#define SIM_UIDMH                                SIM_UIDMH_REG(SIM)
#define SIM_UIDML                                SIM_UIDML_REG(SIM)
#define SIM_UIDL                                 SIM_UIDL_REG(SIM)
#define SIM_MISC_CTL                             SIM_MISC_CTL_REG(SIM)
#define SIM_ADC_COMP0                            SIM_ADC_COMP0_REG(SIM)
#define SIM_ADC_COMP1                            SIM_ADC_COMP1_REG(SIM)

/*!
 * @}
 */ /* end of group SIM_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group SIM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SMC_Peripheral_Access_Layer SMC Peripheral Access Layer
 * @{
 */

/** SMC - Register Layout Typedef */
typedef struct {
  __IO uint8_t PMPROT;                             /**< Power Mode Protection register, offset: 0x0 */
  __IO uint8_t PMCTRL;                             /**< Power Mode Control register, offset: 0x1 */
  __IO uint8_t STOPCTRL;                           /**< Stop Control Register, offset: 0x2 */
  __I  uint8_t PMSTAT;                             /**< Power Mode Status register, offset: 0x3 */
} SMC_Type, *SMC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- SMC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SMC_Register_Accessor_Macros SMC - Register accessor macros
 * @{
 */


/* SMC - Register accessors */
#define SMC_PMPROT_REG(base)                     ((base)->PMPROT)
#define SMC_PMCTRL_REG(base)                     ((base)->PMCTRL)
#define SMC_STOPCTRL_REG(base)                   ((base)->STOPCTRL)
#define SMC_PMSTAT_REG(base)                     ((base)->PMSTAT)

/*!
 * @}
 */ /* end of group SMC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- SMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SMC_Register_Masks SMC Register Masks
 * @{
 */

