RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
/* TMR - Register instance definitions */
/* TMR0 */
#define TMR0_COMP1                               TMR_COMP1_REG(TMR0)
#define TMR0_COMP2                               TMR_COMP2_REG(TMR0)
#define TMR0_CAPT                                TMR_CAPT_REG(TMR0)
#define TMR0_LOAD                                TMR_LOAD_REG(TMR0)
#define TMR0_HOLD                                TMR_HOLD_REG(TMR0)
#define TMR0_CNTR                                TMR_CNTR_REG(TMR0)
#define TMR0_CTRL                                TMR_CTRL_REG(TMR0)
#define TMR0_SCTRL                               TMR_SCTRL_REG(TMR0)
#define TMR0_CMPLD1                              TMR_CMPLD1_REG(TMR0)
#define TMR0_CMPLD2                              TMR_CMPLD2_REG(TMR0)
#define TMR0_CSCTRL                              TMR_CSCTRL_REG(TMR0)
#define TMR0_FILT                                TMR_FILT_REG(TMR0)
#define TMR0_ENBL                                TMR_ENBL_REG(TMR0)
/* TMR1 */
#define TMR1_COMP1                               TMR_COMP1_REG(TMR1)
#define TMR1_COMP2                               TMR_COMP2_REG(TMR1)
#define TMR1_CAPT                                TMR_CAPT_REG(TMR1)
#define TMR1_LOAD                                TMR_LOAD_REG(TMR1)
#define TMR1_HOLD                                TMR_HOLD_REG(TMR1)
#define TMR1_CNTR                                TMR_CNTR_REG(TMR1)
#define TMR1_CTRL                                TMR_CTRL_REG(TMR1)
#define TMR1_SCTRL                               TMR_SCTRL_REG(TMR1)
#define TMR1_CMPLD1                              TMR_CMPLD1_REG(TMR1)
#define TMR1_CMPLD2                              TMR_CMPLD2_REG(TMR1)
#define TMR1_CSCTRL                              TMR_CSCTRL_REG(TMR1)
#define TMR1_FILT                                TMR_FILT_REG(TMR1)
#define TMR1_ENBL                                TMR_ENBL_REG(TMR1)
/* TMR2 */
#define TMR2_COMP1                               TMR_COMP1_REG(TMR2)
#define TMR2_COMP2                               TMR_COMP2_REG(TMR2)
#define TMR2_CAPT                                TMR_CAPT_REG(TMR2)
#define TMR2_LOAD                                TMR_LOAD_REG(TMR2)
#define TMR2_HOLD                                TMR_HOLD_REG(TMR2)
#define TMR2_CNTR                                TMR_CNTR_REG(TMR2)
#define TMR2_CTRL                                TMR_CTRL_REG(TMR2)
#define TMR2_SCTRL                               TMR_SCTRL_REG(TMR2)
#define TMR2_CMPLD1                              TMR_CMPLD1_REG(TMR2)
#define TMR2_CMPLD2                              TMR_CMPLD2_REG(TMR2)
#define TMR2_CSCTRL                              TMR_CSCTRL_REG(TMR2)
#define TMR2_FILT                                TMR_FILT_REG(TMR2)
#define TMR2_ENBL                                TMR_ENBL_REG(TMR2)
/* TMR3 */
#define TMR3_COMP1                               TMR_COMP1_REG(TMR3)
#define TMR3_COMP2                               TMR_COMP2_REG(TMR3)
#define TMR3_CAPT                                TMR_CAPT_REG(TMR3)
#define TMR3_LOAD                                TMR_LOAD_REG(TMR3)
#define TMR3_HOLD                                TMR_HOLD_REG(TMR3)
#define TMR3_CNTR                                TMR_CNTR_REG(TMR3)
#define TMR3_CTRL                                TMR_CTRL_REG(TMR3)
#define TMR3_SCTRL                               TMR_SCTRL_REG(TMR3)
#define TMR3_CMPLD1                              TMR_CMPLD1_REG(TMR3)
#define TMR3_CMPLD2                              TMR_CMPLD2_REG(TMR3)
#define TMR3_CSCTRL                              TMR_CSCTRL_REG(TMR3)
#define TMR3_FILT                                TMR_FILT_REG(TMR3)
#define TMR3_ENBL                                TMR_ENBL_REG(TMR3)

/*!
 * @}
 */ /* end of group TMR_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group TMR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- UART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup UART_Peripheral_Access_Layer UART Peripheral Access Layer
 * @{
 */

/** UART - Register Layout Typedef */
typedef struct {
  __IO uint8_t BDH;                                /**< UART Baud Rate Registers: High, offset: 0x0 */
  __IO uint8_t BDL;                                /**< UART Baud Rate Registers: Low, offset: 0x1 */
  __IO uint8_t C1;                                 /**< UART Control Register 1, offset: 0x2 */
  __IO uint8_t C2;                                 /**< UART Control Register 2, offset: 0x3 */
  __I  uint8_t S1;                                 /**< UART Status Register 1, offset: 0x4 */
  __IO uint8_t S2;                                 /**< UART Status Register 2, offset: 0x5 */
  __IO uint8_t C3;                                 /**< UART Control Register 3, offset: 0x6 */
  __IO uint8_t D;                                  /**< UART Data Register, offset: 0x7 */
  __IO uint8_t MA1;                                /**< UART Match Address Registers 1, offset: 0x8 */
  __IO uint8_t MA2;                                /**< UART Match Address Registers 2, offset: 0x9 */
  __IO uint8_t C4;                                 /**< UART Control Register 4, offset: 0xA */
  __IO uint8_t C5;                                 /**< UART Control Register 5, offset: 0xB */
  __I  uint8_t ED;                                 /**< UART Extended Data Register, offset: 0xC */
  __IO uint8_t MODEM;                              /**< UART Modem Register, offset: 0xD */
       uint8_t RESERVED_0[2];
  __IO uint8_t PFIFO;                              /**< UART FIFO Parameters, offset: 0x10 */
  __IO uint8_t CFIFO;                              /**< UART FIFO Control Register, offset: 0x11 */
  __IO uint8_t SFIFO;                              /**< UART FIFO Status Register, offset: 0x12 */
  __IO uint8_t TWFIFO;                             /**< UART FIFO Transmit Watermark, offset: 0x13 */
  __I  uint8_t TCFIFO;                             /**< UART FIFO Transmit Count, offset: 0x14 */
  __IO uint8_t RWFIFO;                             /**< UART FIFO Receive Watermark, offset: 0x15 */
  __I  uint8_t RCFIFO;                             /**< UART FIFO Receive Count, offset: 0x16 */
       uint8_t RESERVED_1[1];
  __IO uint8_t C7816;                              /**< UART 7816 Control Register, offset: 0x18 */
  __IO uint8_t IE7816;                             /**< UART 7816 Interrupt Enable Register, offset: 0x19 */
  __IO uint8_t IS7816;                             /**< UART 7816 Interrupt Status Register, offset: 0x1A */
  __IO uint8_t WP7816;                             /**< UART 7816 Wait Parameter Register, offset: 0x1B */
  __IO uint8_t WN7816;                             /**< UART 7816 Wait N Register, offset: 0x1C */
  __IO uint8_t WF7816;                             /**< UART 7816 Wait FD Register, offset: 0x1D */
  __IO uint8_t ET7816;                             /**< UART 7816 Error Threshold Register, offset: 0x1E */
  __IO uint8_t TL7816;                             /**< UART 7816 Transmit Length Register, offset: 0x1F */
       uint8_t RESERVED_2[26];
  __IO uint8_t AP7816A_T0;                         /**< UART 7816 ATR Duration Timer Register A, offset: 0x3A */
  __IO uint8_t AP7816B_T0;                         /**< UART 7816 ATR Duration Timer Register B, offset: 0x3B */
  union {                                          /* offset: 0x3C */
    struct {                                         /* offset: 0x3C */
      __IO uint8_t WP7816A_T0;                         /**< UART 7816 Wait Parameter Register A, offset: 0x3C */
      __IO uint8_t WP7816B_T0;                         /**< UART 7816 Wait Parameter Register B, offset: 0x3D */
    } TYPE0;
    struct {                                         /* offset: 0x3C */
      __IO uint8_t WP7816A_T1;                         /**< UART 7816 Wait Parameter Register A, offset: 0x3C */
      __IO uint8_t WP7816B_T1;                         /**< UART 7816 Wait Parameter Register B, offset: 0x3D */
    } TYPE1;
  };
  __IO uint8_t WGP7816_T1;                         /**< UART 7816 Wait and Guard Parameter Register, offset: 0x3E */
  __IO uint8_t WP7816C_T1;                         /**< UART 7816 Wait Parameter Register C, offset: 0x3F */
} UART_Type, *UART_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- UART - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup UART_Register_Accessor_Macros UART - Register accessor macros
 * @{
 */


/* UART - Register accessors */
#define UART_BDH_REG(base)                       ((base)->BDH)
#define UART_BDL_REG(base)                       ((base)->BDL)
#define UART_C1_REG(base)                        ((base)->C1)
#define UART_C2_REG(base)                        ((base)->C2)
#define UART_S1_REG(base)                        ((base)->S1)
#define UART_S2_REG(base)                        ((base)->S2)
#define UART_C3_REG(base)                        ((base)->C3)
#define UART_D_REG(base)                         ((base)->D)
#define UART_MA1_REG(base)                       ((base)->MA1)
#define UART_MA2_REG(base)                       ((base)->MA2)
#define UART_C4_REG(base)                        ((base)->C4)
#define UART_C5_REG(base)                        ((base)->C5)
#define UART_ED_REG(base)                        ((base)->ED)
#define UART_MODEM_REG(base)                     ((base)->MODEM)
#define UART_PFIFO_REG(base)                     ((base)->PFIFO)
#define UART_CFIFO_REG(base)                     ((base)->CFIFO)
#define UART_SFIFO_REG(base)                     ((base)->SFIFO)
#define UART_TWFIFO_REG(base)                    ((base)->TWFIFO)
#define UART_TCFIFO_REG(base)                    ((base)->TCFIFO)
#define UART_RWFIFO_REG(base)                    ((base)->RWFIFO)
#define UART_RCFIFO_REG(base)                    ((base)->RCFIFO)
#define UART_C7816_REG(base)                     ((base)->C7816)
#define UART_IE7816_REG(base)                    ((base)->IE7816)
#define UART_IS7816_REG(base)                    ((base)->IS7816)
#define UART_WP7816_REG(base)                    ((base)->WP7816)
#define UART_WN7816_REG(base)                    ((base)->WN7816)
#define UART_WF7816_REG(base)                    ((base)->WF7816)
#define UART_ET7816_REG(base)                    ((base)->ET7816)
#define UART_TL7816_REG(base)                    ((base)->TL7816)
#define UART_AP7816A_T0_REG(base)                ((base)->AP7816A_T0)
#define UART_AP7816B_T0_REG(base)                ((base)->AP7816B_T0)
#define UART_WP7816A_T0_REG(base)                ((base)->TYPE0.WP7816A_T0)
#define UART_WP7816B_T0_REG(base)                ((base)->TYPE0.WP7816B_T0)
#define UART_WP7816A_T1_REG(base)                ((base)->TYPE1.WP7816A_T1)
#define UART_WP7816B_T1_REG(base)                ((base)->TYPE1.WP7816B_T1)
#define UART_WGP7816_T1_REG(base)                ((base)->WGP7816_T1)
#define UART_WP7816C_T1_REG(base)                ((base)->WP7816C_T1)

/*!
 * @}
 */ /* end of group UART_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- UART Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup UART_Register_Masks UART Register Masks
 * @{
 */

