RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
/* SEL0 Bit Fields */
#define XBAR_SEL0_SEL0_MASK                      0x3Fu
#define XBAR_SEL0_SEL0_SHIFT                     0
#define XBAR_SEL0_SEL0_WIDTH                     6
#define XBAR_SEL0_SEL0(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL0_SEL0_SHIFT))&XBAR_SEL0_SEL0_MASK)
#define XBAR_SEL0_SEL1_MASK                      0x3F00u
#define XBAR_SEL0_SEL1_SHIFT                     8
#define XBAR_SEL0_SEL1_WIDTH                     6
#define XBAR_SEL0_SEL1(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL0_SEL1_SHIFT))&XBAR_SEL0_SEL1_MASK)
/* SEL1 Bit Fields */
#define XBAR_SEL1_SEL2_MASK                      0x3Fu
#define XBAR_SEL1_SEL2_SHIFT                     0
#define XBAR_SEL1_SEL2_WIDTH                     6
#define XBAR_SEL1_SEL2(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL1_SEL2_SHIFT))&XBAR_SEL1_SEL2_MASK)
#define XBAR_SEL1_SEL3_MASK                      0x3F00u
#define XBAR_SEL1_SEL3_SHIFT                     8
#define XBAR_SEL1_SEL3_WIDTH                     6
#define XBAR_SEL1_SEL3(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL1_SEL3_SHIFT))&XBAR_SEL1_SEL3_MASK)
/* SEL2 Bit Fields */
#define XBAR_SEL2_SEL4_MASK                      0x3Fu
#define XBAR_SEL2_SEL4_SHIFT                     0
#define XBAR_SEL2_SEL4_WIDTH                     6
#define XBAR_SEL2_SEL4(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL2_SEL4_SHIFT))&XBAR_SEL2_SEL4_MASK)
#define XBAR_SEL2_SEL5_MASK                      0x3F00u
#define XBAR_SEL2_SEL5_SHIFT                     8
#define XBAR_SEL2_SEL5_WIDTH                     6
#define XBAR_SEL2_SEL5(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL2_SEL5_SHIFT))&XBAR_SEL2_SEL5_MASK)
/* SEL3 Bit Fields */
#define XBAR_SEL3_SEL6_MASK                      0x3Fu
#define XBAR_SEL3_SEL6_SHIFT                     0
#define XBAR_SEL3_SEL6_WIDTH                     6
#define XBAR_SEL3_SEL6(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL3_SEL6_SHIFT))&XBAR_SEL3_SEL6_MASK)
#define XBAR_SEL3_SEL7_MASK                      0x3F00u
#define XBAR_SEL3_SEL7_SHIFT                     8
#define XBAR_SEL3_SEL7_WIDTH                     6
#define XBAR_SEL3_SEL7(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL3_SEL7_SHIFT))&XBAR_SEL3_SEL7_MASK)
/* SEL4 Bit Fields */
#define XBAR_SEL4_SEL8_MASK                      0x3Fu
#define XBAR_SEL4_SEL8_SHIFT                     0
#define XBAR_SEL4_SEL8_WIDTH                     6
#define XBAR_SEL4_SEL8(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL4_SEL8_SHIFT))&XBAR_SEL4_SEL8_MASK)
#define XBAR_SEL4_SEL9_MASK                      0x3F00u
#define XBAR_SEL4_SEL9_SHIFT                     8
#define XBAR_SEL4_SEL9_WIDTH                     6
#define XBAR_SEL4_SEL9(x)                        (((uint16_t)(((uint16_t)(x))<<XBAR_SEL4_SEL9_SHIFT))&XBAR_SEL4_SEL9_MASK)
/* SEL5 Bit Fields */
#define XBAR_SEL5_SEL10_MASK                     0x3Fu
#define XBAR_SEL5_SEL10_SHIFT                    0
#define XBAR_SEL5_SEL10_WIDTH                    6
#define XBAR_SEL5_SEL10(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL5_SEL10_SHIFT))&XBAR_SEL5_SEL10_MASK)
#define XBAR_SEL5_SEL11_MASK                     0x3F00u
#define XBAR_SEL5_SEL11_SHIFT                    8
#define XBAR_SEL5_SEL11_WIDTH                    6
#define XBAR_SEL5_SEL11(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL5_SEL11_SHIFT))&XBAR_SEL5_SEL11_MASK)
/* SEL6 Bit Fields */
#define XBAR_SEL6_SEL12_MASK                     0x3Fu
#define XBAR_SEL6_SEL12_SHIFT                    0
#define XBAR_SEL6_SEL12_WIDTH                    6
#define XBAR_SEL6_SEL12(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL6_SEL12_SHIFT))&XBAR_SEL6_SEL12_MASK)
#define XBAR_SEL6_SEL13_MASK                     0x3F00u
#define XBAR_SEL6_SEL13_SHIFT                    8
#define XBAR_SEL6_SEL13_WIDTH                    6
#define XBAR_SEL6_SEL13(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL6_SEL13_SHIFT))&XBAR_SEL6_SEL13_MASK)
/* SEL7 Bit Fields */
#define XBAR_SEL7_SEL14_MASK                     0x3Fu
#define XBAR_SEL7_SEL14_SHIFT                    0
#define XBAR_SEL7_SEL14_WIDTH                    6
#define XBAR_SEL7_SEL14(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL7_SEL14_SHIFT))&XBAR_SEL7_SEL14_MASK)
#define XBAR_SEL7_SEL15_MASK                     0x3F00u
#define XBAR_SEL7_SEL15_SHIFT                    8
#define XBAR_SEL7_SEL15_WIDTH                    6
#define XBAR_SEL7_SEL15(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL7_SEL15_SHIFT))&XBAR_SEL7_SEL15_MASK)
/* SEL8 Bit Fields */
#define XBAR_SEL8_SEL16_MASK                     0x3Fu
#define XBAR_SEL8_SEL16_SHIFT                    0
#define XBAR_SEL8_SEL16_WIDTH                    6
#define XBAR_SEL8_SEL16(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL8_SEL16_SHIFT))&XBAR_SEL8_SEL16_MASK)
#define XBAR_SEL8_SEL17_MASK                     0x3F00u
#define XBAR_SEL8_SEL17_SHIFT                    8
#define XBAR_SEL8_SEL17_WIDTH                    6
#define XBAR_SEL8_SEL17(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL8_SEL17_SHIFT))&XBAR_SEL8_SEL17_MASK)
/* SEL9 Bit Fields */
#define XBAR_SEL9_SEL18_MASK                     0x3Fu
#define XBAR_SEL9_SEL18_SHIFT                    0
#define XBAR_SEL9_SEL18_WIDTH                    6
#define XBAR_SEL9_SEL18(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL9_SEL18_SHIFT))&XBAR_SEL9_SEL18_MASK)
#define XBAR_SEL9_SEL19_MASK                     0x3F00u
#define XBAR_SEL9_SEL19_SHIFT                    8
#define XBAR_SEL9_SEL19_WIDTH                    6
#define XBAR_SEL9_SEL19(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_SEL9_SEL19_SHIFT))&XBAR_SEL9_SEL19_MASK)
/* SEL10 Bit Fields */
#define XBAR_SEL10_SEL20_MASK                    0x3Fu
#define XBAR_SEL10_SEL20_SHIFT                   0
#define XBAR_SEL10_SEL20_WIDTH                   6
#define XBAR_SEL10_SEL20(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL10_SEL20_SHIFT))&XBAR_SEL10_SEL20_MASK)
#define XBAR_SEL10_SEL21_MASK                    0x3F00u
#define XBAR_SEL10_SEL21_SHIFT                   8
#define XBAR_SEL10_SEL21_WIDTH                   6
#define XBAR_SEL10_SEL21(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL10_SEL21_SHIFT))&XBAR_SEL10_SEL21_MASK)
/* SEL11 Bit Fields */
#define XBAR_SEL11_SEL22_MASK                    0x3Fu
#define XBAR_SEL11_SEL22_SHIFT                   0
#define XBAR_SEL11_SEL22_WIDTH                   6
#define XBAR_SEL11_SEL22(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL11_SEL22_SHIFT))&XBAR_SEL11_SEL22_MASK)
#define XBAR_SEL11_SEL23_MASK                    0x3F00u
#define XBAR_SEL11_SEL23_SHIFT                   8
#define XBAR_SEL11_SEL23_WIDTH                   6
#define XBAR_SEL11_SEL23(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL11_SEL23_SHIFT))&XBAR_SEL11_SEL23_MASK)
/* SEL12 Bit Fields */
#define XBAR_SEL12_SEL24_MASK                    0x3Fu
#define XBAR_SEL12_SEL24_SHIFT                   0
#define XBAR_SEL12_SEL24_WIDTH                   6
#define XBAR_SEL12_SEL24(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL12_SEL24_SHIFT))&XBAR_SEL12_SEL24_MASK)
#define XBAR_SEL12_SEL25_MASK                    0x3F00u
#define XBAR_SEL12_SEL25_SHIFT                   8
#define XBAR_SEL12_SEL25_WIDTH                   6
#define XBAR_SEL12_SEL25(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL12_SEL25_SHIFT))&XBAR_SEL12_SEL25_MASK)
/* SEL13 Bit Fields */
#define XBAR_SEL13_SEL26_MASK                    0x3Fu
#define XBAR_SEL13_SEL26_SHIFT                   0
#define XBAR_SEL13_SEL26_WIDTH                   6
#define XBAR_SEL13_SEL26(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL13_SEL26_SHIFT))&XBAR_SEL13_SEL26_MASK)
#define XBAR_SEL13_SEL27_MASK                    0x3F00u
#define XBAR_SEL13_SEL27_SHIFT                   8
#define XBAR_SEL13_SEL27_WIDTH                   6
#define XBAR_SEL13_SEL27(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL13_SEL27_SHIFT))&XBAR_SEL13_SEL27_MASK)
/* SEL14 Bit Fields */
#define XBAR_SEL14_SEL28_MASK                    0x3Fu
#define XBAR_SEL14_SEL28_SHIFT                   0
#define XBAR_SEL14_SEL28_WIDTH                   6
#define XBAR_SEL14_SEL28(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL14_SEL28_SHIFT))&XBAR_SEL14_SEL28_MASK)
#define XBAR_SEL14_SEL29_MASK                    0x3F00u
#define XBAR_SEL14_SEL29_SHIFT                   8
#define XBAR_SEL14_SEL29_WIDTH                   6
#define XBAR_SEL14_SEL29(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL14_SEL29_SHIFT))&XBAR_SEL14_SEL29_MASK)
/* SEL15 Bit Fields */
#define XBAR_SEL15_SEL30_MASK                    0x3Fu
#define XBAR_SEL15_SEL30_SHIFT                   0
#define XBAR_SEL15_SEL30_WIDTH                   6
#define XBAR_SEL15_SEL30(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL15_SEL30_SHIFT))&XBAR_SEL15_SEL30_MASK)
#define XBAR_SEL15_SEL31_MASK                    0x3F00u
#define XBAR_SEL15_SEL31_SHIFT                   8
#define XBAR_SEL15_SEL31_WIDTH                   6
#define XBAR_SEL15_SEL31(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL15_SEL31_SHIFT))&XBAR_SEL15_SEL31_MASK)
/* SEL16 Bit Fields */
#define XBAR_SEL16_SEL32_MASK                    0x3Fu
#define XBAR_SEL16_SEL32_SHIFT                   0
#define XBAR_SEL16_SEL32_WIDTH                   6
#define XBAR_SEL16_SEL32(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL16_SEL32_SHIFT))&XBAR_SEL16_SEL32_MASK)
#define XBAR_SEL16_SEL33_MASK                    0x3F00u
#define XBAR_SEL16_SEL33_SHIFT                   8
#define XBAR_SEL16_SEL33_WIDTH                   6
#define XBAR_SEL16_SEL33(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL16_SEL33_SHIFT))&XBAR_SEL16_SEL33_MASK)
/* SEL17 Bit Fields */
#define XBAR_SEL17_SEL34_MASK                    0x3Fu
#define XBAR_SEL17_SEL34_SHIFT                   0
#define XBAR_SEL17_SEL34_WIDTH                   6
#define XBAR_SEL17_SEL34(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL17_SEL34_SHIFT))&XBAR_SEL17_SEL34_MASK)
#define XBAR_SEL17_SEL35_MASK                    0x3F00u
#define XBAR_SEL17_SEL35_SHIFT                   8
#define XBAR_SEL17_SEL35_WIDTH                   6
#define XBAR_SEL17_SEL35(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL17_SEL35_SHIFT))&XBAR_SEL17_SEL35_MASK)
/* SEL18 Bit Fields */
#define XBAR_SEL18_SEL36_MASK                    0x3Fu
#define XBAR_SEL18_SEL36_SHIFT                   0
#define XBAR_SEL18_SEL36_WIDTH                   6
#define XBAR_SEL18_SEL36(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL18_SEL36_SHIFT))&XBAR_SEL18_SEL36_MASK)
#define XBAR_SEL18_SEL37_MASK                    0x3F00u
#define XBAR_SEL18_SEL37_SHIFT                   8
#define XBAR_SEL18_SEL37_WIDTH                   6
#define XBAR_SEL18_SEL37(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL18_SEL37_SHIFT))&XBAR_SEL18_SEL37_MASK)
/* SEL19 Bit Fields */
#define XBAR_SEL19_SEL38_MASK                    0x3Fu
#define XBAR_SEL19_SEL38_SHIFT                   0
#define XBAR_SEL19_SEL38_WIDTH                   6
#define XBAR_SEL19_SEL38(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL19_SEL38_SHIFT))&XBAR_SEL19_SEL38_MASK)
#define XBAR_SEL19_SEL39_MASK                    0x3F00u
#define XBAR_SEL19_SEL39_SHIFT                   8
#define XBAR_SEL19_SEL39_WIDTH                   6
#define XBAR_SEL19_SEL39(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL19_SEL39_SHIFT))&XBAR_SEL19_SEL39_MASK)
/* SEL20 Bit Fields */
#define XBAR_SEL20_SEL40_MASK                    0x3Fu
#define XBAR_SEL20_SEL40_SHIFT                   0
#define XBAR_SEL20_SEL40_WIDTH                   6
#define XBAR_SEL20_SEL40(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL20_SEL40_SHIFT))&XBAR_SEL20_SEL40_MASK)
#define XBAR_SEL20_SEL41_MASK                    0x3F00u
#define XBAR_SEL20_SEL41_SHIFT                   8
#define XBAR_SEL20_SEL41_WIDTH                   6
#define XBAR_SEL20_SEL41(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL20_SEL41_SHIFT))&XBAR_SEL20_SEL41_MASK)
/* SEL21 Bit Fields */
#define XBAR_SEL21_SEL42_MASK                    0x3Fu
#define XBAR_SEL21_SEL42_SHIFT                   0
#define XBAR_SEL21_SEL42_WIDTH                   6
#define XBAR_SEL21_SEL42(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL21_SEL42_SHIFT))&XBAR_SEL21_SEL42_MASK)
#define XBAR_SEL21_SEL43_MASK                    0x3F00u
#define XBAR_SEL21_SEL43_SHIFT                   8
#define XBAR_SEL21_SEL43_WIDTH                   6
#define XBAR_SEL21_SEL43(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_SEL21_SEL43_SHIFT))&XBAR_SEL21_SEL43_MASK)
/* CTRL0 Bit Fields */
#define XBAR_CTRL0_DEN0_MASK                     0x1u
#define XBAR_CTRL0_DEN0_SHIFT                    0
#define XBAR_CTRL0_DEN0_WIDTH                    1
#define XBAR_CTRL0_DEN0(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_DEN0_SHIFT))&XBAR_CTRL0_DEN0_MASK)
#define XBAR_CTRL0_IEN0_MASK                     0x2u
#define XBAR_CTRL0_IEN0_SHIFT                    1
#define XBAR_CTRL0_IEN0_WIDTH                    1
#define XBAR_CTRL0_IEN0(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_IEN0_SHIFT))&XBAR_CTRL0_IEN0_MASK)
#define XBAR_CTRL0_EDGE0_MASK                    0xCu
#define XBAR_CTRL0_EDGE0_SHIFT                   2
#define XBAR_CTRL0_EDGE0_WIDTH                   2
#define XBAR_CTRL0_EDGE0(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_EDGE0_SHIFT))&XBAR_CTRL0_EDGE0_MASK)
#define XBAR_CTRL0_STS0_MASK                     0x10u
#define XBAR_CTRL0_STS0_SHIFT                    4
#define XBAR_CTRL0_STS0_WIDTH                    1
#define XBAR_CTRL0_STS0(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_STS0_SHIFT))&XBAR_CTRL0_STS0_MASK)
#define XBAR_CTRL0_DEN1_MASK                     0x100u
#define XBAR_CTRL0_DEN1_SHIFT                    8
#define XBAR_CTRL0_DEN1_WIDTH                    1
#define XBAR_CTRL0_DEN1(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_DEN1_SHIFT))&XBAR_CTRL0_DEN1_MASK)
#define XBAR_CTRL0_IEN1_MASK                     0x200u
#define XBAR_CTRL0_IEN1_SHIFT                    9
#define XBAR_CTRL0_IEN1_WIDTH                    1
#define XBAR_CTRL0_IEN1(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_IEN1_SHIFT))&XBAR_CTRL0_IEN1_MASK)
#define XBAR_CTRL0_EDGE1_MASK                    0xC00u
#define XBAR_CTRL0_EDGE1_SHIFT                   10
#define XBAR_CTRL0_EDGE1_WIDTH                   2
#define XBAR_CTRL0_EDGE1(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_EDGE1_SHIFT))&XBAR_CTRL0_EDGE1_MASK)
#define XBAR_CTRL0_STS1_MASK                     0x1000u
#define XBAR_CTRL0_STS1_SHIFT                    12
#define XBAR_CTRL0_STS1_WIDTH                    1
#define XBAR_CTRL0_STS1(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_STS1_SHIFT))&XBAR_CTRL0_STS1_MASK)
/* CTRL1 Bit Fields */
#define XBAR_CTRL1_DEN2_MASK                     0x1u
#define XBAR_CTRL1_DEN2_SHIFT                    0
#define XBAR_CTRL1_DEN2_WIDTH                    1
#define XBAR_CTRL1_DEN2(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL1_DEN2_SHIFT))&XBAR_CTRL1_DEN2_MASK)
#define XBAR_CTRL1_IEN2_MASK                     0x2u
#define XBAR_CTRL1_IEN2_SHIFT                    1
#define XBAR_CTRL1_IEN2_WIDTH                    1
#define XBAR_CTRL1_IEN2(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL1_IEN2_SHIFT))&XBAR_CTRL1_IEN2_MASK)
#define XBAR_CTRL1_EDGE2_MASK                    0xCu
#define XBAR_CTRL1_EDGE2_SHIFT                   2
#define XBAR_CTRL1_EDGE2_WIDTH                   2
#define XBAR_CTRL1_EDGE2(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL1_EDGE2_SHIFT))&XBAR_CTRL1_EDGE2_MASK)
#define XBAR_CTRL1_STS2_MASK                     0x10u
#define XBAR_CTRL1_STS2_SHIFT                    4
#define XBAR_CTRL1_STS2_WIDTH                    1
#define XBAR_CTRL1_STS2(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL1_STS2_SHIFT))&XBAR_CTRL1_STS2_MASK)
#define XBAR_CTRL1_DEN3_MASK                     0x100u
#define XBAR_CTRL1_DEN3_SHIFT                    8
#define XBAR_CTRL1_DEN3_WIDTH                    1
#define XBAR_CTRL1_DEN3(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL1_DEN3_SHIFT))&XBAR_CTRL1_DEN3_MASK)
#define XBAR_CTRL1_IEN3_MASK                     0x200u
#define XBAR_CTRL1_IEN3_SHIFT                    9
#define XBAR_CTRL1_IEN3_WIDTH                    1
#define XBAR_CTRL1_IEN3(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL1_IEN3_SHIFT))&XBAR_CTRL1_IEN3_MASK)
#define XBAR_CTRL1_EDGE3_MASK                    0xC00u
#define XBAR_CTRL1_EDGE3_SHIFT                   10
#define XBAR_CTRL1_EDGE3_WIDTH                   2
#define XBAR_CTRL1_EDGE3(x)                      (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL1_EDGE3_SHIFT))&XBAR_CTRL1_EDGE3_MASK)
#define XBAR_CTRL1_STS3_MASK                     0x1000u
#define XBAR_CTRL1_STS3_SHIFT                    12
#define XBAR_CTRL1_STS3_WIDTH                    1
#define XBAR_CTRL1_STS3(x)                       (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL1_STS3_SHIFT))&XBAR_CTRL1_STS3_MASK)

/*!
 * @}
 */ /* end of group XBAR_Register_Masks */


