RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7.h
/* XBAR - Peripheral instance base addresses */
/** Peripheral XBAR base address */
#define XBAR_BASE                                (0x40055000u)
/** Peripheral XBAR base pointer */
#define XBAR                                     ((XBAR_Type *)XBAR_BASE)
#define XBAR_BASE_PTR                            (XBAR)
/** Array initializer of XBAR peripheral base addresses */
#define XBAR_BASE_ADDRS                          { XBAR_BASE }
/** Array initializer of XBAR peripheral base pointers */
#define XBAR_BASE_PTRS                           { XBAR }
/** Interrupt vectors for the XBAR peripheral type */
#define XBAR_IRQS                                { XBAR_IRQn }

/* ----------------------------------------------------------------------------
   -- XBAR - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBAR_Register_Accessor_Macros XBAR - Register accessor macros
 * @{
 */


/* XBAR - Register instance definitions */
/* XBAR */
#define XBAR_SEL0                                XBAR_SEL0_REG(XBAR)
#define XBAR_SEL1                                XBAR_SEL1_REG(XBAR)
#define XBAR_SEL2                                XBAR_SEL2_REG(XBAR)
#define XBAR_SEL3                                XBAR_SEL3_REG(XBAR)
#define XBAR_SEL4                                XBAR_SEL4_REG(XBAR)
#define XBAR_SEL5                                XBAR_SEL5_REG(XBAR)
#define XBAR_SEL6                                XBAR_SEL6_REG(XBAR)
#define XBAR_SEL7                                XBAR_SEL7_REG(XBAR)
#define XBAR_SEL8                                XBAR_SEL8_REG(XBAR)
#define XBAR_SEL9                                XBAR_SEL9_REG(XBAR)
#define XBAR_SEL10                               XBAR_SEL10_REG(XBAR)
#define XBAR_SEL11                               XBAR_SEL11_REG(XBAR)
#define XBAR_SEL12                               XBAR_SEL12_REG(XBAR)
#define XBAR_SEL13                               XBAR_SEL13_REG(XBAR)
#define XBAR_SEL14                               XBAR_SEL14_REG(XBAR)
#define XBAR_SEL15                               XBAR_SEL15_REG(XBAR)
#define XBAR_SEL16                               XBAR_SEL16_REG(XBAR)
#define XBAR_SEL17                               XBAR_SEL17_REG(XBAR)
#define XBAR_SEL18                               XBAR_SEL18_REG(XBAR)
#define XBAR_SEL19                               XBAR_SEL19_REG(XBAR)
#define XBAR_SEL20                               XBAR_SEL20_REG(XBAR)
#define XBAR_SEL21                               XBAR_SEL21_REG(XBAR)
#define XBAR_CTRL0                               XBAR_CTRL0_REG(XBAR)
#define XBAR_CTRL1                               XBAR_CTRL1_REG(XBAR)

/*!
 * @}
 */ /* end of group XBAR_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group XBAR_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

/* No backward compatibility issues. */

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MKM34Z7_H_) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MKM34Z7_H_) */

/* MKM34Z7.h, eof. */
